{
 "movie_url": "https://imsdb.com/scripts/Bad-Lieutenant.html",
 "movie_title": "bad lietenant",
 "movie_script": [
  {
   "type": "introduction",
   "text": "\"BAD LIEUTENANT\"\nby\nAbel Ferrara and Zoe Lund\n11/25/90\nFIRST DRAFT\nThis story takes place during a World Series between the\nMets and the A's. Canseco plays for Oakland, and Strawberry\nis still with New York."
  },
  {
   "type": "stage direction",
   "text": "DAY ONE:\nGAME THREE: LT WINS\nEXT: EARLY MORNING - LT'S HOME - QUEENS\nThis typical QUEENS HOUSE is sandwiched between other\nneighboring, nearly identical HOUSES.\nThe MORNING SOUNDS Of FAMILY BICKERING, LAWN MOWERS, and\nSHOUTED GOOD-BYES are heard coming from many HOUSES on this\nclose-knit block. A NEW BABY can be heard BAWLING inside\nLT'S HOUSE.\nLT, hurried and harried, stumbles out his FRONT DOOR. He\nheads for his CAR, parked askew in the DRIVEWAY.\nLT is some 40 years old. His natural swagger makes up for\nhis lack of conventional good looks. He is obviously hung-\nover.\nLT squints, pained by the SUN. He fumbles with his SHADES,\nputs them on.\nLT's TWIN EIGHT YEAR-OLD SONS trundle out the FRONT DOOR of\nthe HOUSE, bickering as they run to catch up with their Daddy.\nThe hefty TWINS wear ill-fitting PAROCHIAL SCHOOL UNIFORMS.\nTheir oversize PAROCHIAL SCHOOL BRIEFCASES threaten to trip\nthem up.\nLT's WIFE, BABE in arms, comes out to watch LT's lovely SEVEN\nYEAR-OLD DAUGHTER head off toward her school on foot. Many\nother members of LT's EXTENDED FAMILY hang out on the STOOP\nand the LAWN.\nAs the TWINS cross the LAWN, the bickering turns physical.\nThey start whacking each other with the BRIEFCASES. The TWINS\npile into LT'S CAR.\nCUT TO:\nINT: MORNING - LT'S CAR - EN ROUTE TO/AT PAROCHIAL SCHOOL\nThe CAR is obviously LT's home away from home. FOOD DEBRIS,\nBEER CANS, VODKA BOTTLES and other garbage litter the\ninterior.\nAn impressive HAND-GUN is visible between the seats.\nAn old ICON of MOTHER MARY rides on the DASHBOARD.\nAs the TWINS get in, LT tries to hide the GUN and the illicit\ndetritus.\nTo little avail. The TWINS pay no mind to his machinations;\nthey have evidently seen it all before.\nAs LT drives the TWINS to SCHOOL, the three play wild rough-\nhouse.\nThe CAR swerves crazily."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "How many times are you gonna miss\nthe bus? Huh? All the other kids can\nget up in the morning, but you guys\nwanna be driven around like the\nfucking President. I'm your goddamn\nchauffeur!"
  },
  {
   "type": "stage direction",
   "text": "(each taking alternate,\noverlapping lines)"
  },
  {
   "type": "speech",
   "character": "TWINS",
   "text": "Shit, man. It wasn't our fault! --\nYou think Sis is so perfect, well,\nif she hadn't hogged the fucking\nbathroom, maybe we -- I thought Aunt\nLu was dead! She was in there so\nlong..."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Shut up! Listen!"
  },
  {
   "type": "stage direction",
   "text": "ON RADIO: Chatter about Mets winning last night's game. It\nwas the THIRD GAME straight that they've won so far. One\nmore game -- set for tomorrow afternoon -- and the Mets will\nsweep the World Series. All listen."
  },
  {
   "type": "speech",
   "character": "TWIN",
   "text": "They're gonna win the Series in four!"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "All the way with Strawberry!"
  },
  {
   "type": "stage direction",
   "text": "(in unison)"
  },
  {
   "type": "speech",
   "character": "TWINS",
   "text": "Strawberry!"
  },
  {
   "type": "stage direction",
   "text": "The TWINS whoop and shout, celebrating LT's -- and their own --\nfavorite player.\nThey pass the PAROCHIAL SCHOOL BUS. It has stopped for a\nmoment taking on KIDS. LT cuts off the TWINS' tirade."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Shit, man -- there's your fucking\nbus I oughtta make you late! Make\nthe nuns whack the shit outa ya both."
  },
  {
   "type": "stage direction",
   "text": "LT and the TWINS banter back and forth, poke each other and\nbox around. The apparent hostility of their words is balanced\nby the laughter and gung-ho play of the rough-housing. The\nTWINS yell cat-calls as they drive past a BLONDE PEDESTRIAN.\nLT joins in.\nANGLE - Through the WINDSHIELD, the PAROCHIAL SCHOOL comes\ninto view. A CROWD of UNIFORMED KIDS is gathered outside.\nSEVERAL NUNS turn the CROWD into two neat rows, and usher\nthe KIDS inside.\nPOV LT - THE NUNS"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Get going."
  },
  {
   "type": "stage direction",
   "text": "The TWINS get out. Join the line of students entering the\nSCHOOL.\nThe instant the KIDS have left the CAR -- LT takes out some\nCOKE. Snorts it. He takes his GUN out of hiding.\nLT steers with his knees as he drives off toward the City.\nCUT TO:\nEXT: AFTERNOON - QUEENS - CRIME SCENE\nANGLE - A CAR WINDSHIELD. Blood-spattered and shot up. The\nDEAD BODIES of TWO GIRLS are in the front seat.\nLT gets out of his CAR and makes his way through the COPS\nand GAWKERS.\nThe BET COP comes up to LT."
  },
  {
   "type": "speech",
   "character": "BET COP",
   "text": "Two Black kids came up out of nowhere\nand shot those chicks. Then they\nlaughed as they walked away. The\nPress is gonna call it the \"Giggling\nMan Murders.\" I'll tell ya. What a\nworld."
  },
  {
   "type": "stage direction",
   "text": "LT gives a cursory glance to the crime scene. A couple of\nCOPS greet him; LT keeps walking.\nThe BET COP digs his attitude."
  },
  {
   "type": "speech",
   "character": "BET COP",
   "text": "But hey -- we make the best of it,\nman, don't we? Huh? How about them\nMets!"
  },
  {
   "type": "stage direction",
   "text": "FOLLOW LT - over to a GROUP of COPS. They greet him and\neveryone immediately crams into a parked CAR. The CAR stays\nparked for the duration of their meeting.\nCUT TO:\nINT: AFTERNOON - UNMARKED COP CAR (PARKED) - QUEENS\nNow that LT, the BET COP and the OTHER COPS are inside the\nCAR, they can do business. LT pays several COPS their WINNINGS\nfor last night's game. CASH and congratulatory banter is\nexchanged.\nNow LT has to take their BETS for tomorrow afternoon's GAME,\nthe FOURTH GAME of the World Series. LT urges the COPS to\nbet against the Mets."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "No fucking way they're gonna do it\nin four games straight."
  },
  {
   "type": "speech",
   "character": "COP ONE",
   "text": "You serious, man? I wanna go Mets\nall the way!"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Go ahead, man.If you've got shit for\nbrains. But if you wanna win the\nbucks, go with Oakland."
  },
  {
   "type": "speech",
   "character": "COP TWO",
   "text": "I thought Strawberry was gonna --"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "I know that nigger like he's my\nbrother. He ain't gonna let us off\nso easy. He'll make us sweat first.\nThis game's going to Oakland. Not a\ndoubt in my mind, man."
  },
  {
   "type": "stage direction",
   "text": "Silence. The COPS think about it for a moment.\nBET COP speaks up first; hands LT some CASH. When he talks\nto LT, his fawning posture is obvious."
  },
  {
   "type": "speech",
   "character": "BET COP",
   "text": "I'm in. Here."
  },
  {
   "type": "stage direction",
   "text": "COP ONE SHRUGS his assent, gives CASH to LT. The OTHER COPS\nfollow his example, place their BETS on OAKLAND.\nThe COP BETS total $800 -- on OAKLAND. LT has obviously been\nthe bookie for this precinct for a long time. He takes care\nof a lot of action and has these guy's faith.\nLT nods a goodbye, quickly gets out of the CAR. The BET COP\nand the OTHER COPS remain inside.\nCUT TO:\nEXT: AFTERNOON - PAY PHONE - MIDTOWN - 38TH STREET & 3RD\nAVENUE\nLT pulls up alone beside a PHONE BOOTH and phones in the\nCOPS' bets and his own to LITE. More than an anonymous\nconnection to the BOOKIE, LITE is obviously LT's old friend --\nand a hustler just like himself.\nLT shouts into the PHONE and holds it close to his ear. The\nTRAFFIC NOISE is loud and irritating."
  },
  {
   "type": "stage direction",
   "text": "(into the phone)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "I got them all going for Oakland.\nWith bullshit money. We'll cover the\n$800."
  },
  {
   "type": "stage direction",
   "text": "(OC)"
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "All right. What are you gonna do?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "I want 15 on the Mets."
  },
  {
   "type": "stage direction",
   "text": "(OC)"
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "How about 7 1/2?"
  },
  {
   "type": "stage direction",
   "text": "ACROSS THE STREET - TWO GUYS approach a BUSINESSMAN in a\nraincoat and flash a KNIFE. The BUSINESSMAN gives up his\nWALLET and his WATCH.\nLT pays no mind to the robbery."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Hey, man. Don't give me that bullshit.\nDon't pussy-out on me. The Mets are\na fucking lock. I wanna make some\nmoney."
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "Are you sure?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Yeah. I'm sure."
  },
  {
   "type": "stage direction",
   "text": "LT hangs up the PHONE, heads back toward his parked CAR.\nBy this time, the BUSINESSMAN is running into the street,\nwaving his arms and screaming."
  },
  {
   "type": "speech",
   "character": "BUSINESSMAN",
   "text": "Police! Police! Help me! Police!"
  },
  {
   "type": "stage direction",
   "text": "LT enters his car, drives off.\nCUT TO:\nEXT: EVENING - CRACK CITY\nLT arrives, leading a BUST. Lots of COPS. LT chases a handsome\nyoung COKE DEALER, JC, cornering him a couple flights up a\nstaircase. Now they're alone and the phony pantomime is over."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Hey, man, gimme something cooked!"
  },
  {
   "type": "stage direction",
   "text": "JC gives it to him with a PIPE. LT takes a drag of CRACK.\nThen LT gives JC a large BAG of COKE, labelled \"Exhibit A\"."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "It's good shit. From when they busted\nthose Columbians uptown. You can cut\nit in half."
  },
  {
   "type": "stage direction",
   "text": "JC nods, bemused by LT's manic behavior. JC, in contrast, is\nmellow and in control. LT smokes; JC doesn't.\nLT COUGHS and SMOKES as he shouts to COPS downstairs (OFF)."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "I got this guy. But there's someone\nacross the street on the roof!"
  },
  {
   "type": "stage direction",
   "text": "The COPS (OFF) rush out of the building.\nJC watches LT smoking like a fiend."
  },
  {
   "type": "speech",
   "character": "JC",
   "text": "That stuff'll kill you quick, man."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "What the fuck are you? A drug\ncounselor or a drug dealer? And you\ndon't even do your own product! What\nkind of businessman are you?"
  },
  {
   "type": "speech",
   "character": "JC",
   "text": "The rich kind."
  },
  {
   "type": "stage direction",
   "text": "(shakes his head)"
  },
  {
   "type": "speech",
   "character": "JC",
   "text": "Jeez, man. The way you smoke that\nshit is suicide."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Fuck you."
  },
  {
   "type": "stage direction",
   "text": "(takes a deep hit)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Just give me back a little something\nfor the road."
  },
  {
   "type": "stage direction",
   "text": "LT takes a handful of the COKE and puts it in a DOLLAR BILL;\npockets it."
  },
  {
   "type": "speech",
   "character": "JC",
   "text": "See you in a coupla days. Have the\ncash ready."
  },
  {
   "type": "stage direction",
   "text": "JC splits, runs up the stairs.\nCUT TO:\nINT: NIGHT - ARIANE'S APARTMENT - LIVING ROOM\nReligious/hip artifacts abound. It's a nice, if messy\napartment.\nHowever, it is definitely not large enough to merit the $3,500\nthat ARIANE quotes as her rent.\nARIANE is LT's mistress.\nBOWTAY, her girlfriend, lounges on the COUCH. BOWTAY plays\nthe third when LT is in the mood for a menage a trois. She's\naround a lot.\nBOWTAY is already zonked out on something. Maybe LUDES."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "Got something good for us?"
  },
  {
   "type": "stage direction",
   "text": "LT gives her the COKE. ARIANE takes some immediately. BOWTAY\nsloppily partakes.\nBefore LT can even sit down, the GIRLS start bitching."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "I'm gonna need some bread, man. This\nain't fair. I'm always here for you,\nand you can't even take decent care\nof me. My landlord is bitching like\na motherfucker! You're two months\nbehind on the rent, Lieutenant!"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Didya ever think of moving to a\ncheaper apartment? $3,500 a month is\ncrazy, man!"
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "It's nothing. This is New York, man..."
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "Oh -- I forgot. Bowtay needs some\ncash to buy her new acting headshots\nout of the developers. It's a good\ninvestment, man. She could make\nserious money!"
  },
  {
   "type": "stage direction",
   "text": "ANGLE - BOWTAY on the COUCH. It's obvious that she's going\nnowhere. And fast."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "We've been rehearsing a new monologue.\nFrom Shad's Saint Joan, you know?\nBowtay does it wonderfully well."
  },
  {
   "type": "stage direction",
   "text": "LT breaks out more COKE and some GRASS."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "All right, Bowtay. Show us your stuff."
  },
  {
   "type": "stage direction",
   "text": "ARIANE lifts BOWTAY to her feet. BOWTAY staggers into the\ncenter of the room, then falls back down on her knees. It\nhappens to be appropriate for the scene.\nBOWTAY begins to recite the monologue from the very end of\nthe play. \"When will the world be ready to receive thy\nsaints?\", etc.\nBOWTAY messes up a line; ARIANE lashes her with a BELT.\nBOWTAY doesn't move, continues reciting. ARIANE joins in\nfrom time to time.\nLT is turned on.\nHe begins KISSING ARIANE, then goes down onto the floor.\nBOWTAY is there already.\nKinky trio sex scene.\nCUT TO:\nINT: LATER THAT NIGHT - ARIANE'S APARTMENT - KITCHEN\nIt's evidently an hour or so later.\nThe KITCHEN is very bachelorette. No FOOD or COOKING\nIMPLEMENTS in sight.\nLT is messing around, looking for something to DRINK. He\nopens the REFRIGERATOR.\nPOV LT - CU - The REFRIGERATOR is entirely empty, save for a\nfew suspect and peculiar items. There is nothing in liquid\nform.\nLT hears ARIANE calling to him from the LIVING ROOM."
  },
  {
   "type": "stage direction",
   "text": "(OC - calling to LT)"
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "There's nothing!"
  },
  {
   "type": "stage direction",
   "text": "It's clear from the SEX SOUNDS (OC), that ARIANE and BOWTAY\nare still going at it."
  },
  {
   "type": "stage direction",
   "text": "(OC - calling to LT)"
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "Go out and get some Diet Cokes."
  },
  {
   "type": "stage direction",
   "text": "LT obeys. He leaves the KITCHEN.\nCUT TO:\nINT: NIGHT - ARIANE'S APARTMENT - LIVING ROOM\nLT passes through the LIVING ROOM, putting on his CLOTHING\nas he heads for the DOOR to OUTSIDE.\nThe GIRLS don't miss a sexual beat. They continue what is\nnow a menage a deux. They won't miss LT while he's gone.\nLT splits. No good-byes.\nCUT TO:\nEXT/INT: LATE NIGHT - KOREAN DELI\nLT approaches the market where he intends to buy the DIET\nCOKES.\nA display of FRESH FRUITS & VEGETABLES extends onto the\nsidewalk.\nLT notices a SQUAD CAR, parked in front of the MARKET. LT\npicks up his pace.\nCloser now, LT sees a YOUNG UNIFORMED COP outside, standing\nwith the KOREAN OWNER, an elderly man who doesn't speak much\nEnglish. The OWNER is agitated and out of breath. He argues\nfiercely with TWO YOUNG BLACK KIDS.\nA SQUAD CAR is parked in front of the MARKET.\nLT gets an idea. He takes command."
  },
  {
   "type": "stage direction",
   "text": "(to Cop)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "What's going on?"
  },
  {
   "type": "stage direction",
   "text": "The UNIFORMED COP is a timid rookie."
  },
  {
   "type": "speech",
   "character": "COP",
   "text": "Uh, Lieutenant, Sir -- The owner\nsays they stole cash from the\nregister. He was chasing them down\nthe block when I caught up with them."
  },
  {
   "type": "stage direction",
   "text": "The KOREAN OWNER is still agitated. He tries to give his\nside of the story, mixing English and Korean. At the same\ntime --\nThe TWO BLACK KIDS plead their case. They try to drown out\nthe OWNER. It all gets rather noisy."
  },
  {
   "type": "speech",
   "character": "YOUNG BLACK KID",
   "text": "We didn't do nothing, man !"
  },
  {
   "type": "stage direction",
   "text": "LT shouts in the YOUNG BLACK KID'S FACE. It's shockingly\nloud."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Shut the fuck up!"
  },
  {
   "type": "stage direction",
   "text": "LT turns to the UNIFORMED COP."
  },
  {
   "type": "stage direction",
   "text": "(to Cop)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Go get me a Bud. A High Boy. And\nmake sure it's fucking cold."
  },
  {
   "type": "stage direction",
   "text": "(indicates the\nsituation at hand)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "I'll straighten this out."
  },
  {
   "type": "stage direction",
   "text": "The UNIFORMED COP looks at LT for a moment, then goes.\nLT is now alone with the KOREAN OWNER and the TWO YOUNG BLACK\nKIDS.\nLT turns to the OWNER."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "How much did they take?"
  },
  {
   "type": "speech",
   "character": "KOREAN OWNER",
   "text": "Five hundred dollars cash."
  },
  {
   "type": "stage direction",
   "text": "The TWO YOUNG BLACK KIDS continue protesting their innocence."
  },
  {
   "type": "speech",
   "character": "YOUNG BLACK KID",
   "text": "We didn't --"
  },
  {
   "type": "stage direction",
   "text": "LT whips out his GUN and shoots a deafening BLAST between\nthe TWO KIDS' heads.It almost takes off the left ear of one\nand the right ear of the other.\nThe TWO YOUNG BLACK KIDS are stunned. Speechless.\nThe YOUNG UNIFORMED COP rushes out of the MARKET, GUN raised\nin one hand, BEER CAN in the other. He's relieved that a cop\nwasn't shot, but the whole situation makes him uneasy.\nLT grabs the BEER, points to the KOREAN OWNER."
  },
  {
   "type": "stage direction",
   "text": "(orders the Cop)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Take this guy down to the Precinct.\nI need to talk to him."
  },
  {
   "type": "stage direction",
   "text": "The OWNER protests wildly in Korean as the flustered COP\nushers him into a waiting SQUAD CAR. They drive off.\nNow LT is alone with the TWO YOUNG BLACK KIDS.\nLT takes the KIDS inside at gunpoint.\nINT: The store appears to be deserted."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Gimme the money! Now!"
  },
  {
   "type": "stage direction",
   "text": "The TWO YOUNG BLACK KIDS have regained some of their cool.\nThey are still belligerent."
  },
  {
   "type": "speech",
   "character": "YOUNG BLACK KID",
   "text": "We told you, man. We didn't take no --"
  },
  {
   "type": "stage direction",
   "text": "LT jams his GUN down the PANTS of one of the KIDS. At the\nsame time, he whips out his BADGE and thrusts it into the\nother KID'S FACE."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Give me the fucking money, assholes!"
  },
  {
   "type": "stage direction",
   "text": "They give LT the CASH. The KIDS stand there."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "What the fuck are ya standing there\nfor? Be gone!"
  },
  {
   "type": "stage direction",
   "text": "The KIDS, stunned, split.\nLT swaggers around the store, GUN in hand, drinking the BEER,\nassessing the inventory with a proprietary air. He pretends\nto SHOOT at various products. Plays around.\nIn the back aisle, LT aims his GUN at a BIG BOX of TOILET\nPAPER.\nWhile he holds the TOILET PAPER at bay, a THIRTEEN YEAR-OLD\nKOREAN KID rises up from behind it, his hands up, terrified.\nLT LAUGHS, then puts the GUN away."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Take over until your boss gets back.\nGimme a 6 of Diet Cokes and a 6 of\nBudweiser."
  },
  {
   "type": "stage direction",
   "text": "On LT's smiling face, we --\nCUT TO:\nINT: DAWN - ARIANE'S APARTMENT\nBOWTAY is curled up on the floor, asleep.\nARIANE is busy with a GOBLET, some TIN FOIL and other esoteric\nstuff.\nLT comes through the door with the SIX-PACK of DIET COKES\nand the SIX-PACK of BUDWEISER.\nHe puts them down, takes a BEER for himself. ARIANE doesn't\nturn around. She's busy preparing drugs."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "I got you a present. Better shit\nthen you got, cop!"
  },
  {
   "type": "stage direction",
   "text": "LT comes and looks over her shoulder. He sees --\nA PILE of BROWN HEROIN on a TIN FOIL SHEET. ARIANE is\npreparing the implements for \"chasing the dragon.\"\nBOWTAY rolls over, sprawls on the floor in an even sexier\nposition.\nOn her face, an expression of utter bliss.\nLT abandons the BEER."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Brown Downtown... There hasn't been\nany smoking brown on the street in --"
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "Who said anything about the fucking\nstreet. I've got more connects than\nyou have, Lieutenant..."
  },
  {
   "type": "stage direction",
   "text": "ARIANE helps LT with the thin, TIN FOIL PIPE. She burns the\nSMACK on the TIN FOIL SHEET for him so that he can manage to\ninhale the PLUME OF SMOKE in time.\nHe gets a nice, deep hit.\nARIANE gracefully takes a hit of her own.\nThey are both very high, already. Beginning to NOD OUT.\nARIANE goes back to the IMPLEMENTS and prepares another hit.\nThis time she catches the SMOKE in a SHERRY GOBLET and LT\ndrinks it.\nLT is very high now. A meditative, hallucinatory state.\nARIANE takes a DIET COKE and lies down on the BED.\nShe slowly sips soda through a straw. Her eyes are closed.\nLT sits in an EASY CHAIR by the WINDOW.\nLT NODS OUT while watching the SUNRISE. What we see appears\nto be HIS DREAM. From the melting RED SUN, we --\nDISSOLVE TO:\nEXT: DAWN (MEANWHILE) \u0097 CHURCH/CONVENT\nBLOOD! TWO KIDS are raping a NUN, attacking the SECOND NUN,\nand shitting on the ALTAR. Going berserk. They steal PURPLE\nROBES and the CHALICE.\nFrom the FIRST NUN, on her back on the altar, her robes ripped\nopen, a heart-rending pieta, we --\nHARD CUT TO:\nDAY TWO:\nGAME FOUR: LT LOSES $15,000\nINT: LATE AFTERNOON - LT'S HOME - QUEENS\nANGLE - CARTOONS on TV.\nLT has overslept, out cold on the COUCH. A LITTLE GIRL sits\non the floor, two feet from the TV, watching CARTOONS. Various\nother members of LT's over-extended FAMILY can be seen moving\naround the house, going about their business.\nA CARTOON EXPLOSION wakes LT. He jumps up in a panic."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Did I win? Shit! The game!"
  },
  {
   "type": "stage direction",
   "text": "LT bounds off the COUCH, Still half-asleep, he crawls to the\nTV, turns on GAME FOUR. The LITTLE GIRL starts CRYING."
  },
  {
   "type": "stage direction",
   "text": "(to background family\nmembers)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "What's the score? What's the fucking\nscore?"
  },
  {
   "type": "stage direction",
   "text": "An ANCIENT AUNT pokes her head into the LIVING ROOM."
  },
  {
   "type": "speech",
   "character": "ANCIENT AUNT",
   "text": "I dunno..."
  },
  {
   "type": "stage direction",
   "text": "She disappears again."
  },
  {
   "type": "stage direction",
   "text": "(to himself)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Why me, man?"
  },
  {
   "type": "stage direction",
   "text": "LT leans into the TV, transfixed, as --\nON TV: STRAWBERRY makes a fantastic catch of a Canseco drive\nwith runners on base. LT CHEERS.\nDOORS SLAM (OFF). The TWINS have come home from school.\nThey burst into the LIVING ROOM, loud as Hell. Furious about\nsomething they out-curse each other."
  },
  {
   "type": "stage direction",
   "text": "(to the Twins)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Shut the fuck up! Did you see that?"
  },
  {
   "type": "stage direction",
   "text": "(shrug - in unison)"
  },
  {
   "type": "speech",
   "character": "TWINS",
   "text": "It's 7-0: Oakland."
  },
  {
   "type": "stage direction",
   "text": "(single Twin)"
  },
  {
   "type": "speech",
   "character": "TWINS",
   "text": "That nigger could have let it drop\nand gone home."
  },
  {
   "type": "stage direction",
   "text": "LT curses and stomps around. The TWINS mimic his every move.\nAll three are pissed. The rest of the FAMILY pays no mind.\nCUT TO:\nINT: EVENING - LT'S CAR\nLT is furious. He COKES UP. DRINKS heavily.\nTired of the SPORTS STATIONS, LT turns on 911. There is a\ncall for an uptown MURDER SCENE.\nHARD CUT TO:\nEXT: NIGHT - 153RD/MARTIN LUTHER KING - CRIME SCENE\nCU - A YOUNG BLACK DEALER, eyes open, shot dead.\nLT drives up, sizes up the scene. It's fresh territory. He'll\nmilk it for what it's worth.\nLT ignores his colleagues, the COPS ON THE SCENE. He knows\nsome of the DEALERS and STREET CHARACTERS on the sidelines.\nHe heads straight for them.\nLT greets an impressively beautiful, six foot tall\nTRANSVESTITE. He takes her aside."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Hey, Veronica baby, looking good!\nWhat's going down?"
  },
  {
   "type": "stage direction",
   "text": "LT slips a HUNDRED DOLLAR BILL into VERONICA'S well-filled\nBRA."
  },
  {
   "type": "stage direction",
   "text": "(confidentially - to\nLT)"
  },
  {
   "type": "speech",
   "character": "VERONICA",
   "text": "Willie got shot by one of his boys."
  },
  {
   "type": "stage direction",
   "text": "(giggles)"
  },
  {
   "type": "speech",
   "character": "VERONICA",
   "text": "But there's a ki under the back seat."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "I'll put it in my trunk."
  },
  {
   "type": "stage direction",
   "text": "LT saunters up to the MURDER CAR, DEAD WILLIE still in the\nfront seat. LT is obviously berserk to get the KI, but he\ncan't show it. LT susses out the situation.\nAround him, POLICE TECHNICIAN-TYPES are busy lifting\nfingerprints and analyzing the CAR and WILLIE -- to no\napparent avail.\nLT uses his Lieutenants' privilege to enter the MURDER CAR\nand begin his own investigation.\nTIRE TRACKS are discovered nearby. The OTHER COPS are\ndistracted.\nLT takes his shot. He reaches for and finds the KI of COCAINE\nunder the BACK SEAT. LT slips it under his COAT and emerges\nfrom the MURDER CAR.\nOutside the MURDER CAR, LT makes to stand up. In the act, he --\nDROPS the BAG of COKE!\nLT is stunned. He can't believe the KI is actually in the\nshitty, gutter water, in plain view of the other COPS.\nThe COPS spot the KILO of COKE. Even those COPS that were\nfar away, somehow know what has happened. They quickly gather\nround the MURDER CAR, LT, and the KI.\nThe PLASTIC BAG filled with WHITE POWDER floats on the DEEP\nPUDDLE.\nLT is silent wrath incarnate."
  },
  {
   "type": "stage direction",
   "text": "(soft, sardonic)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "I guess he was a bigtime dealer..."
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "What d'ya know... A kilo of 'caine..."
  },
  {
   "type": "stage direction",
   "text": "Among the gathered COPS, only a SERGEANT is not quite\nconvinced."
  },
  {
   "type": "speech",
   "character": "SERGEANT",
   "text": "Where the fuck did that come from?"
  },
  {
   "type": "stage direction",
   "text": "The other COPS ignore the query.\nLT walks away.\nLT has successfully covered himself, but he walks off cursing\nand mumbling.\nVERONICA is laughing demonstratively in the background."
  },
  {
   "type": "stage direction",
   "text": "(to himself)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "I can't fucking believe it..."
  },
  {
   "type": "stage direction",
   "text": "LT is further away now from the scene of WILLIE'S murder and\nhis own debacle. LT overhears something. Cuts off his\nmuttering.\nA group of COPS are talking about the big news from the early\nmorning."
  },
  {
   "type": "speech",
   "character": "COP A",
   "text": "But I still can't fucking believe\nthey'd rape a nun, man..."
  },
  {
   "type": "stage direction",
   "text": "LT stops in his tracks. The erotic import of this conversation\nhas seized LT's imagination. He heads toward the cluster of\nCOPS, cuts in."
  },
  {
   "type": "stage direction",
   "text": "(to the Cops)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "What's this shit about a nun getting\nraped?"
  },
  {
   "type": "speech",
   "character": "COP B",
   "text": "Where the fuck have you been? It\nhappened this morning, up at St.\nDominiek's in Spanish Harlem. A coupla\npunks tore up the place and then\ngave it to the nuns but good."
  },
  {
   "type": "stage direction",
   "text": "The COPS turn away, continue to talk among themselves. LT\nwalks away.\nCUT TO:\nEXT: NIGHT - A CITY HOSPITAL PARKING LOT\nLT pulls up. Parks near a group of OTHER COPS, waiting by\ntheir CARS.\nHOSPITAL fauna passes by in the background: DOCTORS, NURSES,\nPATIENTS in all stages of recovery or relapse. The HOSPITAL\nitself rises in the background. It looks like a prison.\nLT leaves his CAR, heads for the GROUP of COPS. He joins\nthem, sits down on the HOOD of a nearby CAR. The COPS are\nall DRINKING heavily.\nPresent are the BET COP, and several other FAMILIAR COPS\nfrom previous scenes."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "What's going on?"
  },
  {
   "type": "speech",
   "character": "FIRST COP",
   "text": "They raped a nun and tore up the\nchurch -- they even took a crap on\nthe altar. Up in Spanish Harlem."
  },
  {
   "type": "speech",
   "character": "SECOND COP",
   "text": "She was only seventeen..."
  },
  {
   "type": "stage direction",
   "text": "A COP opens his TRUNK -- he has a BAR inside. The COPS,\nincluding LT, respond enthusiastically. DRINK UP."
  },
  {
   "type": "speech",
   "character": "FIRST COP",
   "text": "Who the fuck could do this?!"
  },
  {
   "type": "speech",
   "character": "OLD IRISH COP",
   "text": "The young nun's just a kid from\nIreland. Imagine having to come here\nto have that happen!"
  },
  {
   "type": "speech",
   "character": "SECOND COP",
   "text": "Jesus... What's she gonna tell her\nmother?"
  },
  {
   "type": "speech",
   "character": "OLD IRISH COP",
   "text": "I'm gonna kill those motherfuckers."
  },
  {
   "type": "stage direction",
   "text": "The COPS keep DRINKING. All of them lounging around on or\nbeside the CARS.\nLT watches quietly, taking it all in. As if following the\nmotto: \"He who defines himself, confines himself.\""
  },
  {
   "type": "speech",
   "character": "THIRD COP",
   "text": "The Church already put up a $50,000\nreward!"
  },
  {
   "type": "speech",
   "character": "FIRST COP",
   "text": "Well, one of us is gonna get it. I\nmean -- get them."
  },
  {
   "type": "stage direction",
   "text": "The FIRST COP raises a TOAST."
  },
  {
   "type": "speech",
   "character": "FIRST COP",
   "text": "Here's to payback for the nuns!"
  },
  {
   "type": "stage direction",
   "text": "The COPS all whoop and cheer."
  },
  {
   "type": "speech",
   "character": "SECOND COP",
   "text": "Anyone got any leads, at all?"
  },
  {
   "type": "speech",
   "character": "FIRST COP",
   "text": "We got shit to go on. Only that list\nof inventory -- what they stole from\nthe church."
  },
  {
   "type": "speech",
   "character": "THIRD COP",
   "text": "Y'know they actually stole those\nwacky purple robes? And they took\nthe chalice -- with the Host still\ninside!"
  },
  {
   "type": "speech",
   "character": "SECOND COP",
   "text": "What did they want with the Host?"
  },
  {
   "type": "speech",
   "character": "THIRD COP",
   "text": "They were hungry. I dunno. They didn't\nwant to hock the Host, they wanted\nto hock that golden chalice."
  },
  {
   "type": "stage direction",
   "text": "COPS avoid each others' eyes. Competition has begun. No one\nshares information, each after the reward for himself.\nLT bursts out, swings into high gear."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Leave it to the Catholic Church,\nman. Girls get raped everyday, and\nnow they're gonna pay 50 G just\nbecause these chicks wore penguin\nsuits!"
  },
  {
   "type": "stage direction",
   "text": "Some of the COPS laugh, others are offended."
  },
  {
   "type": "stage direction",
   "text": "(to LT)"
  },
  {
   "type": "speech",
   "character": "OLD IRISH COP",
   "text": "What's your fucking problem?!"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "The Church is a racket."
  },
  {
   "type": "speech",
   "character": "OLD IRISH COP",
   "text": "So what. Are you a Catholic?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Sure!"
  },
  {
   "type": "speech",
   "character": "OLD IRISH COP",
   "text": "Do you believe in God?"
  },
  {
   "type": "stage direction",
   "text": "LT doesn't reply. He's thinking.\nThe BET COP and a couple of OTHER, FAMILIAR GAMBLER COPS\nmove in. They've got nothing on their minds but the World\nSeries."
  },
  {
   "type": "stage direction",
   "text": "(to LT)"
  },
  {
   "type": "speech",
   "character": "BET COP",
   "text": "To Hell with this God stuff. How's\nthat Strawberry? He does what ever\nyou want him to, huh Lieutenant?\nEven strike out!"
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "BET COP",
   "text": "I bet you won a shitload on Oakland.\nHow much, huh?"
  },
  {
   "type": "stage direction",
   "text": "LT comes down off the CAR HOOD. Now he has to feign pride in\nhis supposed big bet on OAKLAND.\nLT has to convince the COPS to keep betting -- he can't afford\nto pay them all off. Unfortunately, the COPS all think LT\njust scored big, himself."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "More than you did."
  },
  {
   "type": "speech",
   "character": "GAMBLER COP TWO",
   "text": "Well, let's see some green!"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "If you know what's good for you,\nyou'll keep staying on Oakland!"
  },
  {
   "type": "speech",
   "character": "BET COP",
   "text": "Oakland? Is that how you're going?"
  },
  {
   "type": "stage direction",
   "text": "LT nods \"yes.\" An outright lie."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Yeah. Sure. Don't you get it? The\nseries has gotta last seven games.\nThe last two did, didn't they? It's\na racket. Do you have any idea how\nmuch money they make selling\ntelevision-time for commercials during\nthe series? Especially if it's a New\nYork team? They won't close the gold\nmine after only four games. It'll\nlast a full seven. Too many people\nwanna milk it for what it's worth.\nYou'll see!"
  },
  {
   "type": "speech",
   "character": "BET COP",
   "text": "All right... I'm in. After all, you're\nthe expert. Ain't that right, LT?"
  },
  {
   "type": "stage direction",
   "text": "SEVERAL COPS, including some of the COPS who have been hanging\nout in front of the HOSPITAL, go double or nothing on OAKLAND.\nLT takes their BET MONEY -- $900.\nOne COP doesn't go along with the deal. LT painfully pays\nhim off."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "You'll be sorry, man. But if you\nwanna be a sissy, here's your bread."
  },
  {
   "type": "stage direction",
   "text": "LT sits back on top of his CAR, DRINKING heavily. He toasts\nSTRAWBERRY. The others are uneasy. Why toast STRAWBERRY?"
  },
  {
   "type": "speech",
   "character": "COP ONE",
   "text": "Strawberry? I thought we were going\nwith Oakland."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "We are, man! That's the point! If\nthe Mets win, it's thanks to\nStrawberry. If Oakland wins, it's\nthanks to Strawberry. Nothing can\nhappen out there on the field that\ndon't gotta do with Strawberry. So\nhere's to Strawberry!"
  },
  {
   "type": "stage direction",
   "text": "The others join in the TOAST, but are uneasy.\nCUT TO:\nINT: LATE NIGHT - CORRIDORS OF A CITY HOSPITAL - HUNTING FOR\nTHE NUN\nThe HOSPITAL is an inferno. LT exploits his cop privileges;\nshows his BADGE to the GUARDS.\nHe wants to get into the inner sanctum. Beyond where even\nCOPS were allowed to go. He wants to get to the NUN.\nA sexy NURSE stops him."
  },
  {
   "type": "speech",
   "character": "NURSE",
   "text": "Can I help you?"
  },
  {
   "type": "stage direction",
   "text": "LT can't help but check her out and flirt."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "I'm in charge of the investigation.\nJust checking security."
  },
  {
   "type": "stage direction",
   "text": "(Suspicious)"
  },
  {
   "type": "speech",
   "character": "NURSE",
   "text": "Security?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Do you want those guys coming back?\nFor the nun? Or for you?"
  },
  {
   "type": "stage direction",
   "text": "The NURSE looks at him, unsure, then walks off down the\nCORRIDOR.\nLT continues his hunt.\nHe comes upon a DOOR that is plastered with \"QUARANTINE\"\nSIGNS. One too many, perhaps. LT senses the NUN is inside.\nHe has to open the DOOR, but hopes he won't get a blast of\ndisease in his face. He CROSSES himself -- wearing a smirk,\nbut nonetheless. Going on instinct, LT opens the door a crack.\nHe's right. It's the NUN. He positions himself outside the\nDOOR, keeping it open a few inches. He peeks inside without\nbeing seen.\nCUT TO:\nINT: LATE NIGHT - THE NUN'S HOSPITAL EXAMINING ROOM\nFrom just outside the door, LT peep-toms on the NUN while\nshe is being examined. He sees her stark naked, laid out on\na table, her legs spread wide apart.\nThe DOCTORS, NURSES, COUNSELORS work on the NUN as if they\nare automatons. They don't grasp either the humanity or the\ntrotitism of the scene. LT does. The image of The Alabaster\nNun turns him on no end. Yet there is also a deeper pathos\nto the scene.\nAnd the NUN is spectacularly beautiful. She doesn't speak.\nLooks like a Pieta.\nA DOCTOR in a WHITE-COAT reads the MEDICAL REPORT to a FEMALE\nCOP. The FEMALE COP writes down the details on a hard-backed\npad. As if it's a parking ticket.\nThe moving contrast between the words and the image seems to\nbe apparent to LT -- and the NUN -- alone."
  },
  {
   "type": "stage direction",
   "text": "(to Female Cop)"
  },
  {
   "type": "speech",
   "character": "DOCTOR",
   "text": "They inserted a crucifix eleven\ncentimeters into her vaginal aperture,\nbreaking the hymen membrane. Then\nthey pursued the same course with\ntheir natural organs of sexual\npenetration. They used a sharp object,\nprobably a hunting knife with a curved\nblade, to carve a cross between her\nshoulder blades, entering the flesh\nan average of nearly one centimeter\nthroughout the area of the wound.\nThey --"
  },
  {
   "type": "stage direction",
   "text": "Finally, as if she knew he was there all along, the NUN looks\nup at where LT is hiding and boldly meets his eyes.\nCUT TO:\nINT: VERY LATE NIGHT - ARIANE'S APARTMENT\nLT has been there for some time. They are alone. They've\nboth been DRINKING and COKING.\nLT is carrying on about the NUN. As he speaks about various\nsubjects, his tone changes radically. From contempt and\ncynicism to profound reverence. From decadence -- to awe.\nARIANE, too, manages to switch from one attitude to the other."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Have you ever seen a naked nun? I\ntell you, man, I went to school with\nthe nuns, I've seen hundreds since\nthen and I've never even seen a nun's\nbelly button, you understand? But\nthis nun, let me tell you. What a\nbeautiful lady..."
  },
  {
   "type": "stage direction",
   "text": "(snaps out of his awe)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "And where'd the Church get the 50 G\nin the first place? The fucking Church\nis the biggest scam going. You know\nwhat's the real killer? It costs\n$8,000 per kid for them to go to\nparochial school. I've got three\nkids in there already, with two on\nthe way! Christ. That fucking reward\nis my money, man! But that's Church\npolicy. The Pope is the world's\nbiggest bookie. Makes people bet on\ntheir own salvation! Double or nothing\non Heaven. You go to Hell -- then go\nto Hell. In the beginning was the\nWord, and the Word was bullshit."
  },
  {
   "type": "stage direction",
   "text": "ARIANE can't stop thinking about the rape."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "I can't get over what those guys did\nto her. I just can't."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "They're alive, aren't they? Come on,\nman! Everyone's making such a fucking\nfuss, just because she's a nun. Just\nbecause she wears a penguin suit,\nthe church puts up 50 G for the guys\nwho dared to rape her. Do you think\nthey'd put up a dime if you got raped?\nOf course not. Or even for your little\nsister? The virgin? Like shit they\nwould."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "Susie's not a virgin anymore."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "She's fucking nine years old! Jesus\nChrist."
  },
  {
   "type": "stage direction",
   "text": "ARIANE suddenly starts up."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "And the nun's not a virgin anymore,\neither. Will they make her leave the\nconvent?"
  },
  {
   "type": "stage direction",
   "text": "LT thinks for a moment."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Who knows? Who knows what their policy\nis."
  },
  {
   "type": "stage direction",
   "text": "(sudden dreamy\nreverence)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "But I'll tell you, man, that nun...\nShe was beautiful. Just beautiful...\nTall... Real tall... I've never seen\nanything like it..."
  },
  {
   "type": "stage direction",
   "text": "LT snaps out once again, grabs the TELEPHONE. He dials LITE.\nHe's not in. LT leaves ARIANE'S NUMBER on LIMELITE'S BEEPER.\nHangs up."
  },
  {
   "type": "stage direction",
   "text": "(to himself)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Lite, man... Where the fuck are you?"
  },
  {
   "type": "stage direction",
   "text": "ARIANE can't get the image of the rape out of her mind."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "It's horrible. They burned her breasts\nwith cigarettes. Christ."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Yeah? At least she's alive! I see\npeople get killed every day! Worse\nyet, tortured first and then killed!\nThe nuns got off easy. Jeez. Cigarette\nburns. Everyone's all upset about\nfucking cigarette burns. I'll show\nyou cigarette burns!"
  },
  {
   "type": "stage direction",
   "text": "LT stubs out his CIGARETTE on the back of his hand. He does\nthe move with intensity and bravado.\nARIANE responds by calmly doing the same. But she does it\nentirely impassively, and rubs the CIGARETTE into her flesh\nlonger than LT did.\nARIANE comes over to LT and starts kissing and licking his\nCHEST."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "Do you believe in God? Do you believe\nthat Jesus Christ is the Son of God?."
  },
  {
   "type": "stage direction",
   "text": "LT hesitates.\nARIANE kneels down in front of LT. As if in prayer.\nShe starts giving him head.\nBefore he can answer The Question, he is saved by the bell.\nThe PHONE RINGS. LT picks up immediately. It's LITE.\nAs LT speaks to LITE, ARIANE continues to give him head."
  },
  {
   "type": "stage direction",
   "text": "(to LITE; over the\nphone)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Yeah, I know, I know all about it.\nEnough already about the fucking\nnuns. Yeah. Yeah. So just take the\nbet. Don't give me any hassles, man.\nJust put in my bet. 30 G's. Yeah.\nAnd I got $900 from the cops on\nOakland. Yeah. Right. Strawberry's\ngonna knock em dead. Of course he\nis! You know that! Yeah. Yeah. Have\nfaith, man! OK. Right."
  },
  {
   "type": "stage direction",
   "text": "LT hangs up, thinks ARIANE won't resurface the God Question.\nARIANE does, even as she gives him head. Every time she\nspeaks, she pulls away and it frustrates him. This dialectic\ncontinues throughout the scene."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "Do you believe in God?"
  },
  {
   "type": "stage direction",
   "text": "LT thinks about it, even as ARIANE gets him hotter and hotter."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "The Church is a fucking racket. I\nknow how they operate. I've been\npart of the racket since the first\ntime some faggot priest spilt water\non my head. My Aunt Lu says I was\ncrying all the way through. Yeah, I\nknow their game inside out. Now I'm\nfree of it and I'm gonna stay that\nway."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "I'm not talking about the fucking\nChurch. Fuck the Church. But tell\nme. Do you believe in God?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "What's to believe?"
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "That Jesus Christ was the Son of God\nand he came to die for your sins."
  },
  {
   "type": "stage direction",
   "text": "LT can't respond. He's distracted by his own pleasure.\nARIANE does something OC that causes LT sudden pain.\nLT cries out. Snaps to attention. Looks at ARIANE."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "Your sins, Lieutenant!"
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "And look around you! Where do you\nthink all this shit came from?"
  },
  {
   "type": "stage direction",
   "text": "ARIANE gives him head again. LT is more excited now than\nbefore she hurt him."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "People."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "You believe that man is the be-all\nand end-all?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Yeah."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "OK. OK. Fine. But -- do you believe\nin God?"
  },
  {
   "type": "stage direction",
   "text": "As if in answer. LT begins to RECITE THE ACT OF CONTRITION"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "I believe in God the Father Almighty,\nCreator of Heaven and Earth..."
  },
  {
   "type": "stage direction",
   "text": "This turns on ARIANE. She stops talking. Writhes and grapples\nhim.\nLT is reaching climax. When describing Jesus rising again --\nLT has an orgasm.\nCUT TO:\nEXT INT: VERY LATE NIGHT - LT'S CAR\nLT drives, DRUNK and fired-up. He has a BOTTLE of VODKA in\nthe CAR.\nPOV LT - A CAR with only one TAILLIGHT. A Cyclops in the\ndarkness. Under a STREETLIGHT, JERSEY PLATES are visible. So\nare the two inebriated, leather-clad GIRLS inside. LT pulls\nthem over.\nLT comes on to them. He's way out there. The GIRLS are\nsmashed.\nLT notes their \"Heavy Metal\" CROSSES, and questions them."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "You wouldn't put some religious trip\non me, would you?"
  },
  {
   "type": "speech",
   "character": "JERSEY GIRL",
   "text": "Uh-uh... What?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Good. Show me your papers."
  },
  {
   "type": "stage direction",
   "text": "LT looks at their PAPERS. Points to the name to which the\nCAR is registered."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Who's this person? It ain't you, and\nit ain't you, so who is it?"
  },
  {
   "type": "speech",
   "character": "GIRL",
   "text": "My Aunt."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "So you took the car from you Aunt.\nStole it. Am I right?"
  },
  {
   "type": "speech",
   "character": "GIRL",
   "text": "We were gonna give it back! We're on\nour way home, now!"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Yeah, yeah."
  },
  {
   "type": "stage direction",
   "text": "LT gets into the CAR, looks around. He finds a BAG OF POT.\nLT waves the POT in front of the GIRLS."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Now why don't I just call up your\nAunt right now and tell her what's\ngone down. How about that?"
  },
  {
   "type": "stage direction",
   "text": "The GIRLS are petrified.\nLT grins. He takes out his own ROLLING PAPER, starts to ROLL\na JOINT with their POT."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Well, I'm sure we could arrange\nsomething... Unless you fancy a few\ndays in jail..."
  },
  {
   "type": "stage direction",
   "text": "He blackmails them into humiliating sex scenes. On a side\nstreet off Eleventh Avenue, LT plays it out until dawn.\nCUT TO:\nDAY THREE:\nGAME FIVE: LT LOSES $30,000\nEXT INT: DAWN - THE CHURCH/CONVENT\nLT drives up erratically and parks his CAR in front of the\nCHURCH/CONVENT.\nLT stumbles into the CHURCH. Alone now, he notes various\naspects of the DESECRATION, but can't see much because he's\nblind drunk.\nThe enormous, graphically bloody CRUCIFIX confronts him.\nHe collapses immediately into a PEW. Sleeps.\nTIME PASSES\nCUT TO:\nINT: MORNING - CHURCH/CONVENT\nLT wakes up. Ruckus all around him. The COPS are there in\nforce -- including some of the guys from the BAR, the UPTOWN\nMURDER and the HOSPITAL PARKING LOT. They are privately\nchecking out the Scene of the Crime, looking for leads that\nwill give them an advantage. Everyone wants the TWO NUNS to\ntalk. The NUNS are in a circle of interrogators. At first,\nLT can't even see them.\nThe ELDERLY NUN was attacked but not raped. They carved\ncrosses on her.\nIn the background, the questioning has already begun. The\ninterrogators become increasingly frustrated. It can be heard\nin their voices. They want the reward, and -- despite a\ncertain constipated \"respect\" in their attitude -- the COPS\nare willing to browbeat the NUNS to get it.\nLT silently bums a COFFEE off a COP and staggers into the\nring.\nLT hangs back in the crowd, staring at the YOUNG NUN as the\nCOPS interrogate both NUNS."
  },
  {
   "type": "speech",
   "character": "COP 1",
   "text": "Can't you tell us anything? Sisters?\nAnything at all?"
  },
  {
   "type": "stage direction",
   "text": "The ELDERLY NUN speaks up."
  },
  {
   "type": "speech",
   "character": "ELDERLY NUN",
   "text": "They broke my glasses. I didn't see\nanything, but I did hear them. They\nwere young. And there were two of\nthem. They spoke Spanish. One of\nthem was named Julio."
  },
  {
   "type": "stage direction",
   "text": "LT, on the sidelines, turns to an OLDER COP. LT mutters his\ncommentary"
  },
  {
   "type": "stage direction",
   "text": "(to Older Cop)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Julio. Great. There are 20,000 spics\nnamed \"Julio\"."
  },
  {
   "type": "stage direction",
   "text": "The ELDERLY NUN lowers her head. Shamed."
  },
  {
   "type": "speech",
   "character": "ELDERLY NUN",
   "text": "I would tell you more if I could. I\nam so sorry, Officers."
  },
  {
   "type": "stage direction",
   "text": "Now the COPS are magnetized by the YOUNG NUN. She does not\nappear to need GLASSES. Evidently, she could give the COPS\nwhat they want."
  },
  {
   "type": "speech",
   "character": "COP 2",
   "text": "What about you, Sister? Won't you\ntell us anything?"
  },
  {
   "type": "stage direction",
   "text": "LT watches the YOUNG NUN as --\nPOV LT - The YOUNG NUN smiles a quiet, intractable smile.\nCOP 2 is screaming mad, but tries to hide it.\nLT has observed their interaction. Though he would have loved\nto have heard some information from the YOUNG NUN, her\ndefiance gives him even more pleasure.\nThe MONSIGNOR comes forward to \"translate\" the NUNS' stubborn\nsilence. He is possessed by a conventional sort of ambition --\nthis is his big chance. He would like to be Cardinal some\nday, but never will be. He enjoys the spotlight as he\npontificates."
  },
  {
   "type": "speech",
   "character": "MONSIGNOR",
   "text": "Listen. One nun is nearly 80 years\nold. I'm not from this Church, of\ncourse, but I assume they'll be\ngetting her a new pair of glasses.\nApparently she's legally blind without\nthem. The Sister who suffered a rape\nis just 17. She arrived from Ireland\nonly a couple of months ago. This --\nevent -- is just too much for them\nto take!"
  },
  {
   "type": "stage direction",
   "text": "The MONSIGNOR clears his throat demonstratively, takes a\ndicitous tone."
  },
  {
   "type": "speech",
   "character": "MONSIGNOR",
   "text": "Listen. The Church would like to\nknow who did it just as much as the\nNYPD. These arrant criminals broke\nthe laws of man, and the laws of\nGod. The Church wants nothing more\nthan to see them behind bars. That's\nwhy we're offering the $50,000 reward\nto whomever brings them in. I'm sure\nour hero will be one of New York's\nFinest."
  },
  {
   "type": "stage direction",
   "text": "The YOUNG NUN shoots the MONSIGNOR an offended look.\nIt appears for a moment as if the YOUNG NUN makes eye contact\nwith LT. But he can't be sure.\nLT leaves the crowd, disappears out the DOOR.\nCUT TO:\nINT: LATE AFTERNOON - RUSH HOUR - LT'S CAR - 54TH STREET AT\nFIFTH AVENUE\nLT is driving through HEAVY TRAFFIC while listening to GAME\nFIVE on the RADIO. He COKES UP. He mumbles to himself.\nGAME FIVE is close, and features STRAWBERRY. As LT listens,\nhe reacts physically to the changing status of the game.\nHe drives crazy through the streets, pounds the ceiling.\nHe's so COKED, he's bouncing out of his skin. LT drinks VODKA\nout of a PINT BOTTLE in his COAT.\nSTRAWBERRY overthrows a sacrifice fly from Canseco and the\nA's WIN.\nLT shoots out the CAR RADIO. LT LOSES! He's $30,000 down.\nCovering himself, he puts the LIGHTS on top of his CAR. Turns\nthe SIREN on. Screaming CURSES, he drives through the streets,\ncareening like a madman. PEDESTRIANS run away in terror.\nCUT TO:\nINT: AFTERNOON \u0097 \"WHITE\" CHURCH \u0097 HIS DAUGHTER'S FIRST\nCOMMUNION\nCU \u0097 LT'S EIGHT YEAR-OLD DAUGHTER takes the WAFER for the\nfirst time.\nLT is dressed to kill. Looks like a corpse.\nHe watches his DAUGHTER'S First Communion and is truly moved.\nRemembers his own past.\nWhile the rest of the attendant EXTENDED FAMILY, FRIENDS,\nand SOME COPS enter the COMMUNION PARADE, LT stands alone at\nthe back of the CHURCH like an usher. He holds the COLLECTION\nBASKET and quietly watches the whole scene.\nLT, his betting friend who is not a cop comes up beside him."
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "OK asshole. You owe thirty grand.\nNow what are you gonna do?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "I wanna go double or nothing on the\nnext game."
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "Double or nothing? Are you fucking\nout of your mind?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "I'm not gonna let that bastard take\nmy money"
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "Take your money? This guy will blow\nup your house and everyone in it!"
  },
  {
   "type": "stage direction",
   "text": "(stoic)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "There's just no way the Mets will\nlose this game. Gooden is pitching\nand Strawberry is ready to break\nout."
  },
  {
   "type": "stage direction",
   "text": "LITE looks his friend up and down as if he's lost his mind."
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "Fuck Strawberry. You're gonna end up\nowing 60 G to a homicidal maniac!"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "That's my problem. Just put in my\nbet."
  },
  {
   "type": "stage direction",
   "text": "LITE gestures assent, but is not happy. He waits a moment,\nlooks around.\nPOV LITE - LT'S FRIENDS and FAMILY. LT'S DAUGHTER in her\nCOMMUNION DRESS.\nFrom the pristine interior of the \"WHITE CHURCH\" we --\nHARD CUT TO:\nINT: AFTERNOON \u0097 THE CHURCH/CONVENT\nThe interior of the CHURCH/CONVENT is still desecrated. In\nstark contrast to the \"White Church\" (above, Scene 22).\nPOLICE ROPES have cordoned off certain desecrated areas of\nthe CHURCH. In other places, MOPS and SLOPPY BUCKETS of SHIT-\nWATER wait for someone to finish cleaning up.\nLT appears to be entirely alone in the CHURCH. He is desperate\nfor clues. He searches for leads and perhaps, for something\nelse...\nCU - He lights a CANDLE, gives a QUARTER --\nThen LT lights his CRACKPIPE ever the FLAME.\nSuddenly the NUN appears.\nLT hides, watches as the NUN enters the CONFESSIONAL Once\nshe is ensconced inside, LT stealthly approaches the\nCONFESSIONAL and from right outside -- a tantalizing proximity --\nhe listens as she confesses to the PRIEST. (This is an elderly\nPRIEST with a striking, unusual voice. Not the MONSIGNOR\nfrom the COPS' interrogation of the NUNS. Scene 20.)"
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "Forgive me Father, for I have sinned.\nIt has been two days since my last\nconfession. Father, my sin is a\nterrible sin. A sin of omission.\nThere was another sin that happened\nat the same time, and in the same\nplace, but my sin I think was graver\nstil."
  },
  {
   "type": "speech",
   "character": "PRIEST",
   "text": "Sister, we all know what happened to\nyou yesterday morning. I expected\nthat you would want to speak to me\nabout it. But you could have come to\nmy office. Your being here, in the\nconfessional, implies that you,\nSister, have done something wrong.\nYou haven't. I assure you. I feared\nyou might have misplaced feelings of\nguilt. If you condemn yourself because\nyou experienced feelings of...\ncuriosity or even... pleasure, you\nmustn't --"
  },
  {
   "type": "stage direction",
   "text": "The NUN LAUGHS. At first, it sounds like crying. But it is a\nstrange, low laughter."
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "Father, if it was so trivial, so\nnatural, so -- No. I have sinned.\nAnd you must listen if you are to\nprescribe an appropriate act of\ncontrition, and to absolve me. Father,\nwhat would you do if you had but one\nday in which to use your arms to\nserve God?"
  },
  {
   "type": "speech",
   "character": "PRIEST",
   "text": "It's funny, you knew. But the first\nthing I think of is kneading the\nbread that I help bake for the soup\nkitchen. Maybe that's because my the\nmuscles in my arms still hurt."
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "I also thought of that bread, Father.\nAnd of that night six days ago when\nthe Mother Superior died, and I kept\nthe cool, damp cloth on her forehead\nfreshly moist. Father, what would\nyou do if you had but one day in\nwhich to use your legs to serve God?"
  },
  {
   "type": "speech",
   "character": "PRIEST",
   "text": "I think of running for help, and\nfalling to my knees in prayer."
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "As I have prayed day and night since\nthe desecration of this church\nyesterday morning -- and my sin. You\nsee, Father --"
  },
  {
   "type": "speech",
   "character": "PRIEST",
   "text": "Yes, Sister?"
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "Yesterday morning, God gave me but\none chance to use something else to\nserve Him. Not my arms or my legs,\nbut something I used for the first\ntime, for the last time, and will\nnever use again. My vagina."
  },
  {
   "type": "stage direction",
   "text": "Outside the CONFESSIONAL. LT reacts to the explicit word.\nShock. Titillation and fascination."
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "Those boys, those sad, raging boys...\nThey came to me as the needy do. And\nlike many of the needy, they were\nrude. Like all the needy, they took.\nAnd like all the needy, they needed."
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "Father. I knew them; They learn in\nour school. And play in our\nschoolyard. And they are good boys."
  },
  {
   "type": "speech",
   "character": "PRIEST",
   "text": "You knew them?"
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "PRIEST",
   "text": "Who were they, Sister? Who are these\nboys? What are the names of these --\ngood boys you knew?"
  },
  {
   "type": "stage direction",
   "text": "Outside the CONFESSIONAL, LT stiffens. This could be the\nclue he needs to solve the case."
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "I could tell you their names now,\nand I know you'd be bound by a sacred\nvow to keep my secret. But I cannot\ntell you their names. For I, too, am\nbound. As I am bound now to confess\nmy sins. So listen, Father Listen."
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "I am a nun. What did I give those\nboys that they could not have found\nelsewhere? Nothing. Nothing at all.\nThere were always two of us in the\nact. The act was half my own. It\ndoes not seem to me the act was half\nthe act of a once of Christ."
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "It is the lost chance that will remain\non the ledger of my sins. Not the\nloss of my virginity. The rape forced\nupon me a choice. As a vessel of the\nspirit. I could have imbued my vagina\nwith God. Or, I could have turned\naway from God and voided my body of\nspirit, so that all that was left\nfor those boys was a lump of flesh.\nI chose the second path. The easier,\npath. The path of the material world.\nThe path no nun has the right to\ntake. And so, I sinned."
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "My vagina spread, but spread no word.\nIt opened, on nothingness. It gave\nnothing at all and left nothing\nbehind. No trace of my act, yes my\nact. For I was there, too, remains\nin the landscape of God."
  },
  {
   "type": "stage direction",
   "text": "The NUN'S description of the RAPE is both a turn on for LT\nand a matter of profound curiosity. Something divine. His\nsilent reactions embody both decadence and awe. This apparent\nparadox can find unified expression in his character, though\nat other moments it threatens to tear him apart. The tension\nbetween the two polarities will propel him toward his destiny."
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "Jesus turned water to wine. I ought\nto have turned bitter semen to fertile\nsperm -- hatred to love. And maybe\nto have saved their souls. They did\nnot love me. I ought to have loved\nthem. As Jesus loved those who reviled\nhim. I ought to have surprised those\nboys. Instead, they surprised me,\nand got no surprise at all. No, they\ndid not rape a nun. But a nun has\nbeen raped. And the nun must now\natone for her sin. For a God-given\npart of her was wasted. A part which\nother women use for procreation, for\nconjugal fulfillment, for expressions\nof love. I had but one chance. And I\ndid nothing but react in pain."
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "When those boys placed their hands\nupon my breasts, they had nothing\nbut an assortment of skin cells in\ntheir grasp. They ought to have felt,\nthrough me. The bosom of their\nRedeemer. When they lay on top of me\nand looked down into my eyes, they\nsaw fear. They should have met the\neyes of a lover, And felt the presence\nof the Prince of Peace..."
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "My vagina. I shall never have again.\nAnd never again shall I encounter\ntwo boys whose prayer was more\nlegible, more poignant, more\nanguished. Two young men who threw\nthemselves upon the altar and took\nme with them. And I did nothing for\nthem. I can only hope that someone\nwill."
  },
  {
   "type": "stage direction",
   "text": "LT can't help but start up. As if, telepathically, the NUN\nknew he was there and cried out to him. Asked him to complete\nher mission.\nLT senses the confession is over. As the PRIEST begins to\nspeak again, LT snaps to and returns to his original hiding\nplace, near the CANDLES.\nLT watches as the NUN exits the CONFESSIONAL, KNEELS, holds\nher ROSARY BEADS, and begins to whisper the ACT OF CONTRITION --\nwhat LT recited as ARIANE gave him head.\nThe NUN does penance. LT watches her, still hidden, and\ntransfixed.\nCut from THE NUN to --\nCUT TO:\nINT: EVENING - ARIANE'S APARTMENT\nCU - LT fucking a NUN.\nIts ARIANE.\nThis time LT doesn't rebel against the religious import of\nthese last days. Rather, he incorporates it into their sex.\nHe has dressed ARIANE as a NUN. Now it is silent pantomime\nthat expresses both decadence and awe.\nCUT TO:\nINT: LATE NIGHT \u0097 LT'S HOME \u0097 QUEENS\nFOLLOW LT as he walks through his home late at night. Each\nroom has several FAMILY MEMBERS in it, all asleep. Even the\nTWINS sleep in tandem, on matching BUNK BEDS.\nLT sits down in the KITCHEN. All is silent, peaceful.\nA moment passes.\nLT stands up and goes over to the REFRIGERATOR. He takes out\na CARTON OF MILK.\nSits back down. DRINKS the MILK.\nLT calmly looks at what's on the KITCHEN TABLE.\nA PILE OF BILLS, note attached from his WIFE: \"Pay These.\"\nA GROUP OF PHOTOS from the COMMUNION, already quickie\ndeveloped. They are spread out all over the TABLE.\nA MORNING TABLOID NEWSPAPER, STRAWBERRY featured on the COVER.\nLT finishes looking at the various artifacts of his life. He\nsighs, leans back, appears to be -- dare we say it -- at\npeace.\nFADE TO BLACK;\nHARD CUT TO:\nDAY FOUR:\nGAME SIX: LT LOSES $60,000\nEXT: LATE AFTERNOON - SHEA STADIUM - THE SIX GAME OF THE\nWORLD SERIES\nThe MASSIVE CROWD ROARS.\nThe STADIUM is decked out in the RED, WHITE, and BLUE BUNTING\nsignifying the WORLD SERIES. A ROW OF UNIFORMED COPS is in\nthe front row. Among them --\nLT. He watches STRAWBERRY as --\nWith winning runs on, STRAWBERRY takes strike three, to lose\nthe game.\nAs STRAWBERRY walks off the field, he and LT face off.\nOne on one.\nLT has lost the $60,000 bet. He knows how heavy this is.\nThat his life is new in danger.\nThe CROWD vents its rage. The deafening SOUND takes on a\nsensuous rhythm and becomes DANCE MUSIC, as --\nFrom EXTREME CU - the BLACK FACE OF STRAWBERRY, we --\nFADE TO BLACK;\nFADE UP TO:\nINT: EVENING - LIMELIGHT NIGHTCLUB\nHalf-nude DANCERS whirling in and out of sight, round and\nround in the strobe-flashed darkness.\nThe DANCE MUSIC steals ones senses, makes conversation nearly\nimpossible. People communicate in pantomime.\nLT pushes his way through the CROWD He cranes his neck,\ndesperately searching for someone. At last, he spots his\ntarget.\nPOV LT - A RESIDENT COKE DEALER. His FACE is visible, floating\nabove the writhing crowd.\nLT pursues him. Finally catches him.\nThey mime the deal. LT buys some COKE for immediate use.\nLT does the COKE off his wrist as he moves through the CROWD.\nLT trembles, frantic and manic-high, as he goes to his meeting\nwith LITE. LT plows his way through the CROWD, heading toward\nthe back of the club and the entrance to the V.I.P ROOM.\nEven this state, when he sights ACQUAINTANCES. LT turns on\nthe charm and works the room.\nLT nears the V.I.P. ROOM.\nPOV LT - The entrance to the V.I.P. ROOM is guarded by a\nPURPLE VELVET ROPE and an effete DOORMAN.\nWhen the DOORMAN sights LT, he lifts the ROPE, nods\nrespectfully at the habitual patron.\nCUT TO:\nINT: EVENING - LIMELIGHT NIGHTCLUB - THE V.I.P. ROOM\nLT arrives.\nThe V.I.P. ROOM is more laid-back, less populous than the\nthrong-filled cave outside. The MUSIC is muted here, and\nmore interesting.\nPARTIERS sit at the BAR, or at COCKTAIL TABLES. CHIC WAITRONS\nserve the clientele: HOTSHOT BOHEMIAN REGULARS, DRUG DEALERS\nand HOPEFUL RICH ADDICTS. In the privacy of the V.I.P.ROOM,\ndrug use is hardly concealed.\nLT sashays over to LITE'S table, sits down. LT has taken on\nan attitude of false bravado. He greets LITE with a crazy\ngrin. LITE is grim, doesn't respond in kind. He's not amused.\nLT orders a VODKA."
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "Do you have the money?"
  },
  {
   "type": "stage direction",
   "text": "(giggles)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "What money?"
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "Don't bullshit me."
  },
  {
   "type": "stage direction",
   "text": "LT keeps doing COKE off hs wrist, even as ne speaks to LITE.\nLT can't seem to wipe the smile off his face."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "I don't got it. Not tonight. You\ncan't get blood from a stone."
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "This psycho can."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Oooo... Big fucking scary guy. Just\nput $120,000 on tomorrow's game."
  },
  {
   "type": "stage direction",
   "text": "(laughs in his face)"
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "You're a fucking joke, you know that?"
  },
  {
   "type": "stage direction",
   "text": "(turns grim)"
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "He's been waiting for the money since\nthe fucking game ended. And I've\nbeen waiting here since -- forget\nit. Listen up. You're gonna get us\nboth fucking killed. You know that!"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Uh-uh. I'm gonna win. Just make sure\nthe bet gets in."
  },
  {
   "type": "stage direction",
   "text": "A COCKTAIL WAITRESS delivers LT's VODKA. LT orders another\none, flirts with her -- she's gone in a flash. LT downs the\nVODKA in one shot."
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "You do know that he's gonna blow up\nyour house, kill your wife and kids --"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Good. I'll give him an extra 10 grand\nfor his trouble. I hate that\nmotherfucking house and --"
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "He's gonna kill you, man. Do you\nhear me, motherfucker? You. Dead.\nGet it?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "I've been dodging bullets since I\nwas fourteen. No one can kill me.\nI'm fucking blessed. I'm fucking\nCatholic."
  },
  {
   "type": "stage direction",
   "text": "This breaks LT up. He laughs until he cries. LITE watches\nthe spectacle. Falls silent. They sit quietly for a moment.\nLT, impatient with the delivery of his second VODKA, takes a\nbottle cut of his COAT and re-fills his GLASS. DRINKS it\ndown.\nLITE tries changing the subject."
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "How's the case going?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "What case?"
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "The fucking rapists, man. The punks\nwho raped that nun. The $50,000 reward\nfrom the Church! Remember?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Yeah. Sure. Yeah. We're on it bigtime.\nLots of leads. You bet."
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "That 50 G could help you --"
  },
  {
   "type": "stage direction",
   "text": "LT looks as LITE as if he's crazy. He shakes his head. Sing-\nsongs at him as if trying to teach an impaired student."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "The Mets are gonna win the Series.\nThey're a lock."
  },
  {
   "type": "stage direction",
   "text": "A change comes over LT. He leans in, gets seriously excited.\nLT is possessed by his memory of this afternoon's game."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Get this, man. I was at the game\ntoday. Face to fucking face with\nStrawberry! Jesus! I saw him\nstrikeout. And you know what? He\nlooked at me, and I looked at him,\nand he laughed and I laughed and it\nwas like we were all alone in that\nwhole stadium and only we understood\nthat it was all a racket, that he\nstruck out on purpose, and that he's\nsaving it up for the Big One.\nTomorrow. Today I understood for the\nvery first time that --"
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "You've really got a problem."
  },
  {
   "type": "stage direction",
   "text": "LT shakes his head. Repeats himself in that sing-song,\ndidactic way."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "-- that there was never any other\nway it could have gone."
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Never any other way. So you had better\njust put in my fucking bet. $120,000\non the last game. The Big One. Come\non! Are you a bookmaker, or fucking\nwhat?"
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "Here. Look I'll give you the psyho's\nnumber You call him yourself and\ntell him wnat you want."
  },
  {
   "type": "stage direction",
   "text": "LITE stands up. He writes the BOOKIE'S NUMBER on a MATCHBOOK\nand gives it to LT.\nLITE leans over and gives LT a final warning."
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "You couldn't pay 60. You lose, you'll\nbe in for 180. To a guy who kills\npeople for nothing."
  },
  {
   "type": "stage direction",
   "text": "LT LAUGHS. He's already onto the next thing. He checks out\nthe GIRLS at the other TABLES.\nLITE takes to go. Then decides to try once more to get LT's\nattention."
  },
  {
   "type": "speech",
   "character": "LITE",
   "text": "I was supposed to meet him at midnight\nwith the 60. It's already 1:00 AM.\nBe careful. I mean it."
  },
  {
   "type": "stage direction",
   "text": "LT is still laughing as LITE leaves the V.I.P ROOM.\nBefore going out the door, LITE turns to look one more time\nat his friend.\nPOV LITE - LT is engaged in a clumsy come-on. Oblivious. The\nlast thing LITE sees is LT grabbing a COCKTAIL WAITRESS' LEG\nand falling out of his chair. LT LAUGHS all the way to the\nFLOOR.\nLITE lowers his head and exits.\nLT gets up a moment later, brushes himself off, and swaggers\nout of the V.I.P. ROOM.\nCUT TO:\nINT: NIGHT - THE LIMELIGHT CLUB\nLT is in the throng again. The MUSIC blasts, the PARTIERS\npush and shove...\nLT elbows his way through the crowd.\nHe makes moves on GIRLS. Banters with PATRONS. At the DOOR,\nhe hesitates before going out, dallies with the BOUNCER.\nLT felt safe in the CLUB. New he's gotta go OUTSIDE. He's\nshit-scared."
  },
  {
   "type": "location",
   "text": "EXT. LT leaves the CLUB for the STREET, looking over his"
  },
  {
   "type": "stage direction",
   "text": "shoulder all the way.\nCUT TO:\nINT: NIGHT - STAIRWELL OF J.C.'S APARTMENT BUILDING\nLT enters an APARTMENT BUILDING, faces a dark and sinister\nstaircase.\nSTRANGE NOISES come from the APARTMENTS ABOVE.\nLT climbs. He hugs the wall, GUN at the ready. To LT, it\nseems some gothic horror may await him at any turn.\nOn one landing, he comes upon a PIT-BULL. A GRANDMOTHER pulls\nhim back inside an APARTMENT by the LEASH.\nOn another landing, he sees a JUNKIE SHOOTING UP in the\nshadows. On another landing, a BIG GUY comes barreling out\nof his APARTMENT and down the stairs, almost bringing LT\ndown with him.\nOn another landing, a guy is taking out very PECULIAR GARBAGE.\nIt might be body parts to an active imagination. At last, he\nreaches the DOOR to the APARTMENT for which he's been looking.\nHARD CUT TO:\nINT: NIGHT - J.C.'S STRAIGHT PUERTO RICAN APARTMENT\nA cheerful apartment. Quite different in atmosphere from the\nSTAIRWELL, above.\nA large, multi-generation PUERTO RICAN FAMILY sits around\nthe dinner table, eating CHICKEN ON RICE AND BEANS. JC is at\nthe table.\nRELIGIOUS ARTIFACTS abound.\nA CODED KNOCK on the DOOR.\nJC jumps up to answer it.\nIt's LT. (The hideous stairs led here.)\nJC lets him in."
  },
  {
   "type": "speech",
   "character": "JC",
   "text": "How are you doing, man?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Very good. Very good. The Mets are\ngonna win tomorrow."
  },
  {
   "type": "stage direction",
   "text": "JC notes LT's bizarre manner. Decides to humor his paranoid\ncatatonia."
  },
  {
   "type": "speech",
   "character": "JC",
   "text": "I know. Here. Just a moment."
  },
  {
   "type": "stage direction",
   "text": "JC reaches into a bookcase, looking for something.\nMeanwhile, LT looks around the room.\nPOV LT - A SHRINE is in the corner. CANDLES are lit before\nPLASTER SAINTS, AFRICAN DEITIES, other icons abstruse and\nexotic. A large \"MADONNA AND CHILD\", painted on black velvet,\nhangs above the SHRINE. The MADONNA AND CHILD are BLACK.\nLT takes this all in. JC startles him.\nJC is holding a CIGAR BOX. He opens it. It's full of CASH.\nJC hands it to LT."
  },
  {
   "type": "speech",
   "character": "JC",
   "text": "This should be it. Oh, wait."
  },
  {
   "type": "stage direction",
   "text": "(to an old woman at\nthe table)"
  },
  {
   "type": "speech",
   "character": "JC",
   "text": "Mamacita?"
  },
  {
   "type": "stage direction",
   "text": "MAMACITA takes some VIALS of CRACK out of her APRON.\nSMILES. JC takes them from her, give them to LT."
  },
  {
   "type": "speech",
   "character": "JC",
   "text": "There. Now you've got your profit\nand more. You'll have more product\nday after tomorrow, right?"
  },
  {
   "type": "stage direction",
   "text": "(very spaced)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Uh - right. Sure. The Mets are gonna\nwin tomorrow."
  },
  {
   "type": "speech",
   "character": "JC",
   "text": "I know."
  },
  {
   "type": "stage direction",
   "text": "(beat - looks at LT\nwith concern)"
  },
  {
   "type": "speech",
   "character": "JC",
   "text": "Take care of yourself, man, OK? Be\ncool."
  },
  {
   "type": "stage direction",
   "text": "LT nods, puts MAMACITA'S CRACK VIALS in his pocket. He notices\nthat --\nPOV LT - CU - The CIGAR BOX is inlaid with a CROSS, made of\ncostume jewels. Other strange symbols surround it. It could\nbe cursed -- or blessed.\nLT turns to go. The DOOR closes behind him. He's gone.\nCUT TO:\nEXT: NIGHT - STREET NEAR ARIANE'S APARTMENT\nLT walks through the streets on the way to ARIANE'S. He\ncarries the CIGAR BOX.\nSuddenly, a SHOT rings out.\nZOOM IN ON - CU LT  Horror. Doubtless it was meant for him.\nLT panics. Freezes. As in a dream, he cannot run.\nPOV LT - RAPID. ERRATIC. HAND HELD - LT looks for SNIPERS in\nthe anonymous dark WINDOWS on the anonymous darks walls that\ncreate the mescarole canyon of the STREET.\nLT is entirely alone. He is stock-still, victim of his own\nterror.\nSuddenly. LT can move. He takes out his GUN, presses himself\nagainst the nearest WALL. From that position, he hears --\nA BRASH FEMALE VOICE, coming from somewhere in the darkness.\nIt is almost as loud as the \"SHOT\"."
  },
  {
   "type": "stage direction",
   "text": "(OC)"
  },
  {
   "type": "speech",
   "character": "BRASH FEMALE VOICE",
   "text": "Hey motherfucker! Take that backfire\nup the ass!"
  },
  {
   "type": "stage direction",
   "text": "LT can't believe that there is no \"SNIPER\", there was never\nany SHOT. It was a BACKFIRE!\nANGLE - The CAR in question passes by. It HONKS, defiantly.\nEvidently, it is the CAR that had BACKFIRED."
  },
  {
   "type": "stage direction",
   "text": "(OC)"
  },
  {
   "type": "speech",
   "character": "BRASH FEMALE VOICE",
   "text": "Fuck you."
  },
  {
   "type": "stage direction",
   "text": "LT is still pressed against the wall, GUN at the ready. He\ncannot be relieved. The terror is with him.\nCUT TO:\nINT: LATE NIGHT - ARIANE'S APARTMENT\nLT rushes in, triple bolts the DOOR behind him. He immediately\npulls the DRAPES."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Someone just took a shot at me..."
  },
  {
   "type": "stage direction",
   "text": "Ariane laughs."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "Sure, baby Sure And you don't do\ncocaine, either."
  },
  {
   "type": "stage direction",
   "text": "LT turns on her. Adamant. Pleading with her to believe him."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "It's not the drugs, Ariane, it's --\nit's someone who wants to kill me."
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "You gotta believe me!"
  },
  {
   "type": "stage direction",
   "text": "(shrugs)"
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "Why?"
  },
  {
   "type": "stage direction",
   "text": "ARIANE walks away, speaks with her back to LT."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Just kick back, baby. Make yourself\nat home."
  },
  {
   "type": "stage direction",
   "text": "(suddenly pissed)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "But of course it won't be nobody's\nhome, if you don't come through with\nthe fucking rent!"
  },
  {
   "type": "stage direction",
   "text": "LT lays his COAT down on the BED. Puts the CIGAR BOX of MONEY\nunder it.\nLT sits down near the PHONE. He lights his CRACKPIPE with a\nMATCH from the MATCHBOOK on which LITE wrote the BOOKIE'S\nNUMBER. Then he tries to reach the BOOKIE. Some sort of wacky\nMob joint answers."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Hello? Is LARGE there?"
  },
  {
   "type": "stage direction",
   "text": "(OC)"
  },
  {
   "type": "speech",
   "character": "MOB VOICE",
   "text": "No."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Look, man. Lite gave ne this number.\nOK? Just take a message. Tell Large\nto fucking call me right away at 123-\n1234. Got it?"
  },
  {
   "type": "stage direction",
   "text": "(CO -- phony humble)"
  },
  {
   "type": "speech",
   "character": "MOB VOICE",
   "text": "Sure, I get it..."
  },
  {
   "type": "stage direction",
   "text": "(laughs)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "I'm a good friend of Lite's, man.\nIt's urgent that --"
  },
  {
   "type": "stage direction",
   "text": "The MOB VOICE (CO) HANGS UP ON LT.\nLT tries to strangle the PHONE.\nLT REDIALS.\nThe line is BUSY."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Christ! Shit! I could kill them all\nwith my bare hands."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "Who?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Those fucking Mob assholes."
  },
  {
   "type": "stage direction",
   "text": "LT makes the strangulation gesture again. ARIANE laughs at\nhim."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "C'mere. You got some good blow, right?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Yeah."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "Then c'mere. I got something for\nyou."
  },
  {
   "type": "stage direction",
   "text": "ARIANE pulls out a pristine NEEDLE.  LT comes but flinches\nat the sight.\nApparently BOWTAY overheard that drugs are on the way. BOWTAY\nappears out of the KITCHEN.\nBOWTAY sits down near by, awaiting her DOSE.\nARIANE starts preparing the DOSE. She's got all the\nparaphernalia: SPOON. COTTON, a CANDLE FLAME, etc."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "First I'll put your Uptown in the\nspoon, then, to make it more exciting,\nI'm gonna add some Downtown. They\ncall this thing a speedball, honey,\nbut then you must know that..."
  },
  {
   "type": "stage direction",
   "text": "(beat -- she leans in)"
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "First time shooting up?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Nah..."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "Sure it is. You're a virgin. Just\nlike that nun. And I'm gonna rape\nyou."
  },
  {
   "type": "stage direction",
   "text": "That decides it for LT. He sits down like a little boy and\nlets ARIANE shoot him up with the potent mixture of COCAINE\nand HEROIN.\nARIANE shoots up BOWTAY, next.\nThey do it on the BED, exploiting all possible erotic\nconnotations.\nWhen LT rushes, he gets totally paranoid. Jumps at sounds,\nsneaks to the WINDOW, hears noises that aren't there.\nThen he flips, and becomes crazy-bold. Opens the DRAPES.\nSticks his head out the WINDOW, waves his GUN at specters.\nThen he becomes shit-scared, again. His behavior is lunatic.\nARIANE LAUGHS at his antics.\nFinally LT becomes wildly sensual. Revealing himself with\ntotal abandon. Dances. In the midst of this --\nThe PHONE RINGS LT is seriously startled. Then he realizes\nwho it may be. He slowly answers the phone.\nLT can hardly speak. He is NUDE, and communicating from\nanother world syllable by syllable."
  },
  {
   "type": "stage direction",
   "text": "(into the phone)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Large?"
  },
  {
   "type": "stage direction",
   "text": "(OC)"
  },
  {
   "type": "speech",
   "character": "LARGE",
   "text": "All right, cop. I want my money."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "It's still my money. If you want to\nhave a chance at any part of it,\nshithead, you will take my $120,000\nand bet on tomorrow's game."
  },
  {
   "type": "stage direction",
   "text": "(OC)"
  },
  {
   "type": "speech",
   "character": "LARGE",
   "text": "What about the money you owe me on\nyesterday's game?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Fuck yesterday's game. The World\nSeries is seven games not six. Put\nin my bet."
  },
  {
   "type": "stage direction",
   "text": "(OC)"
  },
  {
   "type": "speech",
   "character": "LARGE",
   "text": "Let me think about it."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "There's nothing to think about. Either\nyou put in my bet or you ain't getting\nnothing."
  },
  {
   "type": "stage direction",
   "text": "BIG SILENCE on the PHONE."
  },
  {
   "type": "stage direction",
   "text": "(CO -- lethal)"
  },
  {
   "type": "speech",
   "character": "LARGE",
   "text": "Oh, really?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Yeah, really. I'm no fucking asshole,\nman. I'm a fucking cop!"
  },
  {
   "type": "stage direction",
   "text": "(OC)"
  },
  {
   "type": "speech",
   "character": "LARGE",
   "text": "OK, cop. I want you to give yourself\nand your friends on the force a\nmessage. Tell them I've got my own\nreasons to be very interested in\nwhomever did the job on the nuns.\nI'll double the Church reward if you\nbring those punks direct to me. 100\nG cash. Get it?"
  },
  {
   "type": "stage direction",
   "text": "LT absorbs this, then bursts out."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Fuck the nuns, man! I'm talking about\nStrawberry! Is the bet down?"
  },
  {
   "type": "stage direction",
   "text": "LARGE takes a moment."
  },
  {
   "type": "stage direction",
   "text": "(OC)"
  },
  {
   "type": "speech",
   "character": "LARGE",
   "text": "Here's the deal: You meet me tonight\nacross from the Garden. 33rd & 8th.\nAt the beginning of the Ninth Inning.\nWe'll listen to the end of the game\ntogether. You bring your cash, I'll\nbring mine."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Yeah, sucker. You better be there!"
  },
  {
   "type": "stage direction",
   "text": "LT HANGS UP, turns to ARIANE."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Can you believe the nerve of this\nfucking guy? He kills people for\nfun, and then, he puts up 100 G to\nbring in some guys who raped a nun.\nWhat a sick fuck. Man..."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "Who?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "A wiseguy. Paying 100 Grand for the\nrapists if I turn then over direct\nto him."
  },
  {
   "type": "stage direction",
   "text": "ARIANE'S eyes light up."
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "But you could do it, baby. We could\nuse the bread..."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "You mean you could use it."
  },
  {
   "type": "stage direction",
   "text": "ARIANE SHRUGS, waves his dig aside.\nLT leaps up. He's on a manic roll. Conceives an insanely\ncaptivating, impossible idea. As he speaks, he speeds more\nand more until he seems to be reciting a rapid-fire tongue\ntwister perfect."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "I got it, man! I will find those\nkids. And I'll get the 50 G from the\nChurch! Then the kids'll go to jail.\nI'll be in charge, of course. After\na little while, I'll break the fuckers\nout -- and I'll turn them in to\nshithead I was just talking to. And\npick up his 100 G. No. I'll hit him\nup for 200 G. Or 250 G. l can do it --\n'cause I've got the kids. Then, of\ncourse, there's the 180 G I'm gonna\npick up on the Game tonight -- when\nthe Strawberries win!"
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "\"The Strawberries\"?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "The Mets. So anyway, chalk up another\n180 G for the Game. Jesus Christ!\nThat's almost half a million dollars.\nAriane! Wait. That's not good enough,\nI'll ask the shithead for 280 G for\nthe kids. Then it'll be a perfect\n500 thousand. Yeah. Perfect. 280 G\nfor the kids. Yeah, it's good I\nprepared, or I wouldn't have thought\nto --"
  },
  {
   "type": "stage direction",
   "text": "ARIANE has been grooving on it until now. She sees a problem\nthey've overlooked."
  },
  {
   "type": "stage direction",
   "text": "(cuts in)"
  },
  {
   "type": "speech",
   "character": "ARIANE",
   "text": "How come all those guys who're looking\nto get 50 from the Church haven't\ncome up with shit? You got some kinda\ninside track?"
  },
  {
   "type": "stage direction",
   "text": "(nods -- dead serious)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "I'm a Catholic."
  },
  {
   "type": "stage direction",
   "text": "ARIANE LAUGHS, decides to go with it.\nLT, out of breath from his tirade, lets the Downtown half of\nhis dose kick in but good.\nHe sits down in the same EASY CHAIR in which he nodded out\nthe morning of the desecration.\nNodding out, he stares out the same WINDOW. His eyes close.\nAs it was that morning only four days ago, the SUNRISE is\nblood red.\nAs if it is LT'S DREAM, we --\nCUT TO:\nDAY FIVE:\nGAME SEVEN: LT GETS DOUBLE OR NOTHING: $120,000\nINT: DAWN THROUGH HIGH NOON \u0097 CHURCH/CONVENT\nCU - The ALABASTER NUN. She is lying cross -- probably has\nbeen all night.\nVARIOUS ANGLES. The still-desecrated CHURCH in all its\nenduring glory. Shafts of blood-red dawn-light. The NUN.\nTIME PASSES.\nVARIOUS ANGLES. Mid-morning; The NUN is still lying cross.\nTIME PASSES.\nVARIOUS ANGLES. High Noon. The NUN is still lying cross.\nSuddenly --\nLT appears in the doorway, a black silhouette against the\nwhite light of noon. For a moment, he watches her from a\ndistance.\nThe NUN knows he is there. After a time, she gets up, goes\nto the altar, kneels. As if waiting for him.\nLT staggers down the center aisle. He's carrying the CIGAR\nBOX.\nLT joins the NUN, kneeling next to her at the altar.\nANGLE - The CHALICE is still missing.\nThey are all alone. At the ALTAR, before the CRUCIFIX, LT\nconfronts the NUN face to face. The NUN holds her ROSARY\nBEADS.\nLT finally speaks. He thinks she'll be turned on by his offer\nof \"help\"."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Listen to me, Sister, listen to me\ngood. The other cops'll just put the\nguys through the system. They're\njuveniles. They'll walk! Get it? But\nI'll beat the system and do justice.\nReal justice. For you."
  },
  {
   "type": "stage direction",
   "text": "The NUN turns to run."
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "I have already forgiven them."
  },
  {
   "type": "stage direction",
   "text": "LT is desperate. He lunges forward. Pleads with her."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Come on lady! They put out cigarettes\non your tits, man! Get with the\nprogram! Don't you want them behind\nbars? Or away from the world for\ngood? How could you forgive these\nmotherfu -- excuse me. These guys.\nHow could you? Deep down, don't you\nwant them to pay for what they did\nto you? Don't you want the crime\navenged?"
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "I have forgiven them."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Nun! These boys still have their\nweapons, Sister. Your forgiveness\nwill leave blood in its wake. What\nif they do it to other nuns? Other\nvirgins? Old women who die from the\nshock? Do you have the rights let\nthese boys go free? Can you bear the\nburden. Sister?"
  },
  {
   "type": "stage direction",
   "text": "The NUN turns to him, simple and pure, pure and simple."
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "I have prayed for days, Lieutenant.\nI have prayed for the souls of the\nboys who raped me. And I have prayed\nfor my own soul, too. I know what I\nmust do. And I know what I must not\ndo."
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "But you -- you -- it is you who needs\nto pray. Now, why do you want to\nkill these boys? Why -- really?"
  },
  {
   "type": "stage direction",
   "text": "(takes yet another\ntack)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Look. Sister. No one has to get\nkilled. We can solve this together.\nYou and me -- as one. These boys are\nlost sheep. Both Catholic -- did you\nknow that? And they're sick, Sister.\nWith a stress of the mind and of the\nsoul. They need help. Not just jail.\nNot just psychiatry. They need the\nhelp that only the Church can give.\nPlease help me to help them. Help me\nfind them before the others do. The\nnight is full of evil men, chasing\nthese boys with guns and clubs. We\nhave charity and love on our side. I\nknow that together, we could find\nthem first, even in the dark..."
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "The good reasons are not always the\nreal reasons. Talk to Jesus,\nLieutenant. Pray."
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "NUN",
   "text": "You do you believe in God -- don't\nyou? That Jesus Christ died for your\nsins?"
  },
  {
   "type": "stage direction",
   "text": "This blows him away. He has nothing to say to that.\nThe NUN has finished her morning prayers.\nFor a moment, she looks deep into LT's eyes.\nThen she gets up and leaves LT alone in the CHURCH.\nLT comes face to face with the mammoth CRUCIFIX. He is\ntransfixed.\nPOV - LT - JESUS on the CROSS.\nSoon, LT hears a VOICE.\nLT is not shocked or even surprised. He speaks to JESUS as\nto someone he's known all his life."
  },
  {
   "type": "stage direction",
   "text": "(OC)"
  },
  {
   "type": "speech",
   "character": "JESUS",
   "text": "I forgive you."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Me?"
  },
  {
   "type": "stage direction",
   "text": "(OC)"
  },
  {
   "type": "speech",
   "character": "JESUS",
   "text": "I forgive you."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "You can't forgive me. After what\nI've done."
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "I've fucked up bigtime. I've been\nbad. Real bad."
  },
  {
   "type": "speech",
   "character": "JESUS",
   "text": "I forgive you."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Please. Please don't forgive me.\nI've always hated you for that."
  },
  {
   "type": "stage direction",
   "text": "POV LT - The CRUCIFIX takes on an hallucinatory radiance.\nTaking that aura with him, JESUS comes down off the CROSS,\nand moves toward LT, who is still kneeling at the ALTAR."
  },
  {
   "type": "speech",
   "character": "JESUS",
   "text": "I forgive you."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Why? Why can't you hate me? Hate me!\nPlease! Help me!"
  },
  {
   "type": "stage direction",
   "text": "(confused)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Hate me! Help me! Hate me!"
  },
  {
   "type": "speech",
   "character": "JESUS",
   "text": "I forgive you."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Why? Jesus! Why me? Why can't I wash\nthe ashes from my forehead, year\nafter year after year? And why am I\nstill drunk on your blood, the taste\nof your flesh on my tongue? Worst of\nall, why can't I feel the nails in\nmy palms, the spear in my side, the\ncrown of thorns round my head? Why\ndo I have to know, over and over,\nthat it was you. You who died; died\nfor my sins! And that I will die for\nnothing. Why?"
  },
  {
   "type": "stage direction",
   "text": "JESUS kneels down, knee to knee, face to face with LT."
  },
  {
   "type": "speech",
   "character": "JESUS",
   "text": "I forgive you."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Why do I dream every night of the\nwhore who brought you water on your\nroad to death? And why have I never\nforgotten that if she, then I --"
  },
  {
   "type": "stage direction",
   "text": "LT averts his eyes. When he looks up again --\nJESUS is back on the CROSS. Inert, and yet --\nLT rises, moves around the interior of the CHURCH. He\nstumbles, struggles, pleads. Falls, rises, falls and rises\nagain -- as if wrestling with an invisible assailant.\nHe collapses in a corner."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Oh God, my God. it's goddamn good to\nbe good. Forgive me. Father, for I\nhave sinned. It's still goddamn good\nto be good."
  },
  {
   "type": "speech",
   "character": "JESUS",
   "text": "I forgive you."
  },
  {
   "type": "stage direction",
   "text": "EPIPHANY. BLOODY CHRIST ON THE CROSS. HALLELUJAH!\nIn the aftermath of his revelation, he notices, cleanly, a\nhunched, ELDERLY BLACK WOMAN carrying something toward the\nALTAR.\nHe staggers toward her. Yes. The ELDERLY BLACK WOMAN has the\nCHALICE!\nLT grabs the CHALICE. The ELDERLY BLACK WOMAN doesn't let\ngo."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "The chalice. Tell me! Who gave it to\nyou! Tell me where the fuck you got\nit! Take me there! Now!"
  },
  {
   "type": "stage direction",
   "text": "At first, she doesn't speak at all. LT begins to CRY. Begs\nher to tell him. Then he wields his PISTOL, repeats his plea.\nThen breaks into TEARS.\nShe speaks at last."
  },
  {
   "type": "speech",
   "character": "ELDERLY BLACK WOMAN",
   "text": "I can't tell you."
  },
  {
   "type": "stage direction",
   "text": "Gun in hand, LT gets down on his knees."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "In the name of God, you must."
  },
  {
   "type": "speech",
   "character": "ELDERLY BLACK WOMAN",
   "text": "My husband will give me Hell, Mister."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "We've already got Hell, Sister."
  },
  {
   "type": "stage direction",
   "text": "She meets LT's eyes, seems to understand something. Calmly,\nshe tells him what he needs to know."
  },
  {
   "type": "speech",
   "character": "ELDERLY BLACK WOMAN",
   "text": "It's very hard. He's a -- you're not\na cop, are you?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "No. Not a cop."
  },
  {
   "type": "speech",
   "character": "ELDERLY BLACK WOMAN",
   "text": "My husband is a fence. He got this\nchalice from a couple of kids. Just\nyesterday, I think. I stole it out\nof his shop so as to return it to\nwhere it ought to be. It's a holy\nthing, you know. A holy thing."
  },
  {
   "type": "stage direction",
   "text": "The ELDERLY BLACK WOMAN lets go of the CHALICE. Now LT holds\nten CHALICE in his hands, alone. He speaks as if entranced."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "A holy thing."
  },
  {
   "type": "stage direction",
   "text": "(beat -- snaps to)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Let's go."
  },
  {
   "type": "stage direction",
   "text": "Suddenly purposive, LT grabs the ELDERLY BLACK WOMAN by the\narm. Starts pulling her out of the CHURCH. He holds the\nCHALICE with the other arm, picks up the CIGAR BOX on his\nway out. Manages to carry both items.\nWhen LT and the ELDERLY BLACK WOMAN reach the door to outside,\nthey both pause to GENUFLECT.\nThen LT grabs her again and they rush out.\nCUT TO:\nEXT: AFTERNOON - BARRIO STREETS - EN ROUTE TO THE FENCE\nLT walks the ELDERLY BLACK WOMAN swiftly through the streets\ntoward the FENCE'S SHOP.\nHe still holds the CHALICE and the CIGAR BOX.\nPEOPLE watch them pass and make way. As if they realize that\nsomething is happening -- on several levels at once. The\nGAME has begun. It is on TV in every BAR and SHOP WINDOW. In\nboth English and Spanish. Slowly but surely, the Mets are\nlosing.\nCUT TO:\nINT: LATE AFTERNOON - THE FENCE'S SHOP\nLT and the ELDERLY BLACK WOMAN enter the SHOP. LT is wielding\nthe CHALICE and the CIGAR BOX. He has true madness m his\neyes.\nPOV LT - The GAME is playing on a couple dozen TV's in the\nFENCE'S SHOP' The Mets are still losing!\nThe FENCE, and elderly Black man, is sitting in one of many\nEASY CHAIRS. He doesn't seem surprised to see his WIFE. Or\nthe CHALICE. Or LT! It's as if he expected them."
  },
  {
   "type": "speech",
   "character": "FENCE",
   "text": "You took the chalice."
  },
  {
   "type": "speech",
   "character": "ELDERLY BLACK WOMAN",
   "text": "Yes."
  },
  {
   "type": "speech",
   "character": "FENCE",
   "text": "You brought it back to the Church.\nAnd then it made it's way back to\nme, again."
  },
  {
   "type": "speech",
   "character": "ELDERLY BLACK WOMAN",
   "text": "Yes."
  },
  {
   "type": "stage direction",
   "text": "Th» FENCE bursts out LAUGHING."
  },
  {
   "type": "speech",
   "character": "ELDERLY BLACK WOMAN",
   "text": "Are you all right, honey?"
  },
  {
   "type": "speech",
   "character": "FENCE",
   "text": "I was gonna bring it back myself."
  },
  {
   "type": "stage direction",
   "text": "The ELDERLY BLACK WOMAN is obviously relieved."
  },
  {
   "type": "speech",
   "character": "FENCE",
   "text": "Jesus, woman! What did you think?\nYou thought I'd get mad like I did\nthat time you took that set of pots\nand pans? That was twenty years ago.\nAnd how do you compare pots and pans\nand a chalice?"
  },
  {
   "type": "stage direction",
   "text": "LT speaks up suddenly."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "They both hold stuff you eat."
  },
  {
   "type": "stage direction",
   "text": "After a beat, the FENCE and his WIFE start LAUGHING. LT joins\nin."
  },
  {
   "type": "stage direction",
   "text": "(to LT)"
  },
  {
   "type": "speech",
   "character": "FENCE",
   "text": "So what are you doing here?"
  },
  {
   "type": "speech",
   "character": "ELDERLY BLACK WOMAN",
   "text": "He wants to know who brought in the\nchalice."
  },
  {
   "type": "speech",
   "character": "FENCE",
   "text": "That's no mystery. Julio and Paolo\nbrought it in,"
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "FENCE",
   "text": "You don't want to hurt those boys,\ndo you? I mean, they sure as Hell\nhave got something coming, but it\nain't what the Law wants to give\nthem. You understand?"
  },
  {
   "type": "stage direction",
   "text": "(beat -- shakes his\nhead)"
  },
  {
   "type": "speech",
   "character": "FENCE",
   "text": "No. How could you understand."
  },
  {
   "type": "stage direction",
   "text": "The FENCE seems to study LT.\nPOV FENCE - LT. Wretched.\nThe FENCE thinks again."
  },
  {
   "type": "speech",
   "character": "FENCE",
   "text": "Well -- maybe you do. But I don't\nknow where those boys are at right\nnow. You'll have to ask around. Those\nboys on the corner'll know. You'll\nhave to get it out of them. But they\nknow."
  },
  {
   "type": "stage direction",
   "text": "POV LT - Through the WINDOW of the FENCE'S SHOP, a busy DRUG\nCORNER is visible."
  },
  {
   "type": "stage direction",
   "text": "(spaced)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Thank you. And I'll make sure the\nchalice gets back where it belongs."
  },
  {
   "type": "stage direction",
   "text": "LT leaves. CHALICE in hand.\nCUT TO:\nEXT: LATE AFTERNOON - THE STREETS IN THE BARRIO - MONTAGE\nLT stumbles through the streets, questioning people about\n\"JULIO and PAOLO\". No one knows anything. LT stops people at\nrandom, getting really desperate. He shows people the CHALICE,\nasks them if they've seen it before. No one has.\nLT plays both ADDICT and COP as it suits his needs. By now,\nhe looks more like a homeless man than anything else. But\nnone of his play-acting or lethal threats get him anywhere.\nThe GAME is everywhere, and the Mets are still losing.\nFinally, LT approaches a hustling STREET DEALER. He cops.\nThe STREET DEALER is wearing a WALKMAN, so the deal goes\ndown in mime.\nNow, LT speaks and wants to be heard."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Hey -- Have you seen Paolo or Julio\naround?"
  },
  {
   "type": "stage direction",
   "text": "The STREET DEALER uses his WALKMAN and the resulting\n\"deafness\" to excuse his total lack of response.\nLT starts MOUTHING WORDS silently at the STREET DEALER. No\nresponse. Then, he -- silently -- begins to shout.\nThe STREET DEALER's alarmed that he seemingly can't hear at\nall above the WALKMAN music. He moves the WALKMAN away from\nhis ears but doesn't take it off."
  },
  {
   "type": "speech",
   "character": "STREET DEALER",
   "text": "What the fuck you want."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "You know, my Uncle used to wear a\nwalkman all the time. The walkman\nlooked just like yours. And you look\nsomething like my Uncle. But one day\nhe was standing in a puddle -- the\npuddle locked just like that one --"
  },
  {
   "type": "stage direction",
   "text": "LT points to a PUDDLE in which the STREET DEALER is now\nStanding."
  },
  {
   "type": "speech",
   "character": "STREET DEALER",
   "text": "And what?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "And he got electrocuted."
  },
  {
   "type": "stage direction",
   "text": "The STREET DEALER tries to consider what this crazy guy has\njust told him, but before the STREET DEALER can even react.\nLT leans in on him, shows his GUN and then his BADGE."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Look -- I don't know you, and you\ndon't know me, but I'm really in the\nmood to kill someone today and you\nare at the end of my gun."
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Have you ever had days like that?\nYeah, you have, so now you understand\nwhere I'm coming from."
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Tell me! Where is Julio and Paolo ?"
  },
  {
   "type": "stage direction",
   "text": "The STREET DEALER answers with absolute ease. That was all\nit was about? No problem."
  },
  {
   "type": "speech",
   "character": "STREET DEALER",
   "text": "They were at that abandoned building\nlast night. Second floor. They're\nprobably still there now. It's next\nto the old Convent. Downtown a ways.\nYou know the place..."
  },
  {
   "type": "stage direction",
   "text": "CU. LT - It hits him. The CRACKHOUSE where the kids hang out\nhas always been right next to the CHURCH/CONVENT where it an\nbegan! It suddenly makes sense to him.\nLT completes re transaction, pays the STREET DEALER for the\nDRUG BAGS. He takes the CASH out of the CIGAR BOX, revealing\ndozens of thousands of dollars.\nThe STREET DEALER stares at the wretched man with a box full\nof cash.\nCUT TO:\nEXT: EVENING - EN ROUTE TO THE CRACKHOUSE\nLT, carrying the CHALICE and the CIGAR BOX, heads back\nDowntown toward the CRACKHOUSE -- and the CHURCH/CONVENT.\nIn BARS, TV STORE WINDOWS, in snatches of strangers'\nconversation, the FINAL GAME IS EVERYWHERE. The whole city\nhas stopped to watch it. LT is practically the only person\nin the street.\nWorst of all, the Mets are seriously behind. They are\ndefinitely LOSING.\nLT drags himself onward.\nCUT TO:\nEXT INT: EVENING - THE CRACKHOUSE\nLT busts in. Fires shots, collars the KIDS. The KIDS are\nwearing the PURPLE ROBES from the CHURCH/CONVENT. They also\nwear gold CROSSES. LT HANDCUFFS them.\nThe other CRACKHEADS race out.\nThere is even a TV in the CRACKHOUSE -- playing the GAME!\nThe SOUND is Off. The Mets keep losing. If anything will\nforce LT to kill/and or take the KIDS into custody, this\nwould seem to be it."
  },
  {
   "type": "speech",
   "character": "JULIO",
   "text": "Who the fu--"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Shut up. Let's watch the game."
  },
  {
   "type": "stage direction",
   "text": "LT sits down next to the KIDS. SMOKES with them, watches the\nGame. LT must hold the PIPE for them, as they are HANDCUFFED.\nLT gets them super-high, and himself likewise. He still holds\nhis GUN.\nThe KIDS go along with it. Taking it moment to moment.\nAll three, despite the situation, are heavily into the Game."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Strawberry..."
  },
  {
   "type": "speech",
   "character": "PAOLO",
   "text": "Yeah..."
  },
  {
   "type": "stage direction",
   "text": "After a moment, LT gets up. The KIDS understand that they\nmust do the same."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Give me the robes."
  },
  {
   "type": "stage direction",
   "text": "The KIDS hand over the PURPLE ROBES and LT puts them on."
  },
  {
   "type": "speech",
   "character": "JULIO",
   "text": "You're not a cop are you?"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "No."
  },
  {
   "type": "stage direction",
   "text": "LT exits. Taking the KIDS along. He carries the CHALICE and\nthe CIGAR BOX.\nCUT TO:\nEXT INT: EVENING - LT'S CAR AND STREETS EN ROUTE TO RENDEZ-\nVOUS\nVARIOUS ANGLES - LT drives toward the fatal rendez-vous with\nthe BOOKIE. He is wearing the PURPLE ROBES from the\nCHURCH/CONVENT and has the CHALICE and the CIGAR BOX.\nLT has the KIDS handcuffed in the back seat. (The Scene\nmirrors Scene 2. in which LT drove his own TWINS to school.)\nThe FINAL GAME (SEVEN) is on the RADIO. LT is listening, but\nalso not listening.\nLT talks wildly about Jesus Christ. And about the misery\nthey pass in the street. He waves his GUN wildly, punctuating\nhis speech with potentially lethal gestures. He aims the GUN\nat JULIO and PAULO, then at himself, then out the window,\nthen at the KIDS, again."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Jesus died for your sins, you\nmotherfuckers! Not me. No. I didn't\ndie for your sins. No, not me. Jesus\nwent and did it."
  },
  {
   "type": "stage direction",
   "text": "(beat)"
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "So why did you do what you did? If\nyou want to live, tell me now,\nmotherfuckers! Tell me now!"
  },
  {
   "type": "stage direction",
   "text": "LT turns around and looks at JULIO and PAOLO, both of them\nHANDCUFFED in the back seat.\nPOV LT - CU - JULIO and PAOLO both have TEARS running down\ntheir cheeks. Silently."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "I forgive you."
  },
  {
   "type": "stage direction",
   "text": "LT starts CRYING too, at the same time CURSING at the TRAFFIC.\nHe drives wildly toward the Port Authority Terminal.\nThe Mets are coming up from behind -- but it is a long shot.\nLT doesn't seem to care. He stares into space.\nCUT TO:\nEXT:/INT: EVENING - LTS CAR - THE PORT AUTHORITY TERMINAL\nLT stops his CAR -- next to a BUS in an underground tunnel."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "Get out."
  },
  {
   "type": "stage direction",
   "text": "The KIDS do. LT follows fast.\nAT THE BUS: He makes them board at GUN POINT."
  },
  {
   "type": "speech",
   "character": "LT",
   "text": "If you think you're not getting on\nthis bus, you're dead wrong. No\nfucking way are you gonna miss this\nbus, man! You were probably the kind\nof kids who had your father drive\nyou to school cause you couldn't\ncatch the fucking bus. But no more,\nman. You're getting on this bus and\nyou're taking it to the last fucking\nstop. So get on the fucking bus,\nman, 'cause you're life ain't worth\nshit in this town."
  },
  {
   "type": "stage direction",
   "text": "LT uncuffs them and the KIDS get on the BUS, dumbstruck.\nLT hands JULIO the CIGAR BOX. His \"salvation.\"\nThe KIDS don't even know what is inside. They take it.\nLT gets back into his CAR, takes off.\nCUT TO:\nEXT/INT: EVENING - LT'S CAR - AT 33RD STREET & 8TH AVENUE -\nAT THE RENDEZ-VOUS WITH THE BOOKIE\nEXT: LT PULLS UP AT THE APPOINTED SPOT. HE AWAITS THE\nARRIVAL OF THE BOOKIE.\nINT: STRAWBERRY is up. The GAME can go either way. Suspense.\nBut not on the face of LT. He is dressed in the PURPLE ROBES,\nthe CHALICE beside him in the CAR.\nThe BOOKIE pulls up and -- without getting out of his CAR --\nHe SHOOTS LT in the head.\nThe BOOKIE speeds off. (We never saw him behind the dark\nwindows,} LT is dead in his CAR.\nOn the RADIO, the GAME is ending. STRAWBERRY hits a HOME RUN\nand the -- Mets win, the CROWD ROARS.\nEND CREDITS.\nFIN"
  }
 ]
}