{
 "movie_url": "https://imsdb.com/scripts/Indiana-Jones-and-the-Raiders-of-the-Lost-Ark.html",
 "movie_title": "raiders",
 "movie_script": [
  {
   "type": "introduction",
   "text": "\"RAIDERS OF THE LOST ARK\"\nScreenplay by\nLawrence Kasdan\nStory by\nGeorge Lucas"
  },
  {
   "type": "stage direction",
   "text": "FADE IN:"
  },
  {
   "type": "location",
   "text": "EXT. PERU - HIGH JUNGLE - DAY"
  },
  {
   "type": "stage direction",
   "text": "The dense, lush rain forests of the eastern slopes of the\nAndes, the place known as \"The Eyebrow of the Jungle\". Ragged,\njutting canyon walls are half-hidden by the thick mists.\nThe MAIN TITLE is followed by this:\nPERU\n1936\nA narrow trail across the green face of the canyon. A group\nof men make their way along it. At the head of the party is\nan American, INDIANA JONES. He wears a short leather jacket,\na flapped holster, and a brimmed felt hat with a weird feather\nstuck in the band. Behind him come two Spanish Peruvians,\nSATIPO and BARRANCA. Bringing up the rear are five Yagua\nINDIANS. They act as porters and are wrangling the two heavily-\npacked llamas. The Indians become increasingly nervous. They\nspeak to each other in bursts of Quechua. The American, who\nis known to his friends as Indy, glances back at them."
  },
  {
   "type": "stage direction",
   "text": "(irritated)"
  },
  {
   "type": "speech",
   "character": "BARRANCA",
   "text": "They're talking about the Curse again!"
  },
  {
   "type": "stage direction",
   "text": "He turns and yells at the Indians in Quechua, his anger giving\nan indication of his own fears. The party reaches a break in\nthe canyon wall and takes the trail through it.\nWhen they emerge, their destination is revealed to them in\nthe distance. Beyond a thick stand of trees is the vegetation-\nenshrouded TEMPLE OF THE CHACHAPOYAN WARRIORS.\nThe entire party is struck by the sight. The Indians,\nterrified now, chatter away. Suddenly the three at the back\nturn and run, dropping their packs as they go. Barranca yells\nat the fleeing Indians and pulls his pistol out. He starts\nto raise his arm to aim but Indy restrains it in a muscular\ngrip."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "No."
  },
  {
   "type": "stage direction",
   "text": "Barranca looks evilly at Indy's hand upon him. Indy releases\nhim and smiles in a friendly way."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "We don't need them."
  },
  {
   "type": "stage direction",
   "text": "Satipo watches this confrontation with some concern."
  },
  {
   "type": "speech",
   "character": "BARRANCA",
   "text": "I do not carry supplies."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "We'll leave them. Once we've got it,\nwe'll be able to reach the plane by\ndusk."
  },
  {
   "type": "stage direction",
   "text": "He turns back to the trail. Satipo gets the two remaining\nIndians moving behind Indy. Satipo and Barranca then have a\nfast, silent communication: Barranca indicates his desire to\nslit Indy's throat; Satipo gives him a look that says \"Be\npatient, you idiot\".\nTHE APPROACH TO THE TEMPLE\nThe party fans out to fight their way through the entwined\ntrees that guard the temple. Visibility is cut to five feet\nin the heavy mist. Satipo extracts a short, native dart from\na tree and examines the point gingerly"
  },
  {
   "type": "stage direction",
   "text": "(showing Indy)"
  },
  {
   "type": "speech",
   "character": "SATIPO",
   "text": "The Hovitos are near. The poison is\nstill fresh... three days. They're\nfollowing us, I tell you."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "If they knew we were here, they would\nhave killed us already."
  },
  {
   "type": "stage direction",
   "text": "The two Indiana jabber in Quechua, near hysteria. Barranca\nis sweating profusely, eyes darting. He yells at the Indians\nin Quechua to \"shut up\".\nIn the undergrowth, there is slithering movement.\nIndian #1 draws aside a branch and is faced with a horrific\nstone sculpture of a Chachapoyan demon. The Indian is so\nfrightened no sound comes out when he screams. He turns and\nruns silently away.\nIndian #2 calls to his friend. Getting no response, he steps\nin that direction. A huge macaw, flushed from the undergrowth,\nscreams and flies away. Indian #2 does exactly the same thing,\nnever to be seen again.\nIndy, Satipo and Barranca, just clearing the trees, look\nback in that direction. They all turn to face the Temple.\nIt is dark and awesome. Vegetation curls from every crevice,\nover each elaborate frieze. The entrance - round, open and\nblack - has been designed to look like open jaws."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "So this is where Forrestal cashed\nin."
  },
  {
   "type": "speech",
   "character": "SATIPO",
   "text": "A friend of yours?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Competitor. He was good, very good."
  },
  {
   "type": "stage direction",
   "text": "(nervous)"
  },
  {
   "type": "speech",
   "character": "BARRANCA",
   "text": "No one has ever come out of there\nalive. Why should we put our faith\nin you?"
  },
  {
   "type": "stage direction",
   "text": "Indy takes the weird feather from the band of his hat. From\naround its point, he slips a tightly rolled piece of\nparchment. Barranca and Satipo exchange a quick \"So that's\nwhere is was!\" look. They all kneel as Indy spreads out the\nparchment. On it is one-half of a crude floorplan of the\nTemple."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "No one ever had what we have...\npartners."
  },
  {
   "type": "stage direction",
   "text": "Indy fixes them with an expectant stare. Satipo produces a\nsimilar, but folded, piece of parchment. He lays it - the\nother half of the floorplan - next to Indy's. They all regard\nit for a moment, then Indy stands and walks toward the Temple.\nBarranca's eyes are shining as they dart between the floorplan\nand Satipo."
  },
  {
   "type": "stage direction",
   "text": "(back turned)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Assuming that pillar there marks the\ncorner and..."
  },
  {
   "type": "stage direction",
   "text": "Barranca is suddenly on his feet, quietly drawing his pistol.\nHe raises it toward Indy as Satipo realizes with alarm what\nhe's doing. Too late. Indy's head turns and he sees Barranca.\nIndy's next move is amazing, graceful and fast, yet totally\nunhurried. His right hand slides up under the back of his\nleather jacket and emerges grasping the handle of a neatly\ncurled bullwhip. With the same fluid move that brings Indy's\nbody around to face the Peruvian, the whip uncoils to its\nfull ten foot length and flashes out.\nThe fall of the whip (the unplaited strip at the end of the\nlash) wraps itself around Barranca's hand and pistol. He\ncould not drop the gun now if he tried.\nIndy gives the whip a short pull and Barranca's arm in jerked\ndown, where it involuntarily discharges the gun into the\ndirt. Barranca is amazed, but feels some slack in the whip\nand immediately raises the gun toward Indy again, cocking it\nwith his free hand.\nIndy's face goes hard. And sad.\nIndy sweeps his arm in a wide arc. Barranca spins around,\nenclosed in the whip, his gun hand stuck tight against his\nbody. Indy gives one more short jerk on the whip handle and\nBarranca's gun fires. Barranca falls dead.\nIndy looks quickly at Satipo, who is shocked and frightened.\nHe raises his arms in supplication."
  },
  {
   "type": "speech",
   "character": "SATIPO",
   "text": "I knew nothing! He was crazy! Please!"
  },
  {
   "type": "stage direction",
   "text": "Indy looks him over, then nods. He frees the whip from\nBarranca's body and picks up the man. His eyes sweep the\nsurrounding woods."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Let's go."
  },
  {
   "type": "location",
   "text": "INT. TEMPLE - INCLINED PASSAGE - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy and Satipo, carrying a torch, walk up the slightly\ninclined, tubular passage from the main entrance. The interior\nis wet and dark, hanging with plant life and stalactites.\nTheir echoing footsteps intermittently overpower the sounds\nof loud dripping, whistling air drafts and scampering claws.\nHALL OF SHADOWS\nIndy leads the way down a twisting hallway, Satipo's torch\nbarely lighting his way from behind. Indy disappears in a\nshadow and when he reappears a moment later a huge black\ntarantula is crawling up the back of his jacket. Indy doesn't\nnotice and disappears into another shadow, emerging with two\nmore tarantulas on his back.\nSatipo sees them and makes a frightened grunting sound. Indy\nlooks at him, sees what he's pointing at and casually brushes\nall three spiders off with his rolled whip, as he would a\nfly. Satipo pirouettes for an inspection and Indy flicks one\noff the Peruvian's back.\nIndy begins picking up little pocket-sized artifacts from\nthe niches and ledges of the Temple. He continues to do this\nas the men penetrate the Temple. His collecting is quick and\nexpert, evaluating the pieces in an instant, discarding some,\nstuffing others into his clothes, and never stopping his\nforward progress.\nCHAMBER OF LIGHT\nThe men reach an arch in the hall. The small chamber ahead,\nwhich interrupts the hall, is brightly lit by a shaft of\nsunlight from high above. Indy stops, looks it over."
  },
  {
   "type": "speech",
   "character": "SATIPO",
   "text": "What's wrong? Are you lost?"
  },
  {
   "type": "stage direction",
   "text": "Indy picks up a stick and throws it through the shaft of\nlight. Giant spikes spring together from the sides of the\nchamber with a ferocious CLANG! And impaled on the spikes\nare the remains of a white man, half-fleshed, half skeleton,\nin explorer-type grab. Indy reaches out and takes hold of\nthe man's carcass. As the spikes slowly retract, Indy pulls\nit free and seats the remains gently on the floor."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Forrestal."
  },
  {
   "type": "stage direction",
   "text": "(gulps)"
  },
  {
   "type": "speech",
   "character": "SATIPO",
   "text": "We can go no further."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Now, Satipo, we don't want to be\ndiscouraged by every little thing."
  },
  {
   "type": "stage direction",
   "text": "Indy steps sideways into the chamber. His back pressed against\nthe very points of the retracted spikes, he moves along the\nedge of the light beam, and steps clear on the other side.\nSatipo grimaces and begins sweating his way through.\nSTAIRWAY\nIndy and Satipo come down stone stairs to a tight landing.\nFraming the entry are a carefully strung network of dead\nvines, each somehow hooked into the wall, narrowing the\nopening even more."
  },
  {
   "type": "stage direction",
   "text": "(taking torch)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Let me see that."
  },
  {
   "type": "stage direction",
   "text": "He lowers the torch to the floor of the landing. The landing\nis carpeted with human skeletons, one on top of another, all\nsquashed flat as cardboard. Satipo gasps. Indy looks up at\nthe ceiling of the landing, then steps onto skeletons, which\nmake a cracking noise under his feet."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Try not to touch the vines."
  },
  {
   "type": "stage direction",
   "text": "FOYER OF THE SANCTUARY\nThe men are in a high, straight hallway 50 feet long.\nThe door at the end is flooded with sunlight."
  },
  {
   "type": "speech",
   "character": "SATIPO",
   "text": "Señor, I think we are very close."
  },
  {
   "type": "stage direction",
   "text": "Indy stands still looking at the hall."
  },
  {
   "type": "stage direction",
   "text": "(impatient)"
  },
  {
   "type": "speech",
   "character": "SATIPO",
   "text": "Let us hurry. There is nothing to\nfear here."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "That's what scares me."
  },
  {
   "type": "stage direction",
   "text": "They begin walking down the hall side by side. Satipo has\ninched a little ahead. Suddenly his lead foot comes down and\nthrough the floor! As Satipo begins to pitch forward, Indy\ngrabs him by the belt and pulls him back. They both look\ndown at the \"floor\".\nIndy swings his whip across the floor. Fifteen feet of it\ncuts open beneath the lash, falling away to reveal black pit\nas wide as the hall. The illusory floor was made of dust-\ncovered cobwebs. Satipo picks up a stone and drops it down\nthe pit. No sound. The two men exchange glances. Indy looks\nup at the high roof of the hall. He swings the whip up around\na support beam, tests its strength with a pull and swings\nover the pit on the whip. From the other side he swings the\nwhip back to Satipo, who throws Indy the torch. Satipo swings\nacross. When they are both standing on solid floor there is\na moment of quiet in which they hear, from far, far below -\nSPLASH! Indy wedges the whip handle into the wall and leaves\nit strung to the beam for quick retreat.\nTHE SANCTUARY\nA large, domed room. Ten evenly-spaced skylights send their\nshafts of sunlight down to a unique tiled floor: white and\nblack tiles laid out in a lovely, intricate pattern. Indy\nand Satipo stand at the door and look across the wide room\nat the altar. There, in the supreme hallowed spot, is a tiny\njeweled figurine, Indy's real objective.\nTwo torches, many years old, are in holders by the door.\nIndy takes one down and lights it. He gives the regular torch\nto Satipo."
  },
  {
   "type": "speech",
   "character": "SATIPO",
   "text": "There's plenty of light, amigo."
  },
  {
   "type": "stage direction",
   "text": "Indy kneels and uses the unlit end of the torch to reach out\nand tap a white tile. It is solid. He taps a black tile.\nThere is a whizzing sound and a tiny dark sticks in the torch.\nSatipo points to the wall nearby: there is a recessed hole\nthere."
  },
  {
   "type": "speech",
   "character": "SATIPO",
   "text": "From that hole!"
  },
  {
   "type": "stage direction",
   "text": "Indy nods, stands and looks around the sanctuary. The entire\nroom is honey-comed with the same kind of hole. Satipo sees\nit too and is properly impressed."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "You wait here."
  },
  {
   "type": "speech",
   "character": "SATIPO",
   "text": "If you insist, señor."
  },
  {
   "type": "stage direction",
   "text": "Torch in hand, Indy begins his careful walk across the\nsanctuary. Stepping only on the white tiles, he almost appears\nto be doing a martial arts kata. Before each big move he\nwaves the torch in front of him head to toe, looking at the\nflame. Halfway out, he sees something on the floor and kneels\nto look at it.\nA dead bird lies on one of the white tiles. Its body is\nriddled with little deadly darts. This has great significance\nto Indy and he stands with even greater caution. He waves\nthe torch ahead of him and at waist height an air current\nwhips at the flame. Indy ducks under it and leaves a burn\nmark on the white tile beneath it.\nSatipo watches, wide-eyed and mystified.\nIndy reaches the altar. The tiny idol looks both fierce and\nbeautiful. It rests on a pedestal of polished stone. Indy\nlooks the whole set-up over very carefully. From his jacket\nhe takes a small, canvas drawstring bad. He begins filling\nit with dirt from around the case of the altar. When he has\ncreated a weight that he thinks approximates the weight of\nthe idol, he bounces it a couple times in his palm\nconcentrating. It's clear he wants to replace the idol with\nthe bag as smoothly as possible. His hand seems ready to do\nthat once, when he stops, takes a breath and loosens his\nshoulder muscles. Now he sets himself again. And makes the\nswitch! The idol is now in his hand, the bag on the pedestal.\nFor a long moment it sits there, then the polished stone\nbeneath the bag drops five inches. This sets off an AURAL\nCHAIN REACTION of steadily increasing volume as some huge\nmysterious mechanism rumbles into action deep in the temple.\nIndy spins and starts his kata back across the sanctuary at\nfour times the speed.\nSatipo's eyes widen in terror. He turns and runs.\nTHE RETREAT - INTERCUTTING INDY AND SATIPO\nThe sanctuary has begun to rumble and shake in response to\nthe mysterious mechanism. Just as Indy goes out the door, a\nrock shakes loose from the wall and rolls onto the tiles\nfloor. Immediately, a noisy torrent of poison darts fills\nthe room.\nIN THE FOYER\nSatipo swings across the pit. He makes it just as the whip\ncomes undone from the beam, leaving Indy without an escape.\nSatipo, extremely nervous, regards the whip a moment then\nturns back to face Indy, who has run up to the far side of\nthe pit."
  },
  {
   "type": "speech",
   "character": "SATIPO",
   "text": "No time to argue. Throw me the idol,\nI throw you the whip."
  },
  {
   "type": "stage direction",
   "text": "Indy hesitates, eyeing the rumbling walls."
  },
  {
   "type": "speech",
   "character": "SATIPO",
   "text": "You have no choice! Hurry!"
  },
  {
   "type": "stage direction",
   "text": "Indy concurs with that assessment. He tosses the idol across\nthe pit to Satipo. Satipo stuffs it in the front pocket of\nhis jacket, gives Indy a look, then drops the whip on the\nfloor and runs."
  },
  {
   "type": "speech",
   "character": "SATIPO",
   "text": "Adios, amigo!"
  },
  {
   "type": "stage direction",
   "text": "Indy grimaces. He had a feeling this might happen. He looks\naround.\nAT THE VINED LANDING\nSatipo flies through like a chubby ballet dancer and takes\nthe steps five at a time.\nIN THE FOYER\nIndy runs in full stride to the edge of the pit and broad\njumps into space. He doesn't make it. His body hits the far\nside of the pit and he begins to slide out of view. Only\nwild clawing with his fingers at the edge of the pit stops\nhis descent. With just the tips of his fingers over the edge,\nhe begins pulling himself up.\nAT THE CHAMBER OF LIGHT\nSatipo has slowed down. He begins to edge carefully around\nthe light shaft.\nAT THE VINED LANDING\nIndy sails through sideways and rolls to a stop at the bottom\nof the steps. His whip is grasped in his hand. As he raises\nhimself, he hears, from above the giant spikes of the Chamber\nof Light CLANG! and an abrupt, sickening rendition of SATIPO'S\nLAST SCREAM. Indy runs up the steps. The rumbling sound grows\nlouder.\nAT THE CHAMBER OF LIGHT\nIndy slides to a stop. The spikes have retracted, taking\nSatipo's body to one side. Indy edges into the chamber with\nhis back to the shaft of light. Soon he is face to face with\nthe dead Satipo; spikes protrude from several vital spots in\nthe Peruvian's body. Indy removes the idol from Satipo's\npocket and moves quickly out the other side."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Adios."
  },
  {
   "type": "stage direction",
   "text": "THE INCLINED PASSAGE\nIndy shoots out of a cut-off hallway and turns toward the\nexit. The rumbling is very loud and now we see why: right\nbehind Indy a huge boulder comes roaring around a corner of\nthe passage, perfectly form-fitted to the passageway. It\nobliterates everything before it, sending the stalactites\nshooting ahead like missiles. Indy dashes for the light of\nthe exit. His hat flies off his head. Almost immediately it\nis crushed by the boulder. Indy dives out the end of the\npassage as the boulder slams to a perfect fit at the entrance,\nsealing the Temple."
  },
  {
   "type": "location",
   "text": "EXT. FRONT OF THE TEMPLE - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy lies on the ground, gasping for air. A shadow falls\nacross him and he looks up.\nWHAT HE SEES\nLooming above him are three figures. Two are HOVITOS WARRIORS\nin full battle paint and loin cloths. They carry long blow\nguns. But the man in the center draws Indy's attention. He\nis a tall, impressive white man, dressed in full safari outfit\nincluding pith helmet. His name is EMILE BELLOQ. His face is\nthin, powerful; his eyes hypnotic; his smile charming, yet\nlethal. His heavily French-accented speech is deep,\nmellifluous, wonderful. Back beyond Belloq and his two\nescorts, thirty more Hovitos Warriors hover at the edge of\nthe trees."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "Dr. Jones, you choose the wrong\nfriends. This time it will cost you."
  },
  {
   "type": "stage direction",
   "text": "Belloq extends his hand. Indy looks at it, then produces the\nidol and hands it to Belloq. Belloq extends his other hand,\nsmiling. Indy hands over his gun. Belloq sticks it in his\njacket."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "And you thought I'd given up."
  },
  {
   "type": "stage direction",
   "text": "(eyeing the Hovitos)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Too bad they don't know you like I\ndo, Belloq."
  },
  {
   "type": "stage direction",
   "text": "(smiles)"
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "Yes, too bad. You could warn them...\nif only you spoke Hovitos."
  },
  {
   "type": "stage direction",
   "text": "With that, Belloq turns dramatically and holds the idol high\nfor all the Hovitos to see and says something in Hovitos.\nThere is a murmur of recognition and all the Indians,\nincluding Belloq's escorts, prostrate themselves upon the\nground, heads down.\nIndy is immediately up and running toward the edge of the\nclearing."
  },
  {
   "type": "stage direction",
   "text": "(in Hovitos)"
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "Kill him!"
  },
  {
   "type": "stage direction",
   "text": "AT THE EDGE OF THE CLEARING\nIndy disappears into the foliage. An instant later, the leaves\nare peppered with a rain of poison darts and spears."
  },
  {
   "type": "location",
   "text": "EXT. THE JUNGLE - INDY'S RUN - VARIOUS SHOTS - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy runs like hell through steadily falling terrain. And\nalways close behind, a swift gang of angry Hovitos.\nOccasionally they get close enough to send a dart or spear\nwhizzing past Indy's head."
  },
  {
   "type": "location",
   "text": "EXT. THE URUBAMBA RIVER - DUSK"
  },
  {
   "type": "stage direction",
   "text": "An amphibian plane sits in the water beneath a green cliff.\nSitting on the wing is JOCK, the British pilot. Indy breaks\nout of some distant brush and runs along the path at the top\nof the cliff."
  },
  {
   "type": "stage direction",
   "text": "(yelling)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Get it going! Get it going!"
  },
  {
   "type": "stage direction",
   "text": "Jock hops in and fires up the plane's engines. Indy reaches\na spot on the cliff above the place, glances back, them jumps\ninto the river. He comes up, swims to the plane and grabs a\nstrut."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "GO!"
  },
  {
   "type": "stage direction",
   "text": "Jock starts the plane moving across the water as Indy walks\nacross the wing and falls into the passenger compartment."
  },
  {
   "type": "location",
   "text": "INT. JOCK'S PLANE - DUSK"
  },
  {
   "type": "stage direction",
   "text": "Indy relaxes and lies across the seat, a big smile on his\nface. One hand drops to the floor of the cabin and Indy jumps,\nhitting his head. On the floor of the cabin is a huge boa\nconstrictor. Indy tries to get his whole body onto the seat.\nJock sees what's happening."
  },
  {
   "type": "speech",
   "character": "JOCK",
   "text": "Don't mind him. That's Reggie.\nWouldn't hurt a soul."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I can't stand snakes."
  },
  {
   "type": "speech",
   "character": "JOCK",
   "text": "The world's full of them, you know."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I hate them."
  },
  {
   "type": "speech",
   "character": "JOCK",
   "text": "Come on now, Sport, show a little of\nthe old backbone."
  },
  {
   "type": "location",
   "text": "EXT. JOCK'S PLANE - TWILIGHT"
  },
  {
   "type": "stage direction",
   "text": "It soars off over the dark jungle."
  },
  {
   "type": "location",
   "text": "INT. INDY'S OFFICE, SMALL EASTERN COLLEGE - DAY"
  },
  {
   "type": "stage direction",
   "text": "It's autumn and the pretty, New England campus out Indy's\nwindow reflects it in dazzling color. A few weeks before the\nstart of classes. Activity just picking up. Some students\nabout.\nIndy is at a bookcase near the window and he looks quite\ndifferent in this setting. His outfit is tweedy, slightly\nrumpled in the professional style. Part of his attention is\nfocused in a book and he wears glasses to see the fine print.\nThe office is cramped, absolutely inundated with books, maps,\netchings and archeological artifacts. In fact, the only neat\nspot in the room right now is Indy's desk, which has been\ncleared off expressly for the benefit of -\nMARCUS BRODY\nThe Curator of the National Museum in Washington, D.C. Brody\nis examining the small artifacts Indy pocketed on his way\ninto the Peruvian Temple. He occasionally uses a jeweler's\neyepiece to get a closer look. But he is distracted, his\nconcerns elsewhere, and it is this that his old friend Indy\nsenses from across the room."
  },
  {
   "type": "speech",
   "character": "BRODY",
   "text": "Do you think the idol will ever show\nup?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I don't know. Just because Belloq\nhad it doesn't mean he kept it."
  },
  {
   "type": "stage direction",
   "text": "Indy snaps the book closed and puts it on the shelf. He takes\nhis glasses off and focuses on Brody. At the windowed door\nto his office, two pretty Coeds pause for a moment, look in\nat their sexy Archeology professor, giggle and disappear."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Getting it away from those Indians\nwould be a neat trick"
  },
  {
   "type": "stage direction",
   "text": "(a hard look)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I hope they got him."
  },
  {
   "type": "stage direction",
   "text": "A young male graduate student, Indy's TEACHING ASSISTANT,\ntaps on the door and then pushes his way in with an armload\nof reference books. Indy helps him find a spot for them."
  },
  {
   "type": "speech",
   "character": "TEACHING ASSISTANT",
   "text": "I couldn't get the McNabe, Professor.\nSomeone's got it checked out 'til\nnext month when classes start."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "That's all right, Phil. Thanks a\nlot."
  },
  {
   "type": "stage direction",
   "text": "(eager to please)"
  },
  {
   "type": "speech",
   "character": "TEACHING ASSISTANT",
   "text": "Will there be anything else?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "No. I'll see you Thursday."
  },
  {
   "type": "stage direction",
   "text": "The Teaching Assistant leaves. Brody is scowling as he\nexamines the last of the artifacts."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Hey, if you don't like them, I can\nalways return them."
  },
  {
   "type": "speech",
   "character": "BRODY",
   "text": "No, they're beautiful. The Museum\nwill buy them as usual. No questions\nasked."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Then what's wrong?"
  },
  {
   "type": "speech",
   "character": "BRODY",
   "text": "I brought along some people today."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "What kind of people?"
  },
  {
   "type": "speech",
   "character": "BRODY",
   "text": "Government."
  },
  {
   "type": "stage direction",
   "text": "(concerned)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Government?"
  },
  {
   "type": "speech",
   "character": "BRODY",
   "text": "Don't worry, it's not about your\nbusiness."
  },
  {
   "type": "stage direction",
   "text": "(indicates the\nartifacts)"
  },
  {
   "type": "speech",
   "character": "BRODY",
   "text": "They're from the Army."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I've already served."
  },
  {
   "type": "speech",
   "character": "BRODY",
   "text": "Army Intelligence. They're looking\nfor Abner."
  },
  {
   "type": "location",
   "text": "INT. INDY'S LECTURE HALL / CLASSROOM - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy's course - a combination of archeology and anthropology -\nis taught in this amphitheater-type lecture hall. His desk\nand lectern hold large reference books; blackboards line the\nwall. Bones, maps, charts festoon the walls.\nIndy leans against his desk talking with Brody and two\nuniformed Army officers, COLONEL MUSGROVE and MAJOR EATON,\nwho are situated around the first seats in the classroom."
  },
  {
   "type": "speech",
   "character": "MUSGROVE",
   "text": "But you did study under Professor\nRavenwood at the University of\nChicago?"
  },
  {
   "type": "stage direction",
   "text": "(nods)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "We haven't spoken in ten years. I'm\nafraid we had a bit of a falling\nout."
  },
  {
   "type": "speech",
   "character": "EATON",
   "text": "You know nothing of his whereabouts?"
  },
  {
   "type": "stage direction",
   "text": "(negative)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Just rumors. Somewhere in Asia, last\nI heard."
  },
  {
   "type": "stage direction",
   "text": "Musgrove and Eaton exchange a look; they're disappointed."
  },
  {
   "type": "stage direction",
   "text": "(to Musgrove)"
  },
  {
   "type": "speech",
   "character": "EATON",
   "text": "Maybe Dr. Jones can make sense of\nit."
  },
  {
   "type": "stage direction",
   "text": "Again the military men have a silent communication, deciding\nwhat to reveal."
  },
  {
   "type": "speech",
   "character": "MUSGROVE",
   "text": "Well... you must understand, Dr.\nJones, this is all strictly\nconfidential."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I understand."
  },
  {
   "type": "speech",
   "character": "MUSGROVE",
   "text": "Yesterday, one of our European\nsections intercepted a Nazi communiqué\nfrom Cairo to Berlin. We don't quite\nknow what to make of it."
  },
  {
   "type": "stage direction",
   "text": "Musgrove takes a sheet from his briefcase."
  },
  {
   "type": "speech",
   "character": "MUSGROVE",
   "text": "Here it is - \"Tanis development\nproceeding. Acquire headpiece, Staff\nof Ra, General Tengtu Hok, Shanghai.\nLocate Abner Ravenwood, U.S.\""
  },
  {
   "type": "stage direction",
   "text": "Brody is excited. He looks at Indy."
  },
  {
   "type": "speech",
   "character": "BRODY",
   "text": "Tanis. They must have discovered the\nlost ruins."
  },
  {
   "type": "stage direction",
   "text": "Indy contemplates this big news; he's impressed."
  },
  {
   "type": "stage direction",
   "text": "(to himself)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Tanis. Ain't that somethin'!"
  },
  {
   "type": "speech",
   "character": "EATON",
   "text": "Frankly, we're a little suspicious...\nAn American being mentioned so\nprominently in a secret Nazi cable."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Ah, Ravenwood's no Nazi."
  },
  {
   "type": "speech",
   "character": "EATON",
   "text": "Then what do they want him for?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "They're looking for the headpiece to\nthe Staff of Ra."
  },
  {
   "type": "stage direction",
   "text": "(indicates his sheet)"
  },
  {
   "type": "speech",
   "character": "MUSGROVE",
   "text": "But it says here that's in China."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Only half of it. Ravenwood had the\nother half."
  },
  {
   "type": "speech",
   "character": "EATON",
   "text": "What would the Nazis want with this -\nthis Staff of Ra?"
  },
  {
   "type": "speech",
   "character": "BRODY",
   "text": "I can tell you that. Over the last\ntwo years the Nazis have had teams\nof archeologists running around the\nworld looking for all kinds of\nreligious artifacts."
  },
  {
   "type": "speech",
   "character": "MUSGROVE",
   "text": "That's right. Hitler's a nut on the\nsubject. Crazy. He's obsessed with\nthe occult."
  },
  {
   "type": "speech",
   "character": "EATON",
   "text": "What is this Staff of Ra, anyway?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "It all has to do with the Ark of the\nCovenant."
  },
  {
   "type": "stage direction",
   "text": "(the Army guys look\nmystified)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "The chest the Hebrews used to carry\naround the Ten Commandments."
  },
  {
   "type": "stage direction",
   "text": "Now it's the Army men who are impressed."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "An Egyptian pharaoh stole the Ark\nfrom Jerusalem and took it back to\nthe city of Tanis. A short time later,\nTanis was consumed by the desert in\na sandstorm that lasted a year. But\nbefore that, the Pharaoh had had the\nArk hidden away in a secret chamber\ncalled the Well of the Souls. Which\nis where the Staff of Ra comes in."
  },
  {
   "type": "stage direction",
   "text": "Indy moves to the blackboard and makes a quick sketch to\ngive a rough idea of the system as he describes it. (and we\nget a glimpse of what an interesting and enthusiastic teacher\nhe must be)."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Now this was rather clever. The Staff\nwas really just a big stick - oh, I\ndon't know, say like this -"
  },
  {
   "type": "stage direction",
   "text": "(he indicates about\nsix feet)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "no one really knows for sure. Any\nway, it was capped by an elaborate\nheadpiece with a carving of the sun\nat the top. What you had to do was\ntake the Staff to a special map room\nin Tanis - it had the whole city\nlaid out in miniature on the floor.\nWhen you placed the Staff in a certain\nspot in this room, at a certain time\nof day, the sun would shine through\na hole here in the headpiece and\nthen send a beam of light down here -\nto the map - giving you the location\nof the Well of the Souls..."
  },
  {
   "type": "speech",
   "character": "MUSGROVE",
   "text": "...where the Ark of the Covenant was\nkept."
  },
  {
   "type": "stage direction",
   "text": "(nods)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Which is probably what the Nazis are\nafter."
  },
  {
   "type": "speech",
   "character": "EATON",
   "text": "What's this Ark look like?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Look like? Why, it's right here..."
  },
  {
   "type": "stage direction",
   "text": "Indy pulls a big format book from the stack on his lectern\nand flips through the pages until he finds a large color\nprint. The other men gather to look.\nTHE PRINT\nFills the screen.\nIt shows a Biblical battle. The Israelite Army is vanquishing\nan opposition force. At the forefront of the Israelite ranks,\ntwo men carry the Ark of the Covenant, a beautiful gold chest,\ncrowned by two sculptured gold angels. The men do not touch\nthe Ark itself; rather they carry it by use of two long wooden\npoles which pass through rings in the corners of the Ark.\nThe painting is very dramatic, full of smoke, tumult and\nsinewy dying men. But the most astounding thing in the picture\nis the brilliant jet of white light and flame issuing from\nthe wings of the angels. It pierces deep into the ranks of\nthe retreating enemy, wreaking devastation and terror."
  },
  {
   "type": "speech",
   "character": "EATON",
   "text": "Good God!"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Yes. That's what the Hebrews thought."
  },
  {
   "type": "speech",
   "character": "MUSGROVE",
   "text": "What's that supposed to be coming\nout of there?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Who knows... lightning... fire...\nthe power of God."
  },
  {
   "type": "speech",
   "character": "EATON",
   "text": "I'm beginning to understand Hitler's\ninterest in this thing."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Oh yes. The Bible tells of it leveling\nmountains and wasting entire regions.\nMoses promised that when the Ark was\nwith you, \"your enemies will be\nscattered and your foes fell before\nyou\"."
  },
  {
   "type": "stage direction",
   "text": "(pause)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "An army which carries the Ark before\nit is invincible."
  },
  {
   "type": "stage direction",
   "text": "Eaton and Musgrove exchange worried looks."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Oh, there's one other thing that\nHitler undoubtably believes about\nthe Ark..."
  },
  {
   "type": "stage direction",
   "text": "(a long pregnant pause)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "It's said that the Lost Ark will be\nrecovered at the time of the coming\nof the True Messiah."
  },
  {
   "type": "speech",
   "character": "MUSGROVE",
   "text": "Dr. Jones, you've been very helpful.\nI hope we can call on you again if\nwe have questions."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Most certainly."
  },
  {
   "type": "stage direction",
   "text": "Brody and Indy exchange a look as they all shake and Brody\nstarts to leave with the Army men."
  },
  {
   "type": "location",
   "text": "EXT. FRONT DOOR, INDY'S HOUSE - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Indy's English Tudor, upper middle class home. Quite toney;\nwell beyond the financial reach of an honest college\nprofessor. Marcus Brody has already rung the bell. Indy opens\nthe door. He is dressed in a tuxedo."
  },
  {
   "type": "speech",
   "character": "BRODY",
   "text": "I've got to talk to you."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "This isn't really a good time."
  },
  {
   "type": "speech",
   "character": "BRODY",
   "text": "Indy, it's important."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "All right. Come on in."
  },
  {
   "type": "location",
   "text": "INT. FOYER, INDY'S HOUSE"
  },
  {
   "type": "stage direction",
   "text": "The lush tone continues here in Art Deco and shiny marble.\nIndy motions Brody toward the study to one side."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I'll be in a minute."
  },
  {
   "type": "stage direction",
   "text": "As Brody passes the entrance to the expansive living room,\nhe spots a beautiful, silk-gowned Harlow-type lounging on\nthe sofa in front of a roaring fire. She is sipping champagne."
  },
  {
   "type": "location",
   "text": "INT. STUDY, INDY'S HOUSE"
  },
  {
   "type": "stage direction",
   "text": "Brody enters the book-lined, dark-wooded study. He paces for\na moment before the fire which is dying in the fireplace,\nthen spots something and goes over to Indy's big desk. The\nsurface is covered with open books, monographs, maps and\ndrawings - all about the Ark of the Covenant. Brody smiles;\nhe knows his friend very well. Indy comes in, closing the\ndoor behind him. Brody turns to him with a triumphant\nexpression."
  },
  {
   "type": "speech",
   "character": "BRODY",
   "text": "They want you to go for it. And\nthey'll pay."
  },
  {
   "type": "stage direction",
   "text": "(smiles)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Good work, Marcus. I had a feeling\nthis would happen. And, of course,\nthe Museum gets the Ark when we're\ndone."
  },
  {
   "type": "stage direction",
   "text": "(smiles)"
  },
  {
   "type": "speech",
   "character": "BRODY",
   "text": "Of course."
  },
  {
   "type": "stage direction",
   "text": "Indy's manner is vigorous, aggressive."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Okay, here's the way it's gonna be.\nFirst, I'll high-tail it to Shanghai\nand get the piece from General Hok.\nThen I think I know where I can find\nRavenwood. If only I can get -"
  },
  {
   "type": "speech",
   "character": "BRODY",
   "text": "General Hok's a tough customer. They\ndon't call him the Wild Boar for\nnothing. And he's tied in with the\nJapanese."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I'll worry about that when the time\ncomes. My only hope is to find the\nWell of the Souls before the Nazis\ndo."
  },
  {
   "type": "stage direction",
   "text": "WIPE TO:"
  },
  {
   "type": "location",
   "text": "EXT. IN THE AIR - DAY / NIGHT"
  },
  {
   "type": "stage direction",
   "text": "A Pan Am Clipper flies west over the Pacific.\nWIPE TO:"
  },
  {
   "type": "location",
   "text": "INT. KEHOE'S CAR (SHANGHAI AIRPORT) - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy is barely into the front seat of a dilapidated Ford as\nthe driver, BUZZ KEHOE, is peeling out into traffic. In the\nback seat is a Chinese named BANG CHOW. Kehoe zigs crazily\nthrough traffic with only his left hand as he reaches over\nto shake with Indy."
  },
  {
   "type": "speech",
   "character": "KEHOE",
   "text": "Buzz Kehoe, Army Intelligence. You've\nmet Bang Chow."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "What's the hurry?"
  },
  {
   "type": "speech",
   "character": "KEHOE",
   "text": "Some German agents got here two hours\nago. Luckily, Bang was able to have\nthem detained at Customs. We'll have\nto hurry."
  },
  {
   "type": "location",
   "text": "EXT. HOK'S STREET - DAY"
  },
  {
   "type": "stage direction",
   "text": "Kehoe's car emerges from an alley. Down the block is Tengtu\nHok's modest, walled palace. Kehoe's car slows a bit and\nBang steps from the moving car with a small black suitcase\nin his hand. While he heads down the street toward Hok's\nplace, Kehoe's car continues across the street and into an\nalley on the other side."
  },
  {
   "type": "location",
   "text": "EXT. HOK'S STREET - IN FRONT OF PALACE - DAY"
  },
  {
   "type": "stage direction",
   "text": "A Mercedes limousine appears round a corner and squeals to a\nstop at the front gate of the palace, which is manned by a\nsturdy Chinese Gateman. There are three Germans inside, one\nthe driver."
  },
  {
   "type": "location",
   "text": "EXT. ALLEY BEHIND HOK'S MUSEUM - DAY"
  },
  {
   "type": "stage direction",
   "text": "Kehoe, alone now, pushes a trash container casually into\nposition to hide a newly created hole in the rear wall of\nHok's Museum where several stone blocks have been removed.\nHe looks around and ambles back to the car."
  },
  {
   "type": "location",
   "text": "INT. HOK'S PALACE - ENTRY HALL"
  },
  {
   "type": "stage direction",
   "text": "The three Germans wait impatiently in a magnificent foyer. A\nchime sounds and huge double doors open to reveal TENGTU\nHOK, flanked by two uniformed Japanese Soldiers and a robed\nChinese Advisor. He wears a fantastic gold ornamental robe.\nDespite the majesty, however, nothing can disguise the fact\nthat Hok is basically a wild, fat barbarian; an animal. Hok\nand his escort group bow in what is the beginning of a long\nwelcoming ceremony. The Germans exchange impatient glances\nbut decide they should play it as it comes. They bow."
  },
  {
   "type": "location",
   "text": "INT. HOK'S MUSEUM"
  },
  {
   "type": "stage direction",
   "text": "No person in sight. Instead, we see a magnificent display of\nancient artifacts. Glass cases hold the velvet-couched pieces\nat random spots on the shining marble floor. We hear an odd\nsound. Near the floor on the rear wall of the museum, a steel\nventilation grate moves. A hand slides it gently across the\nmarble. Indy sticks his head out and looks around."
  },
  {
   "type": "location",
   "text": "INT. HOK'S PALACE - TEA ROOM"
  },
  {
   "type": "stage direction",
   "text": "The three Germans are being served tea and exotic delicacies.\nA pleased Tengtu Hok watches from a throne-cushion. When the\ntray of tiny delicacies is presented to him, he takes a\nmassive handful, crushing them together on their way to his\nsmiling mouth."
  },
  {
   "type": "location",
   "text": "INT. HOK'S MUSEUM"
  },
  {
   "type": "stage direction",
   "text": "A huge golden gong, seven feet in diameter, is suspended\nfrom the ceiling by a hook. An enormous hammer hangs poised\nabove it, from which emanate myriad tiny threads which run\nup and across the ceiling, then down to the various display\ncases. Indy looks up at the gong, then continues his quick,\nquiet foray among the cases. Beyond him, a high window."
  },
  {
   "type": "location",
   "text": "INT. HOK'S PALACE - TEA ROOM"
  },
  {
   "type": "stage direction",
   "text": "Hok and his visitors stand to go. The German's pleased\nexpressions make it clear they're finally on their way to\nthe museum."
  },
  {
   "type": "location",
   "text": "INT. HOK'S MUSEUM"
  },
  {
   "type": "stage direction",
   "text": "Indy arrives at his destination. The lovely, carved gold\nsection of the headpiece is nested on purple velvet in a\nglass case. At the bottom of the piece is a round hollow\nwhere the staff would fit. There is a grunting sound behind\nIndy and he spins, already reaching for his revolver.\nA fierce Japanese Samurai is running at Indy full speed down\nan aisle of display cases. His sword is raised over his\nshoulder ready to cut Indy in half. He's six feet away when\nIndy's gun levels and fires twice, blasting him backwards.\nIndy is still looking over his gun when another samurai sword\ncomes down from the side and knocks the pistol brutally out\nof Indy's grip; his hand avoids amputation by a quarter of\nan inch.\nAn amazed Indy backs away from the crossing aisle as the\nSecond Samurai steps in to face him, sword raised. Indy backs\naway into an open space and his bullwhip appears in his hand.\nHe gives it one savage CRACK! to announce its arrival and\nthe Samurai slows down, eyeing it curiously. The Samurai\ndoes not look unhappy about this confrontation. How pure it\nis - The Sword versus The Whip."
  },
  {
   "type": "location",
   "text": "EXT. HOK'S PALACE - SECOND FLOOR WALKWAY - DAY"
  },
  {
   "type": "stage direction",
   "text": "Tengtu Hok and the Germans have obviously heard something.\nThey are hurrying along the walkway at the side of the\nbuilding, Hok in the lead. Up ahead is the foot bridge which\ncrosses from the palace to the museum entrance over a moat."
  },
  {
   "type": "location",
   "text": "EXT. STREET IN FRONT OF THE PALACE - DAY"
  },
  {
   "type": "stage direction",
   "text": "The Lovely Mercedes limousine blows up."
  },
  {
   "type": "location",
   "text": "EXT. HOK'S PALACE - SECOND FLOOR WALKWAY - DAY"
  },
  {
   "type": "stage direction",
   "text": "The Germans spin toward the blast. Drawing weapons, they run\nback to investigate. Hok follows them, confused."
  },
  {
   "type": "location",
   "text": "INT. HOK'S MUSEUM"
  },
  {
   "type": "stage direction",
   "text": "Indy and the Samurai face each other. They're both breathing\nhard from previous, no-contact passes at each other. Now\nIndy begins swinging the whip over his head again. It whizzes\nout toward the Samurai's face. The Samurai takes two lightning-\nquick cuts at the leather, but misses. Indy swings for the\nSamurai's feet; the Japanese jumps nimbly, slashing at the\nwhip. Indy does it again. The Samurai hops it. Once more.\nThe Samurai is concentrating on hopping it.\nIndy sees it. The split second he wants. The whip flashes up\nfrom the floor and wraps solidly and irrevocably around the\nSamurai's neck. Indy gives it a murderous pull and the Samurai\nis dead on his feet."
  },
  {
   "type": "location",
   "text": "EXT. HOK'S PALACE - SECOND FLOOR WALKWAY - DAY"
  },
  {
   "type": "stage direction",
   "text": "Hok and the three Germans are looking down at the flaming\nremains of the Mercedes. A look of concern crosses Hok's\nface. He turns and runs back toward his beloved museum."
  },
  {
   "type": "location",
   "text": "INT. HOK'S MUSEUM"
  },
  {
   "type": "stage direction",
   "text": "Indy is at the case containing the headpiece. He smashes the\nglass with a samurai sword, reaches in and grabs the piece.\nImmediately, behind him, the huge hammer falls and the sound\nof the gong thunders through the museum."
  },
  {
   "type": "location",
   "text": "EXT. HOK'S PALACE - SECOND FLOOR WALKWAY - DAY"
  },
  {
   "type": "stage direction",
   "text": "At the sound of the gong, the running Hok skids to a halt\nwith a crazed expression on his face. He disappears for two\nseconds in an alcove and emerges holding a big, black Thompson\nSubmachine Gun. He runs across the foot bridge and is just\nbarely over it when it blows up. Hok, safe, looks behind him\nin amazement and then turns to the museum."
  },
  {
   "type": "location",
   "text": "INT. HOK'S MUSEUM"
  },
  {
   "type": "stage direction",
   "text": "The double doors at the entrance slam open to reveal Hok.\nIndy is halfway along an unprotected wall back to his\nventilation entry route. Hok opens up on him, cutting off\nhis retreat. Indy jumps behind a marble column, which is\npromptly blasted with machine gun fire.\nIndy looks above him, sees the giant disk of the gong.\nReaching up, pushing with tremendous effort, he maneuvers it\noff the hook. It bounces down to the floor on its side,\nchipping the marble with its monstrous weight. Indy steadies\nit and then puts his whole body into rolling it across the\nroom toward the window. As it starts to roll, Indy slips\nbehind it and runs across the room with it.\nHok can see the rolling gong. He opens up on it. The vicious\ncacophony of machine gun fire is joined by the musical reports\nof bullets hitting the gong and ricocheting away. Very, very\nnoisy.\nBehind the gong, Indy gauges his move. As the gong is about\nto be stopped by a marble bench, Indy talks a long stride\nonto the bench and dives through the glass of the high window.\nHok's bullets hit the wall."
  },
  {
   "type": "location",
   "text": "EXT. ROOF - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy lands in a shower of glass on the jutting roof of the\nmuseum's first floor. He rolls to a crouch and is immediately\nbeing fired upon. The Germans, cut off from the museum, are\nstanding on the palace walkway firing at him. Indy takes off\nfast for the rear of the museum."
  },
  {
   "type": "location",
   "text": "EXT. ALLEY BEHIND MUSEUM - DAY"
  },
  {
   "type": "stage direction",
   "text": "Kehoe, craning to locate Indy, has the Ford rolling slowly\nalong the back of the museum. Bang scouts from the back seat.\nIndy appears on the roof at a run, gauges the movement of\nthe car and jumps from the roof of the museum to the roof of\nthe sedan. Unfortunately, the roof of the old car can't take\nit and Indy's legs knife right on through to the interior,\nwhere he scares the hell out of Kehoe."
  },
  {
   "type": "location",
   "text": "INT. KEHOE'S CAR - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy squirms his way down into the front seat."
  },
  {
   "type": "speech",
   "character": "KEHOE",
   "text": "Jesus! Are you all right!"
  },
  {
   "type": "stage direction",
   "text": "(he's felt better)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Great. Got it."
  },
  {
   "type": "stage direction",
   "text": "Kehoe guns it, throwing Indy back against the cushions."
  },
  {
   "type": "speech",
   "character": "KEHOE",
   "text": "What now?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I've got to get to Nepal."
  },
  {
   "type": "stage direction",
   "text": "WIPE TO:"
  },
  {
   "type": "location",
   "text": "EXT. DC-3 IN THE AIR - DUSK"
  },
  {
   "type": "stage direction",
   "text": "The plane flies west into the sunset."
  },
  {
   "type": "location",
   "text": "INT. DC-3 - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Under a meager seat light, Indy is pouring over a journal\narticle by Abner Ravenwood and related map of Nepal.\nA few rows back, across the aisle, a trenchcoated European\nSpy eyes Indy.\nWIPE TO:"
  },
  {
   "type": "location",
   "text": "INT. \"THE RAVEN\" SALOON - PATAN, NEPAL - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "A huge stuffed raven, wings spread wide, is mounted behind\nthe long bar in the noisy, crowded saloon. A lively mix of\npatrons is represented in the late hour tableau: Nepalese\nnatives, fierce Sherpa mountain guides, sleazy international\nsmugglers and fugitives, and, of course, mountain climbers\nfrom every corner of the earth. A tall Nepalese, MAHDLO, is\nthe bartender.\nIn a corner near the fireplace trouble breaks out suddenly\nbetween the groups at two neighboring tables. Ferocious\nrepresentatives from each table - one a wild-looking SHERPA,\nthe other a muscular Australian CLIMBER - jump up to face\neach other. As the two contenders stand poised for action,\ntheir respective supporters shift in their places, fondling\nlethal ice axes and clubs."
  },
  {
   "type": "speech",
   "character": "SHERPA",
   "text": "Gmoiska! Shurga rintoik!"
  },
  {
   "type": "speech",
   "character": "CLIMBER",
   "text": "Aye! That'll be your last word."
  },
  {
   "type": "stage direction",
   "text": "The bar has quieted ominously and so we hear with startling\nclarity when - a door behind the bar slams open with a huge\nBANG! and some Presence, too small to be seen as it moves\nthrough the forest of towering patrons, makes a beeline for\nthe troubled corner of the bar. A path clears for it.\nThe Sherpa and the Climber are about to kill each other when\nthe Presence arrives directly between them: she is MARION\nRAVENWOOD, twenty-five years old, beautiful, if a bit hard-\nlooking. At this moment, however, that look does not hurt.\nShe is not intimidated by the combatants; she jabs accusatory\nfingers into their chests. She is angry as hell. The patrons\nshrink under her gaze."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "That does it! I've been patient with\nyou no-goods long enough. I'm not\nopen at 2 o'clock for myself, you\nknow. It's all for you. And how do\nyou repay me: Trouble and noise and\nblood on my floor! I won't have it.\nEverybody out! Out! Out! We're closed.\nClosed! Do your killing outside! And\ndon't leave any bodies on the porch!"
  },
  {
   "type": "stage direction",
   "text": "The place clears quickly. Stragglers and grumblers are given\nspecial attention by Marion and Mahdlo, who has come from\nbehind the bar carrying a big axe handle. Mahdlo herds the\ncrows out the front door as Marion turns and walks behind\nthe bar.\nA scowl on her lovely face, she has just begun clearing the\nbar of glasses when she notices one remaining Patron huddled\nover a glass at the far end of the bar. Grimacing in\nexasperation, she heads that way like a locomotive."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Hey you, deaf one! I said out of my\nplace. I don't mean next Easter, I\nmean now -"
  },
  {
   "type": "stage direction",
   "text": "She is almost on him when Indy looks up smiling. Marion stops,\nstares, shocked."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Hello, Marion."
  },
  {
   "type": "stage direction",
   "text": "She hits him with a solid right to the jaw, knocking him off\nthe barstool on the floor. He rubs his jaw and smiles up at\nher."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Nice to see you, too."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Get up and get out."
  },
  {
   "type": "stage direction",
   "text": "(getting up)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Take it easy. I'm looking for your\nfather."
  },
  {
   "type": "stage direction",
   "text": "(bitterly)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Well you're two years too late."
  },
  {
   "type": "stage direction",
   "text": "Indy's attitude changes instantly. This is sad news. He is\nsilent for a long time. Mahdlo comes in the front door and\nhurries forward when he sees Indy with Marion. He looks to\nher for guidance, but she stays him with a gesture."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Go home, Mahdlo. I'll see you\ntomorrow."
  },
  {
   "type": "stage direction",
   "text": "Mahdlo is hesitant, but lays the axe handle on the bar and\ngoes out. Indy has been barely aware of him. Now he settles\nagain on the barstool. Marion has a vindictive look. She'll\nlet him stay, but she wants to inflict as much pain as\npossible."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "What happened?"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Avalanche. Up there. He was digging.\nWhat else? He spent his whole life\ndigging. Dragging me all over this\nrotten earth. For what?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Do you find him?"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Hell no. He's buried where he was\nworking. Probably preserved real\ngood, too. In the snow."
  },
  {
   "type": "stage direction",
   "text": "Suddenly the hardness cracks. She is on the verge of tears\nand does not want him to see them. She turns away and takes\na whiskey bottle from the shelf, then turns back to pout\nherself a drink."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Not a bad way to go. Doing what he\nloved."
  },
  {
   "type": "stage direction",
   "text": "(vitriolic)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Don't give me that stuff! What do\nyou know?"
  },
  {
   "type": "stage direction",
   "text": "(she takes a drinks)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "I'm the one that was left in a bad\nway. He didn't have a penny. Guess\nhow I lived, Mister Jones. I worked\nhere. And I wasn't the bartender."
  },
  {
   "type": "stage direction",
   "text": "(another swallow)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Finally the guy that owned the joint\nwent crazy. Snow crazy. They took\nhis away screaming. As they dragged\nhim out, he said the place was all\nmine for life."
  },
  {
   "type": "stage direction",
   "text": "She looks around the saloon."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Can you imagine a more evil curse?"
  },
  {
   "type": "stage direction",
   "text": "(pause)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "So far, it's working."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Why not leave? Go back to the States."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "I'll go back. I'll get there. Not\nthat there's a soul there who knows\nmy name or cares. But I'll go. And\nwhen I do, they'll know me. 'Cause\nI'm going to go back in style. With\nmoney. A goddamn lady!"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Where you gonna get it?"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "If I knew that, you think I'd still\nbe running this dive?"
  },
  {
   "type": "stage direction",
   "text": "Indy looks at her, thinking. Under his gaze, she blushes,\nfor reasons only she understands. She looks into her glass\nand, for a moment, she softens."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "I'll tell you something Indy. I've\nlearned to hate you in the last ten\nyears. But somehow, no matter how\nmuch I hated you, I always knew that\nsomeday you'd come through that door.\nI never doubted that. Something made\nis inevitable."
  },
  {
   "type": "stage direction",
   "text": "(hopefully)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Why are you here... now... tonight?"
  },
  {
   "type": "stage direction",
   "text": "Indy takes a long time to answer."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I need one of the pieces your father\ncollected."
  },
  {
   "type": "stage direction",
   "text": "Marion's eyes go icy. She swings at him again with her right,\nbut this time he catches her at the wrist. Then he stops her\nleft, which she has brought up to slap him."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "You son-of-a-bitch! You know what\nyou did to me, to my life? This is\nyour handiwork."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I never meant to hurt you."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "I was a child!"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "You knew what you were doing."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "I was in love."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I guess that depends on your\ndefinition."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "It was wrong. You knew it."
  },
  {
   "type": "stage direction",
   "text": "Indy releases her arms."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Look, I did what I did. I don't expect\nyou to be happy about it. But maybe\nwe can do each other some good."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Why start now?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Shut up and listen for a second. I\nwant that piece your father had.\nI've got money."
  },
  {
   "type": "stage direction",
   "text": "This stops her."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "How much?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Enough to get you back to the States.\nWhere are his things?"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Gone. I sold it all. It was all junk.\nThe junk he wasted his life on."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Everything?"
  },
  {
   "type": "stage direction",
   "text": "Marion nods."
  },
  {
   "type": "stage direction",
   "text": "(giving up)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "That's too bad."
  },
  {
   "type": "stage direction",
   "text": "Indy feels tired, defeated. Marion is pleased."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "You look disappointed. I like that.\nHow's it feel?"
  },
  {
   "type": "stage direction",
   "text": "Indy has to smile at her glee."
  },
  {
   "type": "stage direction",
   "text": "(nods at his empty\nglass)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "What are you drinking?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Seltzer."
  },
  {
   "type": "stage direction",
   "text": "(refilling his glass)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Real man's drink. Me, I like scotch.\nAnd I like bourbon. And vodka and\ngin. I'm not much for brandy. I'm\noff that."
  },
  {
   "type": "stage direction",
   "text": "She pours herself another as Indy watches, amused."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "You're a tough broad now, aren't\nyou?"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "It's no act, pal. This ain't\nSchenectady."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I can only say I'm sorry so many\ntimes."
  },
  {
   "type": "stage direction",
   "text": "Marion looks at him thoughtfully, takes a drink."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "You really have money? You don't\nlook rich."
  },
  {
   "type": "stage direction",
   "text": "(Indy nods)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "I may be able to locate some of his\nthings. I know who's got them. What\ndo you want?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "A bronze piece, about this size. In\nthe shape of the sun. Probably broken\noff at the bottom. Has a little hole\nin it, off-center. Does that sound\nfamiliar?"
  },
  {
   "type": "stage direction",
   "text": "Marion thinks, nods slowly."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Do you know where it is?"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Maybe. How much?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Three thousand. American."
  },
  {
   "type": "stage direction",
   "text": "(negative)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "That'll get me back, but not in style.\nThis doodad must be pretty important."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Maybe."
  },
  {
   "type": "stage direction",
   "text": "A huge smile lights up Marion's face."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "I knew it would happen eventually. I\nknew it. Something had to go my way."
  },
  {
   "type": "stage direction",
   "text": "(pours herself another\ndrink)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "I've got to think this out. I'm used\nto bargaining with yaks."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Okay, five thousand. That's all I\ncan give you now. I can get you more\nwhen you land in the States."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "You word, huh?"
  },
  {
   "type": "stage direction",
   "text": "(Indy nods)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Just like you said you'd be back\nlast time? That was your word too."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I'm back, aren't I?"
  },
  {
   "type": "stage direction",
   "text": "Marion sneers and they smile together."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "You can trust me."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Come back tomorrow."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Why?"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Because I said so, that's why. It's\nabout time I called the shots in\nthis relationship."
  },
  {
   "type": "stage direction",
   "text": "Indy nods, gets up to go."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Wait a minute. Leave the five thousand\nhere."
  },
  {
   "type": "stage direction",
   "text": "(Indy hesitates)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "You want trust, give some. I want to\nsmell your money."
  },
  {
   "type": "stage direction",
   "text": "Indy thinks about this a moment, then reaches inside his\nshirt and pulls cash from a money belt. He lays five grand\non the bar."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I trust you."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "You're an idiot."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I've heard that."
  },
  {
   "type": "stage direction",
   "text": "Indy starts for the door. Marion takes another think. She is\ngetting high."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Hold it. Come here."
  },
  {
   "type": "stage direction",
   "text": "(moving back)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Bossy, aren't you?"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "That's right. Give me a kiss."
  },
  {
   "type": "stage direction",
   "text": "Indy looks into her eyes, then leans over the bar and kisses\nher deeply. When the kiss ends, their faces are very close.\nMarion is flushed. She liked it and would like more. She\nraises her glass between them to discipline herself."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Get out of my place."
  },
  {
   "type": "stage direction",
   "text": "Indy smiles and walks to the front door. Then, without looking\nback -"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Tomorrow."
  },
  {
   "type": "stage direction",
   "text": "He's gone. Marion stares after him, thinking. She takes a\ndrink. Then slowly, her hand comes up to loosen the scarf\nthat is draped around her throat. It falls away, revealing\nher graceful neck above the dipping top of her blouse. Hanging\nthere on a gold chain against her white skin is a sun-shaped\ngolden medallion. The bottom looks broken off. Marion lifts\nthe medallion so she can see it in her hand, then looks\nthoughtfully after Indy."
  },
  {
   "type": "location",
   "text": "EXT. STREETS OUTSIDE \"THE RAVEN\" - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Indy sits thinking at the wheel of an old car. Finally, he\nputs the car in gear and drives away.\nAcross the street, the shadow in a doorway comes to life. A\ndark form steps out to look at Indy's departing car; it is\nthe European Spy from the DC-3. He hurries off in the opposite\ndirection.\nDISSOLVE TO:"
  },
  {
   "type": "location",
   "text": "INT. \"THE RAVEN\" - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Marion stands before the fire that is shrinking in the\nfireplace. She jabs at it abstractedly with a poker, thinking.\nSuddenly tears well up in her eyes. She lets the poker slip\nfrom her hand, wipes away the tears. She walks across the\nroom to the end of the bar, still cluttered with bottles and\nglasses, and stops at the pile of American money Indy has\nleft. She takes the chain from around her neck and lets the\nmedallion slide off it into her hand. She places it on the\nbar next to the pile of money, thinking. Then, having reached\nsome decision, she picks up the pile of bills, walks up the\nback of the bar and pulls a small wooden box from under the\nbar. She flips open the top, puts the cash inside and closes\nthe top. She leaves the box on the bar and starts back toward\nthe medallion. The front door of the saloon bursts open and\nFour Bad Men come in. Marion, halfway between the valuable\npossessions and not wishing to draw attention to either,\nstops where she is.\nThe Four Bad Men who advance on her are:\n1.) the obvious leader, a short, vile, sadistic German in\nspectacles by the name of BELZIG.\n2.) a trenchcoated SECOND NAZI.\n3.) a ratty-looking NEPALESE and\n4.) a mean MONGOLIAN. The second NAZI and the MONGOLIAN both\ncarry submachine guns."
  },
  {
   "type": "speech",
   "character": "BELZIG",
   "text": "Good evening, Fraulein."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "The bar's closed."
  },
  {
   "type": "speech",
   "character": "BELZIG",
   "text": "We are not thirsty."
  },
  {
   "type": "stage direction",
   "text": "The Mongolian and the Nepalese poke around, checking to make\nsure there's no one else there.\nDown at the end of the bar, the medallion lies partially\nhidden by surrounding glasses and bottles. The Second Nazi\nstops very near it, but turns his back to it to face Belzig\nand Marion."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "What do you want?"
  },
  {
   "type": "speech",
   "character": "BELZIG",
   "text": "The same thing your friend Dr. Jones\nwanted. Surely he told you there\nwould be other interested parties."
  },
  {
   "type": "stage direction",
   "text": "Marion shakes her head."
  },
  {
   "type": "speech",
   "character": "BELZIG",
   "text": "Ah, the man is nefarious. I hope for\nyour sake he has not yet acquired\nit."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Why, are you willing to offer more?"
  },
  {
   "type": "speech",
   "character": "BELZIG",
   "text": "Almost certainly. Do you still have\nit?"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "No. But I know where it is."
  },
  {
   "type": "stage direction",
   "text": "Belzig's smile fades at this news. He's not a patient sort.\nMarion is chilled by the look. She turns and moves to the\nshelf of bottles behind her, reaching high for one, very\nnear the large stuffed raven. He hand lingers there a moment\nand we see -\nFrom an angle behind the stuffed raven, that the left wing\nspread hides a Baretta automatic pistol. Marion's hand is\nvery near it, but withdraws with only a whiskey bottle as\nthe Mongolian walks toward her behind the bar.\nMarion opens the bottle before Belzig, who watches her\nintently."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "How 'bout a drink for you and your\nmen?"
  },
  {
   "type": "stage direction",
   "text": "The Second Nazi lights up at this suggestion. Belzig gives\nhim a withering look."
  },
  {
   "type": "speech",
   "character": "BELZIG",
   "text": "We will stick to the business at\nhand, Fraulein."
  },
  {
   "type": "stage direction",
   "text": "(tough)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Fine. Why don't you come back tomorrow\nwhen Jones is here and we'll have an\nauction?"
  },
  {
   "type": "stage direction",
   "text": "Belzig gives her a cold look then turns and walks over toward\nthe fireplace. As soon as his back is turned, the Second\nNazi grabs the nearest whiskey bottle and takes a quick pull.\nIn so doing, he leaves the medallion completely exposed.\nMarion is aware of this as she looks at him. But he quickly\nputs the bottle down again, obscuring the medallion, when\nBelzig speaks from the fireplace."
  },
  {
   "type": "speech",
   "character": "BELZIG",
   "text": "I'm afraid an auction is not possible."
  },
  {
   "type": "stage direction",
   "text": "(pause)"
  },
  {
   "type": "speech",
   "character": "BELZIG",
   "text": "Your fire is dying here, Fraulein."
  },
  {
   "type": "stage direction",
   "text": "(a beat, then\nthreatening)"
  },
  {
   "type": "speech",
   "character": "BELZIG",
   "text": "Why don't you tell us where the piece\nis right now?"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Listen, Herr Mac, I don't know who\nyou're used to dealing with, but no\none tells me what to do in my place."
  },
  {
   "type": "stage direction",
   "text": "Belzig, still looking in the fire, sneers and shakes his\nhead."
  },
  {
   "type": "speech",
   "character": "BELZIG",
   "text": "Americans! You're all alike. Fraulein\nRavenwood. I'll show you want I'm\nused to."
  },
  {
   "type": "stage direction",
   "text": "He motions with his hand. The Mongolian moves up behind Marion\nand lifts her roughly over the top of the bar, knocking over\nbottles and spilling liquor. He deposits her on the other\nside, where the Nepalese and the Second Nazi flank her and\nhold her cruelly, arms behind her back. Marion raises a\nruckus.\nBelzig turns from the fireplace. In his hand is the poker,\nits end glowing orange. He advances on Marion. Marion stops\nyelling, her eyes widen in terror."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Wait! I can be reasonable -"
  },
  {
   "type": "speech",
   "character": "BELZIG",
   "text": "That time is passed."
  },
  {
   "type": "stage direction",
   "text": "The glowing poker point moves inexorably across the room\ntoward Marion's face."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "You don't need that. I'll tell you\neverything!"
  },
  {
   "type": "speech",
   "character": "BELZIG",
   "text": "Yes, I know you will."
  },
  {
   "type": "stage direction",
   "text": "Belzig has no intention of stopping now. The glowing tip is\napproaching Marion's face. The Nepalese watches with savage\nglee.\nThe tip of the poker is five inches from Marion's nose when\nthere is a loud CRACK! and the fall of Indy's bullwhip wraps\naround the middle of the poker and tears it out of Belzig's\nhands. The poker sails high across the room, free of the\nwhip, and lands in the heavy curtains that cover one window.\nThe curtains immediately burst into flame.\nThe four Bad Men look in surprise toward the front entrance.\nIndy is poised there, the whip in his right hand, a .45\nautomatic raised toward them in his left."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Hello."
  },
  {
   "type": "stage direction",
   "text": "Now everything begins to happen very fast -\nThe Mongolian had just come around the bar at the end opposite\nthe medallion. He dives back to crouch behind the end of the\nbar, raising his submachine gun.\nBelzig and the Second German dive behind tables near the\nbar. The Nepalese is slower to leave Marion, he draws a Luger.\nIndy's .45 barks and the Nepalese dies spinning against the\nbar. Indy fires in the direction of the Mongolian.\nMarion swings up over the top of her bar. Belzig fires at\nher, but his bullets smash bottles behind the bar and thud\ninto the raven.\nMarion flattens out on the floor behind the bar as bullets\nhit above her. She reaches up, snatches the axe handle from\nwhere Mahdlo left it, and begins crawling down the length of\nthe bar toward -\nThe Mongolian, who sticks his submachine gun out and fires\nblindly in Indy's direction.\nIndy is in a crouch behind a table, trying to get a shot at\nsomeone. He doesn't notice in the din and confusion when the\ndoor bursts open. An incredible, fearsome GIANT SHERPA, almost\nseven feet tall, soars in and tackles Indy from behind. The\nwhip flies from Indy's hand as he and the Giant Sherpa roll\nacross the floor, upsetting furniture.\nThe Mongolian, seeing this, stands up confidently. Marion\nrises behind him and bashes him over the head with the axe\nhandle. He goes down and out.\nFire has completely engulfed the curtains and is working\nacross the ceiling on decorative yak skin bunting. A burning\nfragment drops to the top of the bar, which immediately lights\nup, fueled by the spilled alcohol. Full whiskey bottles\nexplode like Molotov cocktails.\nRolling on the floor, Indy and the Giant Sherpa are fighting\nfor control of Indy's .45. Belzig sees this and shouts to\nthe Second Nazi, who is rising from cover with submachine\ngun in hand."
  },
  {
   "type": "speech",
   "character": "BELZIG",
   "text": "Shoot them both!"
  },
  {
   "type": "speech",
   "character": "SECOND NAZI",
   "text": "He's our man!"
  },
  {
   "type": "speech",
   "character": "BELZIG",
   "text": "Do as I say!"
  },
  {
   "type": "stage direction",
   "text": "Both the Giant Sherpa and Indy hear this. The Giant Sherpa\nexchanges an alarmed look with Indy and together they swing\nthe .45 around toward the surprised Second Nazi. Two blasts\nblow him away.\nThat done, Indy brings a brass spittoon down on the Giant\nSherpa's wrist and the .45 slides away. Indy jumps up and\nkicks the Giant Sherpa, who barely seems to feel it. He grabs\nIndy and flips him effortlessly onto a table.\nBelzig now has a clear shot at Indy. He raises his luger.\nMarion, at the end of the bar, finally gets the hand of the\nMongolian's submachine gun. It roars to life in the general\ndirection of the ceiling.\nBelzig runs for cover as Marion gets control of the gun and\nlevels it. Belzig dives around the end of the bar opposite\nMarion. When he has set himself, he peeks up over the edge\nof the scorched bar. The alcohol fire has moved down the bar\nand now, much to Belzig's surprise, he finds himself staring\nat the fire-blackened sun-shaped medallion!\nHis eyes widen. He cannot believe his good fortune. Without\nhesitation he picks up the metal medallion, palming it.\nImmediately there is a sickening searing sound and Belzig's\nexpression changes from joy to agony. He screams in pain and\ntries to shake the red-hot medallion from his skin. Marion\nopens up and the bar starts to splinter in front of Belzig.\nThe medallion comes free of Belzig's hand and rolls across\nthe floor.\nBelzig has had enough. In excruciating pain, he turns, sees\na window, runs and dives through the glass.\nAn exhausted Indy uses his whole body to upend the Giant\nSherpa, who lands hard on his back. They are surrounded by\nflames."
  },
  {
   "type": "location",
   "text": "EXT. \"THE RAVEN\" - SNOW BANK - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Belzig has his burned hand stuck deep in the snow. Now he\nwithdraws it, steaming, and scurries off into the night like\na wounded animal."
  },
  {
   "type": "location",
   "text": "INT. \"THE RAVEN\" - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Marion throws down the empty submachine gun and moves through\nthe flames to the center of the bar where she left the box\nwith the five grand. She finds the remains of the box and\nits contents: a shapeless pile of ash and charred wood."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Unbelievable!"
  },
  {
   "type": "stage direction",
   "text": "At the end of the bar, the Mongolian has come back to life.\nHe shakes out his head, then reaches inside his coat and\npulls out a Mauser pistol.\nIndy smashes a chair over the head of the Giant Sherpa and\nthe huge creature goes down.\nThe Mongolian points his Mauser through the smoke and flame\nat Indy. Suddenly, the Mongolian is shot dead.\nMarion stands beneath her stuffed raven with the Baretta.\nIndy moves quickly through the flames, his eyes scanning the\nfloor. He picks up his bullwhip and his crumpled felt hat.\nHe peers through the smoke till he spots Marion moving among\nthe burning furniture."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Let's get out of here!"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Not without that piece you want!"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "It's here?"
  },
  {
   "type": "stage direction",
   "text": "Marion nods, kicks aside a burning chair. Another burning\nbeam falls from the roof. Indy pulls Marion close to him\nprotectively."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Forget it! I want you out of here.\nNow!"
  },
  {
   "type": "stage direction",
   "text": "He begins dragging her out."
  },
  {
   "type": "stage direction",
   "text": "(pointing)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "There!"
  },
  {
   "type": "stage direction",
   "text": "She breaks away from him, darts back and picks the hot\nmedallion up in the loose cloth of her blouse."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Let's go!"
  },
  {
   "type": "stage direction",
   "text": "(looking around)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "You burned down my place!"
  },
  {
   "type": "stage direction",
   "text": "(figuratively)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I owe you plenty!"
  },
  {
   "type": "stage direction",
   "text": "(literally)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "You owe me plenty!"
  },
  {
   "type": "stage direction",
   "text": "(smiles)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "You're something!"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "I am something. And I'll tell you\nexactly what -"
  },
  {
   "type": "stage direction",
   "text": "She holds up the medallion possessively."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "I'm your partner!"
  },
  {
   "type": "location",
   "text": "EXT. CAIRO - VARIOUS SHOTS - DAY"
  },
  {
   "type": "stage direction",
   "text": "First we see the sprawl, the soaring minarets, the ancient\nskyline. Then we're closer, in the narrow, exotic streets,\nteeming with life: fierce-looking men in tattered galabiyas,\nblack-gowned women with veiled faces, ragged, barefoot\nchildren."
  },
  {
   "type": "location",
   "text": "INT. DINING ROOM - SALLAH'S HOUSE (OLD CAIRO)"
  },
  {
   "type": "stage direction",
   "text": "Indy and Marion have been welcomed like family into the\ncrowded home of SALLAH, his wife FAYAH, and their NINE\nCHILDREN (ages 4 - 18). Fayah, a huge, imposing woman,\nappears, at first glance, to be the power in the house.\nSallah, a small, cheerful, energetic fellow in his forties\ndefers to his wife in all matters of little importance.\nSuddenly the general liveliness at the children's table\nescalates into pandemonium, attracting the attention of the\nadults."
  },
  {
   "type": "speech",
   "character": "FAYAH",
   "text": "Silence!"
  },
  {
   "type": "stage direction",
   "text": "(there is silence)"
  },
  {
   "type": "speech",
   "character": "FAYAH",
   "text": "Why do you forget yourselves?"
  },
  {
   "type": "stage direction",
   "text": "The gaggle of grinning off-spring parts to reveal in their\nmidst - a MONKEY. It is munching some flat Arab bread."
  },
  {
   "type": "speech",
   "character": "FAYAH",
   "text": "What is this? Who brought this animal\nin?"
  },
  {
   "type": "stage direction",
   "text": "All the children chatter their innocence at once. The Monkey\nchatters too; it's an entertainer. The Monkey jumps from the\nchildren's table to the adults' and struts slowly up toward\nMarion, who thinks it's the cutest thing she ever saw. When\nit reaches her, it takes off its turban and does a deep,\ngrand bow to her. She is delighted and takes the Monkey into\nher arms. The Monkey kisses her cheek. The children laugh."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Why, thank you. I like you too."
  },
  {
   "type": "speech",
   "character": "FAYAH",
   "text": "Then it shall be welcome in our house."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Oh, no! You don't have to have it\naround if you don't want it -"
  },
  {
   "type": "stage direction",
   "text": "(cheerfully)"
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "All of Allah's creatures are welcome\nhere. You please us by letting us\nplease you."
  },
  {
   "type": "location",
   "text": "EXT. COURTYARD - SALLAH'S HOUSE - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Indy and Sallah sit in the small, protected courtyard. Sallah\nholds the two sections of the headpiece, the medallion and\nthe base, and has for the first time fitted them together.\nThey fit perfectly and complete the headpiece. He peruses\nthe markings on the headpiece quizzically. Indy is cleaning\nand loading a .45 automatic."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I knew the Germans would hire you,\nSallah. They couldn't have an\nexcavation in the desert without the\nbest digger in Egypt."
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "All Arabs look alike to them, Indy."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Tell me about the map room at Tanis."
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "We found it three days ago. I broke\nthrough myself."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Those Nazis are moving awfully fast."
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "The Frenchman is helping them."
  },
  {
   "type": "stage direction",
   "text": "Indy reacts."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Belloq. So he got away from the\nIndians. This is going to be more\ninteresting that I thought."
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "I'm afraid this has put the Germans\nclose to finding the Well of the\nSouls."
  },
  {
   "type": "stage direction",
   "text": "(indicates the\nheadpiece)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Even Belloq won't be able to find it\nwithout that. Can you make anything\nof those markings? They're nothing\nI'm familiar with."
  },
  {
   "type": "stage direction",
   "text": "(shakes his head \"no\")"
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "But I know someone who might. You\ncan go to see him tomorrow."
  },
  {
   "type": "stage direction",
   "text": "(a worried expression)"
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "Indy... something bothers me."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "What is it, my friend?"
  },
  {
   "type": "stage direction",
   "text": "Sallah finds it hard to say. When he finally speaks, his\nwords are accompanied by a strange, eerie, foreboding rush\nof wind through the courtyard. Just a coincidence we might\nsuppose."
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "It is the Ark. If it is there, at\nTanis... It is not something man was\nmeant to disturb... Death has always\nsurrounded it. It is not of this\nearth."
  },
  {
   "type": "stage direction",
   "text": "The wind dies down. Indy shakes off a chill and stares\nthoughtfully at his friend."
  },
  {
   "type": "location",
   "text": "EXT. HEAVILY TRAFFICKED CAIRO STREET - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy and Marion are briskly walking along one of Cairo's\nbusy bazaar streets. Vendors with fine cloth, pottery,\nbaskets, jewelry, etc line the street. Marion has the Monkey\nfrom Sallah's house on her shoulder."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Do you really need that monkey?"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "I'm surprised at you, Indy. Talking\nthat way about our baby. He's got\nyour looks, too."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "And your brains."
  },
  {
   "type": "stage direction",
   "text": "As Indy and Marion turn a corner, the Monkey seems to notice\nsomething and immediately jumps from Marion's shoulder and\nhurries off at a frantic pace down the street."
  },
  {
   "type": "stage direction",
   "text": "(looking disappointed)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Hey! Hey!... where're you going?"
  },
  {
   "type": "stage direction",
   "text": "(dragging Marion on)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "He'll be OK. Come on. Come on."
  },
  {
   "type": "location",
   "text": "EXT. ANOTHER CAIRO STREET - DAY"
  },
  {
   "type": "stage direction",
   "text": "The Monkey is seen running around another corner and jumps\ninto the waiting arms of MONKEY MAN, who appears to be like\na beggar with a dirty turban and an eye patch. Monkey Man\nimmediately hurries down the street and passes into a\nbuilding. In the building are two GERMAN AGENTS. Monkey Man\nand the Monkey both give the Heil Hitler salute and engage\nin quick talk.\nMonkey Man quickly leaves the two German Agents and gets\nback to the street. He is obviously shadowing Indy and Marion.\nIndy and Marion are just now passing by the Monkey Man ducks\nback behind some baskets."
  },
  {
   "type": "location",
   "text": "EXT. ANOTHER BUSY CAIRO STREET - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy and Marion are passing under a balcony where a lone\nGERMAN AGENT stands watch. After they pass, the Agent nods\nto some BAD ARABS who are hiding in the shadows of the street.\nIn a moment, Indy and Marion pass by the break. Monkey Man\nturns and looks up at a roof further down the alley. He waves\nwith his hand. Someone up there waves back."
  },
  {
   "type": "location",
   "text": "EXT. A SMALL BAZAAR - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy and Marion have reached a tiny square, made even more\ncramped by its use as a small bazaar. They have started\nworking their way through the crowd when several Bad Arabs\nand a German Agent begin to converge on them. Indy immediately\nsees what's happening and pulls the bull whip from his jacket.\nThe first Bad Arab to reach them gets hit in the mouth by\nthe handle of the whip. Now all hell breaks loose, with Bad\nArabs, Innocent Shoppers, baskets of fruit and tables of\ngoods flying every which way in the constricted space."
  },
  {
   "type": "stage direction",
   "text": "(to Marion)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Run! Get out of here!"
  },
  {
   "type": "stage direction",
   "text": "Indy catches a dagger-wielding Bad Arab around the legs with\nthe whip and flips him. Marion is reluctant to leave Indy."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Go, dammit! Go!"
  },
  {
   "type": "stage direction",
   "text": "Marion goes. She runs off between two buildings. A Bad Arab\ntakes off after her. Monkey Man, now standing at the edge of\nthe square, points at Marion. The Monkey jumps off his\nshoulder and follows Marion."
  },
  {
   "type": "location",
   "text": "EXT. BETWEEN THE BUILDINGS - DAY"
  },
  {
   "type": "stage direction",
   "text": "Marion runs along the narrow space and soon encounters a\nfive foot wall. She flops over it. The Bad Arab is right on\nher heels. He reaches the wall and vaults over. On the other\nside of the wall, the Bad Arab lands in a crouch, looks ahead\nand doesn't see Marion. Immediately a heavy earthen pot\nsmashes over his head, putting him out. Marion steps from an\nalcove and starts to run toward the street at the other end\nof the walkway. Suddenly another Bad Arab and a new German\nAgent appear in the street at that end. Before they can spot\nher, Marion retreats to the alcove again. There is a huge\nrattan basket sitting there. Marion climbs in and closes the\ntop above her.\nThe only witness: The Monkey, who is now perched on the fire\nfoot wall."
  },
  {
   "type": "location",
   "text": "EXT. THE SMALL BAZAAR - DAY"
  },
  {
   "type": "stage direction",
   "text": "Chaos. An entire booth of pots and pans collapses on a Bad\nArab and a German Agent as Indy whips away a support."
  },
  {
   "type": "location",
   "text": "EXT. BETWEEN THE BUILDINGS - DAY"
  },
  {
   "type": "stage direction",
   "text": "The chattering Monkey leads a German Agent and two Bad Arabs\nto Marion's hiding place, gesturing maniacally."
  },
  {
   "type": "location",
   "text": "EXT. THE SMALL BAZAAR - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy ducks under the swinging blade of a huge Arabian sword\nand kicks the Bad Arab Swordsman in the groin."
  },
  {
   "type": "location",
   "text": "EXT. SIDE STREET - DAY"
  },
  {
   "type": "stage direction",
   "text": "The German Agent leads the way as the two Bad Arabs carry\nthe huge basket above their heads. The basket top has been\nfastened closed, but Marion is making a fuss inside. At the\nplace where the street cuts across the far side of the bazaar,\nMarion is able to wedge the top open one inch and screams -"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Indy-y-y-y!"
  },
  {
   "type": "location",
   "text": "EXT. THE SMALL BAZAAR - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy has heard her. He looks across the square as the basket\nand its escorts disappear beyond a building. One last Bad\nArab rises before him. Indy's whip flashes and the Bad Arab's\nrobe falls down to his ankles. Indy frantically pushes his\nway through the panicked mass of humanity in the direction\nthe basket has gone."
  },
  {
   "type": "location",
   "text": "EXT. THE FOOT CHASE - INTERCUTTING INDY AND THE MOVING"
  },
  {
   "type": "stage direction",
   "text": "BASKET - DAY\nThe Bad Guys move the basket as fast as they can through\nstreets, alleys and passageways thick with people. Indy always\nseems to round a corner just in time to catch a glimpse of\nthe basket before it disappears around a new corner. Indy\nmust fight a flow of humanity as powerful as an ocean riptide.\nFinally, at the head of one particularly crowded alley, Indy\nleaps up onto a wall for a clearer view. Whatever he sees\ngives him an idea and he cuts between two buildings rather\nthan following the basket."
  },
  {
   "type": "location",
   "text": "EXT. DESERTED ALLEY - DAY"
  },
  {
   "type": "stage direction",
   "text": "Two Bad Arabs come running down the Alley with the basket\nbetween them. Suddenly, Indy's whip flashes out sending both\nArabs and the basket tumbling. Indy steps into view, his .45\ntrained on the sprawled Arabs, and looks at the basket. The\ntop has come flying off and the contents have clattered onto\nthe cobblestone: inside is not Marion, but a load of\ncontraband pistols, rifles and ammo. Indy is advancing on\nthe trembling Bad Arabs with an ugly look when suddenly he\nhears Marion scream around the corner."
  },
  {
   "type": "location",
   "text": "EXT. DESERTED SQUARE - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy rounds the corner and is immediately driven back by\nmachine gun fire. Taking cover, he gets quick, intermittent\nglimpses of this scene: At the far corner of the large,\ndeserted square is a canvas-covered truck. Two Bad Arabs are\nhurrying toward is with a large rattan basket between them,\nMarion screaming inside. A German Agent is covering their\nretreat with a machine gun from the cab of the truck. Indy\nruns up to see the rattan basket being heaved into the back\nof the truck."
  },
  {
   "type": "location",
   "text": "EXT. BACK OF THE TRUCK - DAY"
  },
  {
   "type": "stage direction",
   "text": "What Indy cannot see is that the basket lands among an ominous\nload of German munitions, dynamite and firearms. The truck\nimmediately peels out."
  },
  {
   "type": "location",
   "text": "EXT. DESERTED SQUARE - DAY"
  },
  {
   "type": "stage direction",
   "text": "The German Agent has stopped firing in order to drive. He\nfloors it, aiming for a street at the corner of the square.\nIndy uses the lull to take careful aim at the German Agent's\nprofile and fire off three careful shots. The German Agent\nis hit, blasted dead against the steering wheel. The speeding\ntruck swerves, hits a wall, rolls over and explodes in an\nenormous, multi-leveled eruption as its contents ignite.\nSeveral surrounding buildings are leveled.\nIndy, blown back across the square, looks on, astounded and\nhorror-stricken."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Marion."
  },
  {
   "type": "location",
   "text": "INT. ARAB BAR - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "A dark, smoke-filled den on iniquity. The patrons, almost\nall fearsome Arabs, sit in small shadowy groups around the\nroom. Indy stands at the bar finishing off a fifth of bourbon.\nHe is drunk. The ARAB BARTENDER places a new bottle of\nexpensive bourbon in front of him. Indy eyes is queerly."
  },
  {
   "type": "speech",
   "character": "ARAB BARTENDER",
   "text": "The gentleman in the corner sent it.\nHe would like you to join him."
  },
  {
   "type": "stage direction",
   "text": "(doesn't even look)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Too bad. I'm drinking alone."
  },
  {
   "type": "stage direction",
   "text": "The Arab Bartender does a take, looking at the three, tough\nGERMAN HENCHMEN who have surrounded Indy from out of the\nsmoke, their hands stuffed in bulging trenchcoat pockets.\nIndy notices them now with a bleary glance. He decides he's\nin no shape to kill or be killed and moves with them across\nthe room, taking his bottle with him. The Arab patrons take\nthis in and mind their own business.\nThe occupant of the smoke-shrouded corner table becomes\nvisible only as Indy reaches there: it is Emile Belloq. He\nis drinking wine."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Belloq."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "Good evening, Dr. Jones."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I ought to kill you right now."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "It was not I who brought the girl\ninto this dirty business."
  },
  {
   "type": "stage direction",
   "text": "Indy knows its true; that's what's tearing him up."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "Sit down, please, before you fall\ndown. We can behave as civilized\npeople. I'm afraid it will be your\nlast opportunity."
  },
  {
   "type": "stage direction",
   "text": "Indy sits, glancing at the German Henchmen, who settle nearby,\njust out of earshot."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Not a very private place for a murder."
  },
  {
   "type": "stage direction",
   "text": "(looking around)"
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "These Arabs will not interfere in\nthe white man's business. They do\nnot care if we kill each other off."
  },
  {
   "type": "stage direction",
   "text": "(takes a sip of wine,\nrefers to it)"
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "Terribly difficult finding a decent\nvintage here. You were quite vigorous\nin Shanghai. Unfortunately, our friend\nthe Wild Boar had taken the precaution\nof making several copies of the piece."
  },
  {
   "type": "stage direction",
   "text": "Indy registers this as he takes a drink. Belloq watches him\nwith disdainful amusement."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "How odd that is should end this way\nfor us, after so many... stimulating\nencounters. I almost regret it. Where\nshall I find a new adversary so close\nto my own level?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Try the local sewer."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "I know you despise me. We always\nhate in others that which we most\nfear in ourselves. And you and I are\nvery much alike."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Now you're getting nasty."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "We have always done the same kind of\nwork. Our methods have not differed\nas much as you pretend. I am a shadowy\nreflection of you. But it would have\ntaken only a nudge to make you the\nsame as me, to push you out of the\nlight."
  },
  {
   "type": "stage direction",
   "text": "There's a certain amount of truth to this; the recognition\nof it flickers across Indy's bleary eyes. Belloq sees it\nthere."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "You know it to be true! How nice.\nAnd how ironic the timing."
  },
  {
   "type": "stage direction",
   "text": "Belloq leans forward, eyes shining, voice suddenly different."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "Do you realize what the Ark is?"
  },
  {
   "type": "stage direction",
   "text": "(very intense)"
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "It's a transmitter. A radio for\ntalking to God! And now it is within\nmy grasp."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "What about your boss, der Fuhrer? I\nthought he was waiting to take\npossession."
  },
  {
   "type": "stage direction",
   "text": "Belloq glances into the gloom at the German Henchmen."
  },
  {
   "type": "stage direction",
   "text": "(quieter)"
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "When the time is right. When I am\nfinished with it."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I hope your friends are patient.\nDangerous work, Belloq."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "Yes. Very. You may consider yourself\nfortunate that your involvement\nconcludes here."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Tell me, did you get away with the\nidol?"
  },
  {
   "type": "stage direction",
   "text": "(negative)"
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "I was lucky to get away with my life.\nThe Hovitos proved quite narrow-minded\nabout the whole matter."
  },
  {
   "type": "stage direction",
   "text": "Indy takes a drink."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "You know, if it's God you want to\ntalk to, maybe I can arrange it."
  },
  {
   "type": "stage direction",
   "text": "(smiles)"
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "You have not changed. But, please,\ndo not reach for your weapon until\nyou are ready to die."
  },
  {
   "type": "stage direction",
   "text": "The front door of the bar slams open and all nine of SALLAH'S\nCHILDREN scamper in and over to a surprised Indy. Two of the\nsmallest hop into his lap."
  },
  {
   "type": "speech",
   "character": "LITTLE SON",
   "text": "Uncle Indy, we have been looking for\nyou."
  },
  {
   "type": "speech",
   "character": "LITTLE DAUGHTER",
   "text": "Come home now, Uncle. Hurry!"
  },
  {
   "type": "stage direction",
   "text": "Suddenly the Arab patrons of the bar take an intense interest\nin the situation, shifting their weapons."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Yes. Yes, I'll come now."
  },
  {
   "type": "stage direction",
   "text": "Indy stands up. The German Henchmen and poised. Belloq eyes\nthe Arab patrons and signals for the Henchmen to relax."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "Next time, Indiana Jones, it will\ntake more than children to save you."
  },
  {
   "type": "stage direction",
   "text": "The children usher Indy out."
  },
  {
   "type": "location",
   "text": "INT. SALLAH'S TRUCK - IN FRONT OF ARAB BAR - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Indy climbs into the cab of Sallah's truck with a smiling\nSallah as the children pile into the back. Sallah pulls out."
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "I thought we would find you there."
  },
  {
   "type": "stage direction",
   "text": "(indicating the kids)"
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "Better than the United States Marines,\neh?"
  },
  {
   "type": "stage direction",
   "text": "(nods)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Thanks you."
  },
  {
   "type": "stage direction",
   "text": "(grave)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Marion's dead."
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "Yes, I know. I am sorry."
  },
  {
   "type": "stage direction",
   "text": "(pause)"
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "More reason than ever to beat the\nbastards."
  },
  {
   "type": "stage direction",
   "text": "(he touches Indy)"
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "Life goes on, Indy."
  },
  {
   "type": "stage direction",
   "text": "(indicates the kids\nagain)"
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "There is the proof."
  },
  {
   "type": "stage direction",
   "text": "Indy looks back there, nods."
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "I have much to tell you, Indy."
  },
  {
   "type": "location",
   "text": "INT. SALLAH'S HOUSE"
  },
  {
   "type": "stage direction",
   "text": "Fayah brings in a tray of food and puts it on the table. The\nbowl of dates is in one corner. As Fayah leaves the room,\nthe Monkey slips out of Sallah's lap and disappears under\nthe table. Indy leans over the food tray, his hand hovering\nover the dates. But he chooses some cheese and bread instead."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "And they made the calculation in the\nmap room?"
  },
  {
   "type": "stage direction",
   "text": "(nods vigorously)"
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "This morning. Belloq and the boss\nGerman, Shliemann. When they came\nout of the map room, we were given a\nnew spot in which to dig... out away\nfrom the camp."
  },
  {
   "type": "stage direction",
   "text": "(resigned)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "The Well of the Souls."
  },
  {
   "type": "stage direction",
   "text": "Sallah nods, moves to the food. He picks up a date, then\nchanges his mind and drops it, taking a bunch of grapes\ninstead. Indy picks up a chicken leg in one hand and a date\nin the other, his mind distracted. Fayah enters the room\njust in time to see Indy flip the date high into the air and\ntry to catch it in his mouth. It bounces off his chin and\nfalls to the floor. Indy looks sheepishly at Fayah. Fayah\npicks up the fallen date and puts it in the dirty ash tray\nshe is now removing. Amir speaks in a slow, raspy voice\nwithout looking up."
  },
  {
   "type": "speech",
   "character": "AMIR",
   "text": "Come. Look."
  },
  {
   "type": "stage direction",
   "text": "The two men go and huddle over the old man. The Monkey peeks\nup over the edge of the table at the array of food. He picks\nup a date and disappears below the table. Amir points to\nsome markings on the lower part of the headpiece."
  },
  {
   "type": "speech",
   "character": "AMIR",
   "text": "This is a warning... not to disturb\nthe Ark of the Covenant."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Just want I need."
  },
  {
   "type": "stage direction",
   "text": "The Monkey's paw comes up over the edge of the table and\ngrabs another date."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "How 'bout the height of the staff?\nDid Belloq get it off of there?"
  },
  {
   "type": "speech",
   "character": "AMIR",
   "text": "Yes... it is here."
  },
  {
   "type": "stage direction",
   "text": "Indy, nervous, goes back to the food tray, picks up another\ndate. When he turns back to the men, the Monkey's paw grabs\nanother date.\nWe see the headpiece in closeup on the table. Amir's crooked\nfingers trace a line of markings along the bottom section to\nthe break in the piece."
  },
  {
   "type": "speech",
   "character": "AMIR",
   "text": "It says it is... ten jamirs high..."
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "About seventy-five inches."
  },
  {
   "type": "speech",
   "character": "AMIR",
   "text": "Wait! I am not finished..."
  },
  {
   "type": "stage direction",
   "text": "Amir's finger moves across the break as the markings continue\non the sun medallion."
  },
  {
   "type": "stage direction",
   "text": "(reading)"
  },
  {
   "type": "speech",
   "character": "AMIR",
   "text": "\"And one jamir to honor the Hebrew\nGod whose Ark this is.\""
  },
  {
   "type": "stage direction",
   "text": "Indy, still holding the date, exchanges a long look with\nSallah."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "You said their top section was blank.\nAre you absolutely sure?"
  },
  {
   "type": "stage direction",
   "text": "Sallah nods."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Belloq's staff is seven and a half\ninches short. They're digging in the\nwrong spot!"
  },
  {
   "type": "stage direction",
   "text": "Sallah and Indy begin to laugh. Amir gives them a glance and\nreturns to his wine. Sallah leans over and kisses the old\nman."
  },
  {
   "type": "stage direction",
   "text": "(to Amir)"
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "A home run, my friend, grand slam!"
  },
  {
   "type": "stage direction",
   "text": "(to Indy)"
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "We have a saying - \"A little luck is\nbetter than much smartness.\" Indy,\npardner, you are very lucky fellow."
  },
  {
   "type": "stage direction",
   "text": "Indy hoots. Then he takes the data in his hand and flips it\nhigh in the air. He opens his mouth to catch it, but it\ndoesn't come down. He has inadvertently thrown it into a\nbowl of a hanging lamp. This makes the men laugh even harder.\nIndy goes over and picks up another date. He turns laughing\nto Sallah and doesn't see as the Monkey's paw comes up,\nslowly, takes another date and begins to withdraw. Suddenly\nthe paw is stricken with palsy and the unseen Monkey goes\ninto its death throws. Sallah watches the paw as though\nhypnotized. Finally the paw slips from sight and we hear a\nsolid THUMP! on the floor. Sallah walks around the table and\nlooks at the floor. The Monkey lies dead among a mess of\ndate pits.\nIndy is in a happy world of his own. He throws his date high\nin the air. He positions himself under it and waits for it\nto drop in. Here it comes. Right on target. As it's about to\ndisappear into Indy's mouth, Sallah's hand flashes in and\ngrabs it. Indy looks mystified and disappointed. Sallah\nmotions toward the dead Monkey."
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "Bad dates."
  },
  {
   "type": "location",
   "text": "EXT. DESERT ROAD - MORNING"
  },
  {
   "type": "stage direction",
   "text": "Two old trucks come down a narrow mountain road and onto the\nflat surface of the desert.\nFurther out into the desert, the one in the lead, Sallah's\ntruck, stops and the second one, Omar's truck, pulls up beside\nit. There are half dozen Arab Diggers in Omar's truck. Indy,\ndressed as an Arab, gets out of the cab of Sallah's truck\nand moves over to confer with OMAR, another old friend. They\npoint off into the desert and reach some conclusion. Indy\ngives him a pat on the back; Omar turns off the road and\ndrives into the desert with his workers. Indy hops back in\nthe cab of Sallah's truck with Sallah. As they move down the\nroad we see that the back of the truck holds three other\nArab Diggers."
  },
  {
   "type": "location",
   "text": "EXT. RISE ABOVE THE TANIS DIGS - MORNING"
  },
  {
   "type": "stage direction",
   "text": "Indy and Sallah are lying in classic shouting fashion at the\ntop of the rise looking down on the Tanis Digs. Down behind\nthem, Sallah's truck is parked with the three Arab Diggers."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "My God! They aren't kidding!"
  },
  {
   "type": "stage direction",
   "text": "WHAT HE SEES\nThe Tanis Digs are laid out below like a painting. Trucks,\nbulldozers, Arab workers and German supervisors are\neverywhere. The excavations themselves are extensive and\nsomewhat random-holes have been dug and then abandoned,\nfoundations and passageways unearthed and then deserted.\nBeyond the main digs, a crude airstrip has been created.\nSallah points to what appears to be a mound of dirt with a\nhole in it near the center of the activity."
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "There! That is the map room!"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "What time does the sun hit the map?"
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "Just after eight."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "We haven't got much time. Where are\nthe Germans digging for the Well of\nthe Souls?"
  },
  {
   "type": "stage direction",
   "text": "Sallah points out into the desert a short way beyond the\nmain area of activity. The desert turns to sand dunes out\nthere, the surface undulating into the distance. Several\ntrucks and men are out there and a bulldozer is lumbering\nnoisily toward it."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Okay. Let's go."
  },
  {
   "type": "location",
   "text": "EXT. THE TANIS DIGS - MORNING"
  },
  {
   "type": "stage direction",
   "text": "Sallah's truck drives through the camp, one of the Arab\nDiggers at the wheel. Indy and Sallah are in the back and\nlook just like the other two Arab Diggers. Sallah's truck\ndoes behind a tent and when it appears on the other side,\nIndy and Sallah are gone."
  },
  {
   "type": "location",
   "text": "EXT. AMONG THE TENTS - MORNING"
  },
  {
   "type": "stage direction",
   "text": "Indy and Sallah move stealthily among the tents. Indy carries\na smooth wooden staff almost seven feet tall. They stop\nbetween two tents and look across a path at the entrance to\nthe map room. What appeared to be a mound of dirt is actually\nthe roof on the ancient building. The hole/entrance is a\nfive-foot square skylight. Indy looks around, then walks\ncasually to the edge of the hole and looks inside. Sallah\njoins him, producing a length of rope from his robes. Indy\ndrops the staff into the unseen map room as Sallah ties the\nrope around on oil drum. When it's secure, Indy wastes no\ntime disappearing down it into the map room."
  },
  {
   "type": "location",
   "text": "INT. MAP ROOM"
  },
  {
   "type": "stage direction",
   "text": "Indy is down the twenty feet to the floor of the room in\nseconds. He tugs on the rope and it immediately gets pulled\nup. Indy looks around with real wonder and excitement. The\nroom is lovely, with elaborate wall carvings and frescoes,\nall lit by the bright stream of sunlight flooding in from\nabove. This beam of light leads Indy's eye to the far end,\nand the room's truly remarkable feature: built into the floor\nin meticulous relief is a miniature stone model of the ancient\ncity of Tanis. Already, the sunlight has worked its way down\nthe far wall and is edging onto the miniature of the city.\nOn the floor, to the skylight side of the miniature, is an\nelaborate line created by embedded mosaic tiles. The evenly\nspaced slots in the line, each accompanied by a symbol of a\ntime of year, are for the base of the staff. Indy pulls the\nheadpiece from his robes - it has been welded together - and\nreaches for the staff."
  },
  {
   "type": "location",
   "text": "EXT. ABOVE THE MAP ROOM - DAY"
  },
  {
   "type": "stage direction",
   "text": "An extremely nervous Sallah has the gathered rope in his\nhands and is trying to appear casual as he inches back toward\nthe oil drum. There is now a good bit of activity going on\nup here."
  },
  {
   "type": "speech",
   "character": "JEEP GERMAN (O.S.)",
   "text": "Hey! You, the skinny one!"
  },
  {
   "type": "stage direction",
   "text": "Sallah jumps about three feet. The JEEP GERMAN is standing\nin an open space ten yards away looking at Sallah."
  },
  {
   "type": "speech",
   "character": "JEEP GERMAN",
   "text": "Yes, you. What are you doing there?"
  },
  {
   "type": "stage direction",
   "text": "Sallah gestures his innocence."
  },
  {
   "type": "speech",
   "character": "JEEP GERMAN",
   "text": "Well bring that rope over here, you\ncur."
  },
  {
   "type": "stage direction",
   "text": "The Jeep German starts back toward his major concern: his\njeep is stuck in some sand beyond the next tent. Some Arab\nWorkers are trying in vain to budge it. Now another German\nhas backed his truck up to it. Sallah can think of nothing\nto do expect obey. With a worried glance at the map room, be\nbegins untying the rope from the oil drum."
  },
  {
   "type": "location",
   "text": "INT. THE MAP ROOM"
  },
  {
   "type": "stage direction",
   "text": "Indy is examining the results of Belloq's work. Red paint\nmarks one of the miniature buildings in the layout and a\nwhite calibrated tape has been strung from that building\nback to a miniature of the map room. Now Indy begins examining\nthe mosaic base line for the staff. Sunlight has moves further\ndown across the miniature."
  },
  {
   "type": "location",
   "text": "EXT. IN THE CAMP - DAY"
  },
  {
   "type": "stage direction",
   "text": "Sallah watches nervously as his precious rope is pulled taut\nbetween the pulling truck and the stuck jeep. He doesn't\nnotice that he has chosen to stand next to a large, steaming\nkettle of food until -"
  },
  {
   "type": "speech",
   "character": "HUNGRY GERMAN (O.S.)",
   "text": "Bring us some of that!"
  },
  {
   "type": "stage direction",
   "text": "He points to the kettle. Sallah looks frantically from the\nrope, back to the skylight of the map room, to the kettle of\nfood."
  },
  {
   "type": "speech",
   "character": "HUNGRY GERMAN",
   "text": "Now, idiot!"
  },
  {
   "type": "stage direction",
   "text": "Sallah picks up some serving pieces and gets to work."
  },
  {
   "type": "location",
   "text": "INT. THE MAP ROOM"
  },
  {
   "type": "stage direction",
   "text": "The moment has arrived. Even the tension of the circumstances\ncannot distract Indy from the purity of what he is about to\ndo. All his calculations are adjustments complete, Indy takes\nthe Staff of Ra and places it - CLINK! - in the right\ndepression on the base line. This is as active and exciting\na moment as any archeologist can dream of and, at heart,\nthat is exactly what Indy is. The sunlight catches the very\ntop of the headpiece and moves within a fraction of an inch\nof the tiny hole in its sun.\nThe edge of the sunlight moving across the miniature city is\nstill a good two feet beyond the spot Belloq has settled on.\nAnd now that line of light is broken by the shadow of an\nornate sun at the top of the staff.\nIndy's face reflects his concentration. And then his immense\npleasure. He sees what he came for.\nOut of the miniature city, one small building is being lit\nby a tiny beam of sunlight in the center of the shadow of\nthe metal sun. And by some trick of ancient artistry, this\none building responds to the sunlight like none of the others.\nThe golden light permeates it: it seems to glow. The building\nis in a direct line with Belloq's - all the Frenchman's other\ncalculations were right - but it is a foot and a half beyond\nit."
  },
  {
   "type": "location",
   "text": "EXT. IN THE CAMP - DAY"
  },
  {
   "type": "stage direction",
   "text": "Sallah, sweating profusely, has finished serving the line of\nBreakfasting Germans and now heads back to replace the kettle\nand get away."
  },
  {
   "type": "speech",
   "character": "HUNGRY GERMAN",
   "text": "Water. Bring us water."
  },
  {
   "type": "location",
   "text": "INT. MAP ROOM"
  },
  {
   "type": "stage direction",
   "text": "Indy is on his knees at the miniature city, a special tape\nmeasure in his hand. Indy has the tape strung from Belloq's\nmistaken spot to his own correct spot. He gets his reading,\nleaps up and crosses to the erect staff. He pulls the\nheadpiece off the staff and hides it in his robes. He quickly\nbreaks the wooden staff in two and throws the pieces behind\na pile of debris. Then he moves quickly to beneath the\nskylight."
  },
  {
   "type": "stage direction",
   "text": "(stage whisper)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Sallah."
  },
  {
   "type": "stage direction",
   "text": "(he waits, then louder)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Sallah!"
  },
  {
   "type": "stage direction",
   "text": "More waiting. Nothing. Indy looks around for some alternative\nmeans of escape. The room doesn't offer any. He looks up at\nthe skylight again."
  },
  {
   "type": "stage direction",
   "text": "(loudest)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Sallah!"
  },
  {
   "type": "stage direction",
   "text": "A long pause. Then something comes down. A makeshift rope.\nReally just a bunch of clothing tied together - tunics, robes,\npants. But what we see first and most prominently, the first\nsection of Indy's escape rope, is a bright Nazi flag. Indy\nbeams and climbs."
  },
  {
   "type": "location",
   "text": "EXT. ABOVE THE MAP ROOM - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy sticks his head out the skylight, sees it clear and\nflops his body out. Sallah, crouching behind the oil drum,\nimmediately starts pulling in the makeshift rope. Sallah\nstuffs the rope in the oil drum and the two men begin waking\ntoward some tents."
  },
  {
   "type": "speech",
   "character": "HUNGRY GERMAN (O.S.)",
   "text": "Hey, you! More water over here!"
  },
  {
   "type": "stage direction",
   "text": "Sallah glances at Indy, Then hurries back in that direction.\nThe Hungry German focuses on Indy."
  },
  {
   "type": "speech",
   "character": "HUNGRY GERMAN",
   "text": "Why aren't you at the digs? Come\nhere!"
  },
  {
   "type": "stage direction",
   "text": "Indy bows in wild subservience and hurries off in the opposite\ndirection."
  },
  {
   "type": "stage direction",
   "text": "(yelling after him,\nirritated)"
  },
  {
   "type": "speech",
   "character": "HUNGRY GERMAN",
   "text": "No, dummkopf, I said come!"
  },
  {
   "type": "location",
   "text": "EXT. BETWEEN TWO TENTS - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy hustles between the tents. Up ahead, two German Officers\nstop to talk, blocking his exit. He moves along the side of\none of the tents until he finds an opening and slips inside."
  },
  {
   "type": "location",
   "text": "INT. THE TENT"
  },
  {
   "type": "stage direction",
   "text": "Indy finds himself in a tent set up for rather comfortable\nliving. He has just started to cross it when he hears a loud,\nexcited grunting. He turns toward the sound. In the corner,\ntied to a chair and gagged is Marion. Indy rushes to her,\nsnatches the gag from her mouth and embraces her. They kiss,\ndeep and long."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I though you were dead."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "They were throwing me around like a\nrag doll."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "They must have switched baskets.\nThank god for that! Bless those\nbastards. Have they hurt you?"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "No. Not since I got here. They just\nasked about you - what you knew. The\nFrenchman's got the hot's for me.\nI've been playing that along. Oh,\nIndy, get me out of here."
  },
  {
   "type": "stage direction",
   "text": "Indy pulls out a knife and then stops suddenly, thinking."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "What's wrong?"
  },
  {
   "type": "stage direction",
   "text": "(putting the knife\naway)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I have to leave you here for a little\nwhile. I know where the Ark is. If I\ntake you out of here they'll start\ncombing the place for us."
  },
  {
   "type": "stage direction",
   "text": "(louder)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Cut me loose!"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Keep your voice down."
  },
  {
   "type": "stage direction",
   "text": "(screaming)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "I said get me out of -"
  },
  {
   "type": "stage direction",
   "text": "Indy pops the gag back in her mouth. Her eyes widen in fury\nand she grunts obscenities at him."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Look, you don't know how glad I am\nto see you. And I don't like doing\nthis. But the whole thing will be\nshot if you don't just sit here\nquietly. They haven't hurt you in\nthe last twenty-four hours, they\naren't going to start now. I'll be\nback to get you in no time."
  },
  {
   "type": "stage direction",
   "text": "He kisses her forehead, jumps up and hurries out of the tent."
  },
  {
   "type": "location",
   "text": "EXT. SAND DUNE OUTSIDE DIGS - DAY"
  },
  {
   "type": "stage direction",
   "text": "With the digs behind them, Indy and Sallah run up to the\nridge of the dune and over the top. At the bottom of the far\nside, Omar's truck is parked. Omar and his men are waiting."
  },
  {
   "type": "location",
   "text": "EXT. DIFFERENT DUNE - DAY"
  },
  {
   "type": "stage direction",
   "text": "This new spot gives Indy a higher, better view of the whole\nscene. Indy is using a surveyor's instrument to take a reading -\nWHAT HE SEES\nLooking through the instrument, Indy gets a line from the\nmap room through the site where the Nazis are digging in the\ndunes to a spot several dunes over. We focus on that virgin\nspot of well-hidden sand as -"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "There!"
  },
  {
   "type": "location",
   "text": "EXT. INDY'S DIG - DAY"
  },
  {
   "type": "stage direction",
   "text": "Omar's truck is parked at the spot just viewed from afar.\nDunes rise on either side. One of Omar's men has been posted\nas a lookout up on a ridge. Everybody else - Indy, Sallah,\nOmar, and his men - have begun digging for the Wells of the\nSouls.\nDISSOLVE TO:\nSAME SCENE - NIGHT\nThey continue to dig furiously, all of them drenched in sweat.\nThe hole has grown but this is slow, back-breaking work."
  },
  {
   "type": "location",
   "text": "INT. COMMAND TENT - TANIS DIGS - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Belloq, SHLIEMANN the ranking Nazi, and Shliemann's Aide,\nGOBLER, come into the tent, which is full of charts and maps,\ndrawings of the Ark, radio equipment, liquor and food. The\nmen have been out digging for the Well all day. They are\ntired, discouraged, testy. In all matters, Gobler shows his\nalliance with Shliemann against Belloq with small looks and\nbody language. The Frenchman has disappointed them and he is\nfeeling the isolation of a scapegoat. Belloq gets himself a\ndrink as Shliemann towels off his face."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "I cautioned you about being premature\nwith that communiqué to Berlin.\nArcheology is not an exact science.\nIf does not adhere to time schedules."
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "The Fuhrer is not a patient man. He\ndemands constant reports and he\nexpects progress. You led me to\nbelieve -"
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "Nothing. I have made no promises. I\nsaid only that it looked very\nfavorable. Perhaps the Ark will still\nbe found in an adjoining chamber.\nBased on the information in our\npossession, my calculations were\ncorrect. Perhaps some bit of evidence\nstill eludes us. Perhaps"
  },
  {
   "type": "speech",
   "character": "GOBLER",
   "text": "Perhaps the girl can help us."
  },
  {
   "type": "stage direction",
   "text": "Belloq shoots him an angry look."
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "My feeling exactly. She was in\npossession of the original piece for\nyears. She may know much."
  },
  {
   "type": "stage direction",
   "text": "(really evil)"
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "If properly motivated..."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "I tell you, she knows nothing useful."
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "I'm surprised to find you squeamish.\nThat is not your reputation. But it\nneedn't concern you. I have the\nperfect man for this kind of work."
  },
  {
   "type": "stage direction",
   "text": "Shliemann signals Gobler, who steps outside the tent a moment,\ncalls someone and then reappears. Belloq looks warily at the\nentrance. After a moment Belzig enters, reeking villainy.\nWhen his eyes find Shliemann, his superior, he snaps a crisp\n\"Heil, Hitler!\" at him, holding his palm rigid a long time,\nexposing a burned scar in the prefect shape of the sun\nmedallion."
  },
  {
   "type": "location",
   "text": "EXT. INDY'S DIG - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "In the eerie conjunction of moonlight and torchlight, Indy\nand the other men step back in awe of their discovery: there,\nflush with the bottom of their pit, is a heavy stone entry\ndoor to an underground chamber. Special prying tools are\nproduced. With two men assigned to each of the two long tools,\nthey work in unison to open the vault. They open it a foot\nand the other men rush in to flop the heavy door completely\nopen. Down inside, only blackness.\nThe men quickly prostrate themselves around the edge of the\nentry to look inside. Indy and Sallah each take a torch and\nhold them down the hole.\nWHAT THEY SEE\nThe Well of the Souls is a spooky chamber thirty feet deep.\nThe walls are covered with hieroglyphics and carvings. The\nroof is supported intermittently by stone pillars, the closest\nof which hits the roof very near the entry hole. The Well is\nquite large; as Indy and Sallah wave their torches, more and\nmore of the room is revealed. Now the far end of the chamber\ncomes into view. There is a stone altar down there and on\nthis elaborated carved platform is a stone chest, big enough\nto enclose the Lost Ark and protect it from the ravages of\ntime. This altar appears to be the only place on the floor\nof the Well that is not covered by a strange, dark carpet of\nsome kind."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "The Ark must be in that stone case.\nWhat's that gray stuff all over the\nfloor -"
  },
  {
   "type": "stage direction",
   "text": "He breaks off realizing exactly what that carpet is. He\nblanches. Indiana Jones blanches.\nIndy drops his torch to the floor of the Well. This is\nanswered by the most horrific HISSING imaginable.\nWHAT HE SEES\nThat think dark carpet is moving. It's alive. It's thousands\nand thousands of deadly poisonous snakes - Egyptian asps.\nAnd the only thing that seems capable of avoiding this\nvenomous groundcover is the altar. The snakes ebb and flow\nnear it, but never encroach on it, as though repelled by\nsome invisible force.\nIndy shakes his head and talks to himself."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Why snakes? Why did it have to be\nsnakes? Anything else."
  },
  {
   "type": "stage direction",
   "text": "After a moment of this, he stops. He gathers his energy and\nresolve and gets back to the task."
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "Asps. Very dangerous."
  },
  {
   "type": "stage direction",
   "text": "Where Indy's torch had landed is a circle of snake-free floor.\nThe snakes hate the flame; they stay away."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Lots of torches. And oil. I want a\nlanding strip down there."
  },
  {
   "type": "location",
   "text": "INT. THE WELL OF THE SOULS"
  },
  {
   "type": "stage direction",
   "text": "Fifteen torches have been dropped to the floor of the chamber,\ncombining to make a good-sized clear zone. Smoke begins to\nfill the room. Several canisters of oil have been lowered\ninto this space. Now, a large wooden crate is lowered slowly\nby rope. Rope handles are attached to each end of the crate.\nUp at the hole, Indy gives Sallah a reassuring pat, takes a\nbreath, and swings carefully onto a rope hanging from the\nhole. Despite his care, he swings a bit and his feet hit the\nstone pillar which is so near the entry. Surprisingly, the\npillar actually moves a bit, showering a light rain of\ncrumbled stone to the floor below.\nIndy lands on the floor of the Well. He looks at the altar\nover a sea of undulating death. He picks up an oil canister\nand splashes two parallel lines of oil and lights them. A\npath six feet wide begins to open to the altar. Behind Indy,\nSallah comes quickly down the rope.\nWe begin to INTERCUT all the action in the Well from here on\nwith insert shots of the snakes outside the flames. Snakes\nand snakes. We see: snakes piled and entwined six inches\ndeep; mother snakes laying snake eggs; snake eggs hatching\nlittle snakes; snakes cannibalizing other snakes."
  },
  {
   "type": "location",
   "text": "INT. MARION'S TENT"
  },
  {
   "type": "stage direction",
   "text": "Belloq has been talking to the still-bound Marion. He has\nremoved her gag. He is impatient, angry, uncomfortable. Caught\nbetween two forces."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "Believe me, you made a mistake. If\nyou would just give me something to\nplacate them. Some bit of information."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "I swear to you, I know nothing more.\nI have no loyalty to Jones. He's\nbrought me only trouble."
  },
  {
   "type": "stage direction",
   "text": "He wants to believe her."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "I cannot control them."
  },
  {
   "type": "stage direction",
   "text": "Marion's frightened look shifts suddenly to the entrance of\nthe tent. There are new arrivals there - Shliemann, Gobler\nand Belzig. Belzig carries a black leather case. He steps\nforward and smiles at Marion."
  },
  {
   "type": "speech",
   "character": "BELZIG",
   "text": "We meet again, Fraulein."
  },
  {
   "type": "location",
   "text": "EXT. INDY'S DIG - JUST BEFORE DAWN"
  },
  {
   "type": "stage direction",
   "text": "The sky is just beginning to lighten over the dunes to the\neast, making dangerously obvious the thin column of smoke\nrising from the entrance to the Well. Omar and his men are\npeering through the smoke down into the Well."
  },
  {
   "type": "location",
   "text": "INT. THE WELL OF THE SOULS"
  },
  {
   "type": "stage direction",
   "text": "Indy and Sallah are on the altar. Pushing together with all\ntheir strength, the heavy stone top of the protective chest\nbegins to slide away. Indy and Sallah exchange slightly wary\nbut very excited looks, then continue to push. As the Ark\nbegins to be exposed, the air seems to almost vibrate, to\nbecome electrostatically charged. We hear what sounds like a\nlow HUM. The sea of snakes around the altar draws back further\nfrom this presence.\nAs the top of the stone chest is pushed completely off and\nslams down beside it, we see THE LOST ARK OF THE COVENANT.\nIt is awesomely beautiful, breathtaking. 4 feet long, 2.5\nfeet wide and 2.5 feet high. It's height, however, is\nincreased by the two sculptured gold angels mounted facing\neach other on the top. Though the body of the Ark is acacia\nwood, it has been overlaid with gold. An elaborate gold crown\nsurrounds the top edge and gold carrying rings are attached\nto each corner.\nSallah is mesmerized by the sight. His hand starts to reach\nout and touch one of the angels, but Indy grabs it."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Don't touch it! Never touch it!"
  },
  {
   "type": "stage direction",
   "text": "The wooden crate stands open next to the stone chest. Now\nIndy extracts the wooden poles from its rings and begins\nfitting them through the rings in the Ark. This takes some\nmaneuvering by the two men, but soon they are able to lift\nthe Ark clear of the stone chest and into the wooden crate.\nThey extract the poles, fasten the top of the crate and stick\nthe poles through the rings of the wooden crate. They start\nback toward the space under the hole.\nThe fire strips have begun to dwindle, as have some of the\ntorches. The snakes move slowly in toward the clear spaces.\nIndy and Sallah eye them nervously as they hurry along with\ntheir heavy load. Under the hole, they hurriedly attach ropes\nto the wooden crate and it is pulled up. Indy's concentration\nis on the tide of snakes."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Hurry up! Why did it have to be\nsnakes?"
  },
  {
   "type": "stage direction",
   "text": "Sallah takes the next rope and climbs quickly out of the\nWell. Indy has picked up a torch and now throws it at a pool\nof snakes who are too close for his comfort. He turns and\ntakes hold of the exit rope. He gives it a first tug and it\nfalls down into the Well, landing partly beyond the ring of\nfire where is instantly disappears in a tangle of angry,\nhissing asps. Indy looks up at the hole."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "What the -"
  },
  {
   "type": "stage direction",
   "text": "Smiling down at him from the perimeter of the entry are\nBelloq, Shliemann and Gobler."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "Why, Dr. Jones, whatever are you\ndoing in such a nasty place?"
  },
  {
   "type": "stage direction",
   "text": "Belloq and the Germans laugh."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Why don't you fellows come down here?\nI'll show you."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "No thank you, my friend."
  },
  {
   "type": "stage direction",
   "text": "(he glances around\nhim)"
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "I think we are all very comfortable\nup here."
  },
  {
   "type": "location",
   "text": "EXT. INDY'S DIG - DAWN"
  },
  {
   "type": "stage direction",
   "text": "Sunlight is flooding this tableau: Sallah, Omar and his men\nare being held at bay by ten armed Nazis. The wooden crate\nsits safely nearby. Belzig and another Nazi have the gagged\nMarion held in their rough grasp."
  },
  {
   "type": "stage direction",
   "text": "(down to Indy)"
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "After all these years, it is most\nconsiderate of you to aid me in this\nway."
  },
  {
   "type": "stage direction",
   "text": "As Belloq speaks, Shliemann exchanges a look with Belzig.\nBelzig smiles and takes the gag from Marion's mouth."
  },
  {
   "type": "location",
   "text": "INT. WELLS OF THE SOULS"
  },
  {
   "type": "stage direction",
   "text": "Shliemann smiles down at Indy."
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "I'm afraid we must be going now, Dr.\nJones. Our prize is awaited in Berlin.\nBut I do not wish to leave you down\nin that awful place..."
  },
  {
   "type": "stage direction",
   "text": "(he give a sign)"
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "...all alone."
  },
  {
   "type": "stage direction",
   "text": "Belzig and the Nazi move Marion to the hole and, to Belloq's\nsurprise, push her in. Marion falls thirty feet screaming.\nIndy drops his torch, braces, and catches her! Her weight\nknocks him to the ground, almost into the snakes. She looks\naround at the snakes, clinging to him more desperately as he\nstruggles to his feet trying to unload her."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Don't put me down!"
  },
  {
   "type": "stage direction",
   "text": "Up at the hole, there's plenty of dissension."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "The girl was mine!"
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "She is of no use to us. Only our\nmission for the Fuhrer matters."
  },
  {
   "type": "stage direction",
   "text": "Shliemann glances meaningfully around at the other Nazis."
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "I wonder sometimes, Monsieur, if you\nhave that clearly in mind."
  },
  {
   "type": "stage direction",
   "text": "Belloq feels how much he is the outsider, his own\nvulnerability. He backs down with the wisdom of survival. He\nturns to look down at Indy and Marion. His manner is gallant."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "Goodbye, mademoiselle."
  },
  {
   "type": "stage direction",
   "text": "(a pause, then with\nrespect)"
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "Indiana Jones... adieu!"
  },
  {
   "type": "stage direction",
   "text": "Belloq and the others step back from the hole and unseen\nNazis slam the heavy stone door into place. Marion screams.\nHer scream is accompanied by -\nA huge WHOOSH! as air is sucked out and the chamber is sealed.\nHalf of the torches still burning go out with the sound. The\nremaining torches continue to extinguish at punctuating\nintervals throughout the following action and the snakes\nimmediately flood into the newly-darkened spaces. Indy puts\nMarion down and snatches up two burning torches. He hands\none to Marion."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Don't panic. There's plenty of time\nfor that later. Wave that at anything\nthat slithers."
  },
  {
   "type": "stage direction",
   "text": "Indy holds his torch out like a lantern and begins a slow O-\nturn, his eyes peering into the gloom, examining every inch\nof wall and ceiling."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "What are you doing?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Just watch the floor."
  },
  {
   "type": "stage direction",
   "text": "Reminded of the encroaching snakes, Marion waves her torch\nat the nearest edge of their circle. She looks faint. Indy\ncontinues his slow turn."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Whatever you're doing, do it faster."
  },
  {
   "type": "stage direction",
   "text": "(he spots something)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "There!"
  },
  {
   "type": "stage direction",
   "text": "His head whips around, looking at the pillars around the\nroom. He sees what he wants. He grabs one of the oil\ncanisters, looks back to the spot on the wall he's chosen\nand splashes oil on the floor in that direction, then lights\nit. A path opens toward that wall."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Come on!"
  },
  {
   "type": "stage direction",
   "text": "Marion is frozen in her spot. Indy drags her after him. He\nsplashes oil the rest of the way to the wall. It lights and\nIndy pulls Marion over to the wall. He pours the remaining\noil in a circle around them, creating a safe zone there."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Stay here!"
  },
  {
   "type": "stage direction",
   "text": "(grabbing him)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Where are you going?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I'll be back in a minute. We're going\nthrough this wall."
  },
  {
   "type": "stage direction",
   "text": "Marion looks at the wall, which looks like all the rest to\nher. She thinks he's crazy."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Just keep your eyes open and get\nready to run. No matter what happens\nto me."
  },
  {
   "type": "stage direction",
   "text": "(panicked)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "What do you mean?"
  },
  {
   "type": "stage direction",
   "text": "Too late. Indy runs back through the path of flames to the\ncenter of the room. Snakes strike as his flying heels. Indy\nreaches the base of the pillar which he touched briefly on\nhis original descent. He uses his torch to clear away the\nscattered snakes climbing on it, then pulls out his whip. He\ndraws it back, then wraps is solidly around the pillar 15\nfeet up. With the torch in his mouth, he begins climbing the\npillar. It moves ominously under his weight.\nThe last two torches still burning on the floor go out. Now\nthe only light in the chamber is provided by the torches\nheld by Indy and Marion and the dwindling oil flames. Snakes\nmove in and surround the base of Indy's pillar. The path\nbetween Marion and the center of the room is overrun. The\ncircle of flame around Marion is dying down. She looks beyond\nit with terror-widened eyes, then up through the increasing\nsmoke at the distant Indy.\nNear the top of the pillar, Indy's hands strain along his\ntaut whip, which he has moves higher. A snake slithers into\nview there, inches from Indy's straining face. Indy turns\nhis head so the torch in his mouth can burn it. The snake\nfalls from the pillar. Indy's torch is dwindling. Indy works\nhis body around so that he is on the side of the pillar away\nfrom Marion. The pillar moves, showering dust. Indy looks at\nthe chamber wall five feet away, takes a breath and swings\nhis legs up against it. He is now braced between pillar and\nwall."
  },
  {
   "type": "stage direction",
   "text": "(screaming)"
  },
  {
   "type": "speech",
   "character": "MARION (O.S.)",
   "text": "Where are you?!"
  },
  {
   "type": "stage direction",
   "text": "Snakes are moving in force up the pillar toward Indy's\ndwindling torch. Indy grasps the pillar for dear life,\ngrimaces with exertion and pushes against the wall with all\nhe's got. The pillar begins to break loose of the ceiling,\nthen stops. Indy's eyes are on the torch. It is just a spot\nof flame now. Snakes are sliding up toward his hands. Indy\nagain pushes against the wall and the torch falls out of his\nmouth.\nThe pillar goes! In the dim light, we see it fall like a\ntree directly at Marion. Indy rides it down. The top hits\nthe wall three feet from a cringing Marion and smashes through\nto a black chamber beyond. Indy flies off into the darkness.\nGone. Marion clutches her torch at the black hole."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Indy! Where are you?! Please Lord!"
  },
  {
   "type": "stage direction",
   "text": "There is a moment that seems an eternity, then Indy appears\nlike an apparition out of the void."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Come on!"
  },
  {
   "type": "stage direction",
   "text": "He grabs her and helps her over the remains of the wall into -"
  },
  {
   "type": "location",
   "text": "INT. THE CATACOMBS"
  },
  {
   "type": "stage direction",
   "text": "The winding string of connected chambers is revealed to them\nonly a few feet at a time as their torch lights the way."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "The snakes... are they here?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I guess not. I think I'd be dead."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Do you know where you're going?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Absolutely."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Thank god. Where?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Out."
  },
  {
   "type": "stage direction",
   "text": "They round a corner and flush a covey of bats. Marion screams."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Don't do that. It scares me."
  },
  {
   "type": "stage direction",
   "text": "Marion gives him a look. They round a corner and begin a\nwalk through a maze of chambers that present for their\ninspection: moldering mummies and stacked sarcophagi; a room\ndecorated with a thousand human skulls; a wall crawling with\nhuge scarabaeid beetles. Marion is quite naturally a nervous\nwreck; she jumps when Indy grabs her suddenly and points."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Look!"
  },
  {
   "type": "stage direction",
   "text": "WHAT THEY SEE\nThere, coming through the crack in the corner of the next\nchamber, is white blessed sunlight."
  },
  {
   "type": "location",
   "text": "EXT. THE TANIS DIGS - NEAR AIRSTRIP - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy and Marion peek out into the light from the shadows of\nan abandoned excavation. Before them is the improvised\nairstrip serving the digs: a crude runway, a tent supply\ndepot, two fuel tank trucks. Down by the fuel trucks a German\nMechanic is looking skyward. Now Indy and Marion look there\ntoo, drawn by the roaring sound of -\nA Flying Wing, which is circling over the digs in preparation\nto landing.\nNow a new figure approaches the German Mechanic. It is Gobler;\nhe yells to the mechanic, indicating the plane."
  },
  {
   "type": "speech",
   "character": "GOBLER",
   "text": "Get is gassed immediately! It has an\nimportant cargo to take out!"
  },
  {
   "type": "stage direction",
   "text": "In the distance, the Flying Wing lands and rolls toward the\nmen. Gobler spins and heads back toward the main camp, which\nis hidden from view by a rise. Indy and Marion watch him go."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "When the Ark gets loaded, we're\nalready going to be on that plane."
  },
  {
   "type": "stage direction",
   "text": "The Flying Wing rolls up into the space near the fuel trucks.\nThe German Mechanic puts blue blocks in front of the tires\nas the engines continue to roar.\nIndy and Marion run in a crouch to a hiding spot closer to\nthe plane, near the supply tent. Suddenly, a Second German\nMechanic appears behind them. He is as surprised as they\nare, but recovers quickly and swings a big monkey wrench at\nIndy. Indy grabs the swinging arm and the two men tumble out\ninto the open, wrestling. Marion remains hidden, moving fast\namong the crates.\nThe first German Mechanic, who is just pulling the fuel hose\nfrom the tank truck to the plane, sees the combatants and\nruns to help his countryman. He is almost upon them when\nIndy puts the Second German away with a devastating left -\nright - left combination. He turns to find the first German\nMechanic flying at him. The roll toward the rear of the Flying\nWing and its lethally spinning reversed propellers.\nIn the cockpit of the Flying Wing, the Pilot has been fiddling\nwith his gauges just prior to shutting off his engines. Now\nhe notices the fight going on outside.\nThe fistfight between Indy and the German Mechanic has taken\non a new stomach-tightening dimension. The men are fighting\nand flailing in and out between the spinning props at the\nback of the plane's wings. Each man comes within inches of\nbecoming instant mincemeat.\nThe Pilot slides away the top of his cockpit and stands up.\nHe pulls a Luger from his side and points it, waiting for a\nclear shot at Indy. The German Mechanic kicks Indy away from\nhim and the Pilot aims his pistol. Suddenly, Marion appears\nbehind the Pilot, standing on the opposite wing, and bashes\nhim over the head with one of the blue blocks that was holding\nthe tires. The Pilot drops down into the cockpit, his body\nfalling on the throttle. The engines roar louder, revving\nup. The plane begins to roll, rotating around its one still-\nblocked set of tires. Marion grabs onto the cockpit to keep\nfrom slipping into the props. She bends into the cockpit,\ntrying to pull the Pilot's body off the throttle. No luck.\nShe grimaces and climbs inside. Her shoulder bumps the top\nof the cockpit; it slides tightly shut above her.\nUnder the moving wing, Indy delivers a knockout rightcross\nto the German Mechanic which sends him staggering back toward\na roaring propeller. Indy's grimace registers the man's demise\nand a fine mist of blood wafts toward him. Indy spins toward\nthe sound of crumpling metal and sees -\nThe other prop of the Flying Wing slice into a tank truck.\nThe airplane fuel inside floods out onto the pavement,\nsurrounding the plane. Indy backpedals away from the plane,\nhis eyes searching the scene for Marion. Suddenly, he is\nshocked to see her in the cockpit. He runs toward her,\nskidding through the gasoline."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Get out! Get out!"
  },
  {
   "type": "stage direction",
   "text": "Marion is struggling with the top of the cockpit. She can't\nbudge it. She's trapped."
  },
  {
   "type": "location",
   "text": "EXT. THE COMMAND TENT - DAY"
  },
  {
   "type": "stage direction",
   "text": "Three Armed Nazis stand guard around the wooden crate\ncontaining the Ark. It is sitting near the flopped-open\nentrance to the Command Tent and there is furious activity\ngoing on here. Belloq, Shliemann, Gobler, Belzig and assorted\nAides are packing up all the papers and personal items in\npreparation for a hasty departure.\nA large crowd of Arab Diggers is milling about among the\ntents. They all want to get a look at the Ark. Sallah is\namong them. All at once, there is a earthshaking explosion.\nAl eyes turn toward the rise that hides the airstrip. A huge\nfireball floats into view over there. Everyone starts running\ntoward it. Shliemann yells at Belzig and the Armed Nazis."
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "Stay with the Ark!"
  },
  {
   "type": "location",
   "text": "EXT. THE RISE ABOVE AIRSTRIP - DAY"
  },
  {
   "type": "stage direction",
   "text": "Almost all the Arabs and Germans in the digs have congregated\nhere and are staring at the burning remains of the Flying\nWing. Belloq and Shliemann arrive just as the second fuel\ntruck blows up. The concussion knocks many of the observers\nflat. Belloq, Shliemann and Gobler watch the scene in alarm."
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "Sabotage!"
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "We must get the Ark away from this\nplace immediately!"
  },
  {
   "type": "stage direction",
   "text": "(to Gobler)"
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "Have it put on the truck. We'll fly\nout of Cairo."
  },
  {
   "type": "stage direction",
   "text": "Gobler snaps his heels, turns to go."
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "And Gobler -"
  },
  {
   "type": "stage direction",
   "text": "(Gobler stops)"
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "I want plenty of protection."
  },
  {
   "type": "stage direction",
   "text": "Gobler nods and runs off. Shliemann heads back toward camp.\nBelloq hesitates a long moment, studying the burning wreckage\nwith an odd, suspicious look. Finally, he turns and leaves,\npassing a nearby stack of barrels. When he has passed, Sallah\nappears from among the barrels. He searches the crowd for\nhis people and starts a broken field run along some tents to\navoid a group of Germans and is running flat-out when someone\nsticks out a leg and sends him flipping. Sallah, dust all\nover his face, looks angrily toward the concealed culprit.\nAt once, a flashing white grin splits his darkened face.\nIndy and Marion, splotched with soot and oil, are hiding in\nthe flap of a tent. Sallah runs into their arms and the three\nembrace warmly. When they break -"
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "Holy smoke, my friends! I am so\npleased you are not dead."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Us too."
  },
  {
   "type": "stage direction",
   "text": "(suddenly remembering)"
  },
  {
   "type": "speech",
   "character": "SALLAH",
   "text": "The Ark! They're taking it on a truck\nto Cairo."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Where is it?"
  },
  {
   "type": "stage direction",
   "text": "Sallah gestures to follow and all three run off stealthily\nthrough the mostly deserted camp."
  },
  {
   "type": "location",
   "text": "EXT. AMONG THE TENTS - DAY"
  },
  {
   "type": "stage direction",
   "text": "Sallah, Indy and Marion run into a hiding spot behind some\nwater barrels near the Command Tent. They peek out at this\nactivity -\nIn the big space near the Command Tent is parked an open\nGerman staff car; inside is a Blond Driver and an Armed Guard.\nDirectly behind it is a canvas-topped troop truck. At this\nmoment, Belloq and Shliemann are supervising the careful\nplacement of the crated Ark in the back of the truck. When\nit is securely placed inside, we hear an ominous marching\nsound and Nine Armed Nazis appear at a trot from between\nsome tents and climb into the back of the truck with the\nArk.\nBehind the water barrels, Sallah and Marion exchange hapless\nlooks, But Indy just concentrates on -\nThe scene by the truck: Belloq and Shliemann are about to\nclimb into the front staff car when they pause to check out\nthe final component of the convoy. Rolling into place behind\nthe truck is another open staff car. But this one is special -\nmounted in the back is a big, black machine gun, manned by a\nGunner. At the wheel of the car is Gobler and next to him\nsits Belzig.\nSallah and Marion look at Indy. Belloq and Shliemann climb\nin the back seat of the front car and the caravan pulls out.\nIndy watches it go, thinking hard."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "You two get back to Cairo quick and\nget us transportation to England - a\nplane, a ship, anything."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "What about you?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I'm going to get that truck. I'll\nmeet you at Omar's. Be ready for me."
  },
  {
   "type": "stage direction",
   "text": "Sallah nods. Marion looks at him like he's nuts. Indy jumps\nup, looks around desperately."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "How are you going to get that truck?"
  },
  {
   "type": "stage direction",
   "text": "(still searching)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I don't know. I'm making this up as\nI go."
  },
  {
   "type": "stage direction",
   "text": "He runs away between two tents."
  },
  {
   "type": "location",
   "text": "EXT. AT THE EDGE OF THE DIGS - DAY"
  },
  {
   "type": "stage direction",
   "text": "From among the tents, Indy suddenly bursts into view, happily\nastride a magnificent white Arabian stallion. He gallops off\nacross the desert."
  },
  {
   "type": "location",
   "text": "EXT. THE DESERT (VARIOUS SHOTS) - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy cuts cross-country avoiding the road the convoy has\ntaken. He leaps gullies, climbs dunes, slides down slopes.\nSoon the convoy comes into view far below him. He tears along\na parallel ridge, like an Indian shadowing a wagon train."
  },
  {
   "type": "location",
   "text": "EXT. DESERT ROAD - DAY"
  },
  {
   "type": "stage direction",
   "text": "The convoy is entering rougher country. The narrow mountain\nroad we've seen earlier ascends ahead. To the side of the\nroad are tall boulders. Suddenly, Indy shoots out from between\ntwo rocks and rides directly for the truck. The Armed Nazis\nin the back of the truck can see nothing because the canvas\nhides their view. But Gobler, Belzig and the Gunner in the\nrear staff car have a brief line on him. Belzig points and\nthe Gunner fires away and Indy, the bullets kicking up sand\nnear Indy's horse.\nThe Armed Guard in the cab of the truck leans out to see\nwhat's happening. Indy has been riding alongside. Now he\nstands on the horse and leaps to the cab. In a second, he\nhas flipped the Armed Guard out of the truck. He slides into\nthe cab and begins grappling with the Truck Driver. The Truck\nDriver tries to hit the brakes, but Indy kicks his foot away\nand floors the gas pedal. The truck doubles its speed and\nshoots onto the steep mountain road."
  },
  {
   "type": "location",
   "text": "EXT. MOUNTAIN ROAD - DAY"
  },
  {
   "type": "stage direction",
   "text": "The Blond Driver of the front staff car sees the truck move\nup on him in the rearview mirror and speeds up. Belloq,\nShliemann and the Armed Guard in the car twist around to\nlook at the struggle in the truck. The Blond Driver begins\nwhat will be a continuing preview of the twists in the road.\nHe turns his wheel sharply and takes the lead car around a\nbend.\nIn the cab of the truck, Indy and the Truck Driver stop their\nfight temporarily and cooperate in turning the steering wheel.\nThe truck barely stays on the road.\nA full view reveals the incredible geography of this ride.\nThe convoy in tiny against the spectacular mountainside, the\ncliffs drop hundreds of feet.\nAt the wheel of the rear car, Gobler swerves to stay on the\nroad and accidentally sideswipes a boulder. The Gunner perched\nin the back is flipped head over heels out of the car. Gobler\nand Belzig are having trouble seeing the road through all\nthe dust the convoy is kicking up.\nThe lead staff car reaches the summit of the road and barely\nmakes the hairpin turn there, delivering a destructive blow\nto the guard rail that has been placed there. The guard rail\nis now bent.\nIn the cab of the truck, Indy and the Truck Driver again\nstop trying to choke each other long enough to negotiate the\nturn together. The bumper of the truck hits the broken guard\nrail and sends it flying off the cliff. The truck, however,\nholds the road.\nIn the rear car, Gobler and Belzig are trying to see through\nthe thick clouds of dust. Suddenly is clears completely.\nUnfortunately for them, this happens because their car has\nshot out into space at the hairpin turn. They are flying to\ntheir final reward. Belzig, eyes wide behind his evil\nspectacles, screams as he goes.\nIn the cab of the truck, the Truck Driver is distracted by\nthe sight of the flying staff car. Indy plasters him and he\ntumbles out.\nFar, far below, Belzig's staff car explodes on the rocks.\nIn the back of the truck, a TOUGH SERGEANT takes command of\nthe situation. He picks out six Armed Nazis and motions for\nthem to start climbing around the outside of the truck to\nthe cab. With some trepidation the lucky ones begin that\nmaneuver. The truck is swerving like crazy.\nIn the front staff car, the Armed Guard aims his submachine\nguns back at Indy, alone now in the truck's cab. Shliemann\nknocks the barrel roughly away."
  },
  {
   "type": "stage direction",
   "text": "(yelling)"
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "If anything happens to that Ark,\nwe're all dead men ! The Fuhrer will\nsee to it!"
  },
  {
   "type": "stage direction",
   "text": "Indy sees this from the cab and reacts by speeding up, putting\neven more pressure on the Blond Driver.\nAlong the back of the truck, Armed Nazis are edging up toward\nthe cab, three on each side. They hang on as the truck rounds\na corner and goes into a straightaway that leads through a\nshort tunnel.\nIn the cab, Indy has been concentrating on the lead staff\ncar. Now, just before entering the tunnel, he looks in the\nside view mirror and sees the Nazis on his side. A quick\nglance to the other mirror reveals the others. As the truck\nsweeps into the tunnel, we see Indy just start to turn his\nsteering wheel - he is going to sideswipe the walls of the\ntunnel\nAt the other end of the tunnel, we hear the roar of the two\nengine and two long, screeching, scraping sounds. The lead\nstaff car shoots out of the tunnel, then the truck, its sides\ncleaned of Nazis.\nIn the rear of the truck, the Tough Sergeant is looking with\ndistaste back at the tunnel. There remains only him and two\nArmed Nazis with the Ark. He sends these two climbing up\nover the top of the truck.\nIn the lead car, the Blond Driver is being pressed hard by\nIndy, who now edges up to bump them from the rear. Suddenly\nthe Armed Guard next to the Driver sees the two Armed Nazis\nappear on the top of the truck. Without thinking, he starts\nto point them out to Shliemann, then realizes his stupidity.\nIn the cab, Indy has seen this and is at first mystified. He\nchecks his sideview mirrors. Then he figures it out and slams\non his brakes. The brakes lock, the wheels burn and the truck\nskids to a dusty halt. The two Armed Nazis fly off the truck,\nover the cab to the road in front. Indy immediately hits the\ngas again. The two Armed Nazis, just aiming their weapons,\nget wiped out.\nIn the rear of the truck, the crated Ark is bouncing all\nalone, no one in sight, because -\nThe Tough Sergeant is on the top of the truck, making his\nway steadily forward. This guy clearly knows what he's doing.\nA submachine gun is slung across his back.\nThe truck and the staff car race through a series of S-curves.\nIn the staff car, Belloq and Shliemann spot the Tough Sergeant\nas he reaches the front of the truck's top and begins to\nlower his submachine gun barrel toward the cab. Indy is\nunaware. Belloq and Shliemann exchange looks. Then Shliemann\nyells to the Armed Guard in the front seat.\nThe Tough Sergeant has a line on Indy. He points his gun.\nThe Armed Guard blasts away at the truck. The Tough Sergeant\ndies in a hail of bullets and flies off.\nIndy, who has ducked at the gunfire, is confused. But when\nhe sees the Armed Guard up front lower his gun, Indy again\nfloors it and begins bumping the staff car in earnest.\nThe road is almost down to a level now. In the distance -\nCairo. The road takes a little dogleg just before reaching\nlevel ground again. Just as the staff car is about to make\nthe turn, Indy smashes them from behind. The staff car flies\noff the road and down a twenty foot embankment. Indy takes\nthe truck speeding down the road and off toward Cairo.\nIn the staff car, the occupants are bruised but safe.\nShliemann points at the departing truck and yells at the\nBlond Driver. The staff car fishtails out of its sandy resting\nplace and takes off after the truck."
  },
  {
   "type": "location",
   "text": "EXT. OUTSKIRTS OF CAIRO (VARIOUS SHOTS) - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy has an ever-decreasing lead on the staff car as the\nrace thunders into the narrow streets. People and animals\nleap out of the way; carts and barrels go flying helter\nskelter. Indy takes the truck down a street so narrow there\nare only inches to spare on each side. Pedestrians jump into\ndoorways."
  },
  {
   "type": "location",
   "text": "EXT. OMAR'S SQUARE - DAY"
  },
  {
   "type": "stage direction",
   "text": "When the truck clears the narrow street, it is in a small\nsquare. Omar's garage is gaping open on the opposite side.\nIndy hits the brakes and the truck skids across the square\nand into the garage. The garage door slams shut and tenting\ndrops from the building to hide the door. Various Arabs,\nfriends of Omar, rush out with fruit carts and baskets and\nset up a mini-bazaar in seconds. Two Arab Boys sweep the\ntracks of the truck into oblivion. They throw aside their\nbrooms just as the staff car appears from the narrow street.\nBelloq and Shliemann look around desperately as the Blond\nDriver steers the car through the square and out the other\nside."
  },
  {
   "type": "location",
   "text": "EXT. CAIRO DOCKS - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "The waterfront is dark and misty. An old tramp steamer, the\nBANTU WIND, sits by the pier. Several fierce Black African\nPirates, the crewmembers, are taking on final stores.\nA small light illuminates the top of the gangplank. In its\ncircle, Indy and Marion exchange long, warm embraces with\nSallah. A short distance away the ship's Captain, a handsome,\npowerful black named SIMON KATANGA, watches from the rail,\nsmoking a pipe.\nDISSOLVE TO:"
  },
  {
   "type": "location",
   "text": "EXT. OPEN SEA - THE MEDITERRANEAN - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "The Bantu Wind is bathed in moonlight as it cuts across even\nseas."
  },
  {
   "type": "location",
   "text": "INT. INDY'S CABIN - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Indy comes in, takes off his hat, jacket, whip and holster.\nThe door which connects this cabin to the next opens and\nMarion appears. She is carrying a half-full glass of liquor,\nbut what you notice is the long, snow-white, high-necked\nnightgown she is wearing. It is very prim. Very innocent.\nAnd very sexy. Marion does a slightly embarrassed model's\nturn for Indy."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "I have a feeling I'm not the first\nwoman to travel with these pirates.\nThere's a whole wardrobe in there."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "It's lovely."
  },
  {
   "type": "stage direction",
   "text": "Indy sits on the cot, takes off his boots. He leans back\nagainst the wall and rubs his eyes. Marion sits on the bed,\nleans back against the wall with him and looks down at her\nwhite nightgown. She chuckles."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "I feel like a virgin bride in this."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "That's what you look like."
  },
  {
   "type": "stage direction",
   "text": "(takes a drink)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "There are some things you can\nrecapture in this life, but that\nisn't one of them."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "What would you like to recapture?"
  },
  {
   "type": "stage direction",
   "text": "(after a long pause)"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Nothing. That is the way it is."
  },
  {
   "type": "stage direction",
   "text": "He watches her closely as she drains her glass and puts it\ndown."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Did I ever say I was sorry I burned\ndown your tavern?"
  },
  {
   "type": "stage direction",
   "text": "She turns so their lips are very close."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "No. Then again, I burned up that\nplane."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "You saved my life."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "And you saved mine."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Seems things have worked out kind of\neven."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "That's the way I like them."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Maybe we should consider all past\naccounts closed."
  },
  {
   "type": "stage direction",
   "text": "Marion thinks about this a long time."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "No. Not yet."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "What else?"
  },
  {
   "type": "stage direction",
   "text": "She looks into his eyes. A smile jumps from her lips to his.\nHe kisses her and they sink slowly to the cot."
  },
  {
   "type": "location",
   "text": "INT. IN THE HOLD"
  },
  {
   "type": "stage direction",
   "text": "The ship's rats are agitated. They tremble and chatter at\nthe edges of the compartment, darting about. Out in the center\nof the hold, sitting all by itself, is the crated Ark. HUM-M-\nM-M."
  },
  {
   "type": "location",
   "text": "INT. INDY'S CABIN - DAY"
  },
  {
   "type": "stage direction",
   "text": "Marion awakes with a start, alone in the cot. Something's\nwrong. The ship is quiet. Indy is strapping on his holster.\nHe pulls his ship and jacket from a hook."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "What is it?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "The engines have shut down."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Why?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "I'm going to find out."
  },
  {
   "type": "location",
   "text": "EXT. LOWER DECK - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy runs toward the bow, then climbs some steps four at a\ntime. A MESSENGER PIRATE is hurrying to get him, but flies\nby him on the steps. By the time the Pirate stops himself,\nIndy is gone."
  },
  {
   "type": "speech",
   "character": "MESSENGER PIRATE",
   "text": "Mister Jones! The Captain he say -"
  },
  {
   "type": "location",
   "text": "EXT. THE BRIDGE - DAY"
  },
  {
   "type": "stage direction",
   "text": "Captain Katanga is looking with concern ahead of the ship.\nIndy appears behind him."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "What's wrong?"
  },
  {
   "type": "speech",
   "character": "KATANGA",
   "text": "You have most important friends."
  },
  {
   "type": "stage direction",
   "text": "Katanga turns quickly, pointing with a sweeping hand. Indy\nlooks. Arrayed in a rough semicircle around the ship are ten\nGerman Wolf Submarines. All of their deck guns are manned\nand trained on the Bantu Wind. Worse, at least five heavily-\narmed boarding parties in rafts are closing quickly on the\nship."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Holy shit."
  },
  {
   "type": "stage direction",
   "text": "(fast)"
  },
  {
   "type": "speech",
   "character": "KATANGA",
   "text": "I sent my man for you. You and the\ngirl must disappear. We have a place\nin the hold. Go, my friend!"
  },
  {
   "type": "location",
   "text": "EXT. UPPER DECK - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy tears along the deck. He looks over the rail and sees\ntwo Nazi rafts already next to the ship."
  },
  {
   "type": "location",
   "text": "EXT. LOWER DECK - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy flies down some stairs and starts to round a corner.\nSuddenly he throws himself backwards, out of view. Three\nuniformed Nazis are clustered near a cabin door holding the\nMessenger Pirate. Now two more come out of the cabin trying\nto maintain their grasp on a kicking, yelling Marion. She is\nstill wearing her white nightgown. More Nazis clamber onto\nthe deck and head toward Indy, slamming open doors, rousting\nPirates, spouting racial epithets. Indy steps backwards and\nfades into the maze of the ship."
  },
  {
   "type": "location",
   "text": "EXT. / INT. THE BANTU WINDS (VARIOUS SHOTS) - DAY"
  },
  {
   "type": "stage direction",
   "text": "The ship is swarming with Nazis. The Black Pirates are herded\nforward, subjected to rough physical and verbal abuse by the\nAryan Supermen. The Pirates are clearly under orders not to\nresist, but not one of these strong men likes it. They'd\ngladly give their lives to rip the throat out of a few Krauts.\nIn the hold, the door slams open and Nazis pour in; they\nsmile at the sight of the crated Ark."
  },
  {
   "type": "location",
   "text": "EXT. THE BRIDGE - DAY"
  },
  {
   "type": "stage direction",
   "text": "Captain Katanga watches as his crew is crowded into a circle\nof Nazis on the wide deck below him. He is surrounded by\nBelloq, Shliemann, and several Nazis, two of whom are holding\nMarion. Now the Nazis from the hold appear on the lower deck\ncarrying the crated Ark by means of the long poles. Belloq's\neyes shine at the sight."
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "Take it aboard the Wurrfler!"
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "And be very careful!"
  },
  {
   "type": "stage direction",
   "text": "The Ark is taken away."
  },
  {
   "type": "stage direction",
   "text": "(to a Sergeant below)"
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "What about Jones?"
  },
  {
   "type": "speech",
   "character": "SERGEANT",
   "text": "Not a trace yet, sir!"
  },
  {
   "type": "speech",
   "character": "KATANGA",
   "text": "Jones is dead."
  },
  {
   "type": "stage direction",
   "text": "Belloq and Shliemann regard him suspiciously."
  },
  {
   "type": "speech",
   "character": "KATANGA",
   "text": "We killed him. He was of no use to\nus. The girl, however, has certain\nvalue where we are headed. She will\nbring a very good price. If that\ncargo you have taken was your goal,\nthen go in peace with it. But leave\nus the girl. It will reduce our loss\non this trip."
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "Savage. You are not in a position to\nask for anything. We will take what\nwe wish and then decide whether or\nnot to blow your ship from the water."
  },
  {
   "type": "stage direction",
   "text": "Belloq steps forward and puts a proprietary hand on Marion's\narm, fixing Shliemann with a steady look."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "That girl goes with me. It will be\npart of my compensation. I'm sure\nthe Fuhrer would approve."
  },
  {
   "type": "stage direction",
   "text": "Shliemann considers."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "If she fails to please me, you can\ndo with her as you wish."
  },
  {
   "type": "stage direction",
   "text": "This appeals to Shliemann's nature. He signals his agreement\nwith a gesture. Belloq ushers Marion away with her two\nkeepers.\nDISSOLVE TO:"
  },
  {
   "type": "location",
   "text": "EXT. \"THE WURRFLER\" - CONNING TOWER - DAY"
  },
  {
   "type": "stage direction",
   "text": "The Nazis have returned to their subs. Shliemann is on the\nbridge with the WURRFLER'S CAPTAIN and the Captain's Aides.\nThe Captain is an honorable career Navy man."
  },
  {
   "type": "speech",
   "character": "THE WURRFLER'S CAPTAIN",
   "text": "Colonel Shliemann, all torpedoes are\nloaded."
  },
  {
   "type": "stage direction",
   "text": "Shliemann nods and continues to stare at the Bantu Wind, as\ndoes the Captain. The Pirate crew is all lined across the\nbow. Towering above the others, standing on the rail, proud\nand defiant, is Katanga. Shliemann looks at the Wurrfler's\nCaptain a moment."
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "What do you think, Captain?"
  },
  {
   "type": "stage direction",
   "text": "(earnestly)"
  },
  {
   "type": "speech",
   "character": "THE WURRFLER'S CAPTAIN",
   "text": "I think not, Colonel. Nothing is to\nbe gained. We are not at war."
  },
  {
   "type": "stage direction",
   "text": "Shliemann mulls this, then turns to the hatch."
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "...yet. Let the vermin live. We must\nbe on our way."
  },
  {
   "type": "stage direction",
   "text": "Shliemann disappears down the hatch. The Captain is very\npleased. A Radioman speaks into his headset, then follows\nthe other Aides down the hatch. In the distance the other\nsubs begin to move away from the ship. The Captain, alone on\nthe bridge, looks once more at Katanga.\nOn the Bantu Wind, Katanga executes what might be taken for\na salute.\nThe Wurrfler's Captain smiles, salutes crisply, then goes\nbelow, pulling the hatch closed. Immediately, the Wurrfler\nbegins to move. And as it does, we see the rail at the aft\nof the main deck. From nowhere, a wet sleeve appears and a\nhand grabs the rail!\nIndy pulls his dripping body onto the sub's main deck. He\nhas lost his felt hat once and for all. Other than that, his\noutfit is the same as always, just wetter. Suddenly, water\nis washing over his feet; the Wurrfler is beginning to\nsubmerge. Indy runs through quickly deepening water toward\nthe haven of the conning tower. Halfway there, he slips and\ngoes down. Only by grabbing the base of the aftmast light\ndoes he keep from being swept away. He struggles to his feet\nand sloshes through knee-deep water to the base of the conning\ntower.\nIndy climbs the ladder to the bridge of the conning tower\nand looks down. The water is rising toward his fast. Indy\nclimbs the ladder to the top of the turret and braces himself\nbetween the two uprights there - the 7 foot radio mast and\nthe 20 foot periscope. Still the ocean comes up to meet him.\nSoon the top of the turret is under water and the radio mast\nis disappearing. Indy shifts his grip to the periscope,\nworking his way up it and hanging on for dear life as the\nocean whips at his body. The periscope is quickly going under.\nIndy hangs on to the top three feet, all that remains above.\nThe forward movement of the sub continues, but, to Indy's\nslowly dawning delight, the dive stops. No more of the\nperiscope goes under. Indy smiles; it's a pretty good smile,\ntoo, given the circumstances. Indy pulls out his bullwhip\nand begins tying himself to the periscope."
  },
  {
   "type": "location",
   "text": "EXT. THE PERISCOPE - AFTERNOON"
  },
  {
   "type": "stage direction",
   "text": "The sun warms that part of his body Indy has contrived to\nkeep out of the water. The rest floats out behind. Indy isn't\ncomfortable, but all in all, it's not as terrible as he might\nhave feared.\nDISSOLVE TO:"
  },
  {
   "type": "location",
   "text": "EXT. THE PERISCOPE - DUSK"
  },
  {
   "type": "stage direction",
   "text": "It's as terrible as Indy might have feared. He looks wasted.\nWaterlogged and exhausted. The wet leather of the whip is\ncontracting and he must struggle constantly to keep it from\ncutting into his skin.\nDISSOLVE TO:"
  },
  {
   "type": "location",
   "text": "EXT. THE OCEAN - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Several shark fins cut the surface, appearing and disappearing\nin the bright moonlight. They are shadowing -"
  },
  {
   "type": "location",
   "text": "EXT. THE PERISCOPE - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Indy looks through barely open eyes at the sharks running\nalongside. There is nothing to be done. His eyes close.\nFADE OUT:\nFADE IN:"
  },
  {
   "type": "location",
   "text": "EXT. THE PERISCOPE - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "The submarine has stopped. The water is calm. The moon is\nbright. A gentle swell splashes Indy awake. He blinks, tries\nto regain his senses. He makes an inventory of his body.\nSurprised to find himself intact, his spirits lift. Some\nhidden reserve of energy flows through him. He frees his\naching arms from the wet leather of his whip, leaving only\none loop around his waist to hold him to the sub. He rubs\nhis hands and stretches. Once again, he has survived. To\nfight again. He looks around.\nWHAT HE SEES\nA lovely island. No sign of man's presence. The sub has\nstopped at the mouth of a wide cove completely ringed by\ntall white rock cliffs. Suddenly the sub begins to move again.\nIt is headed directly toward the center of the cliffs. Indy\nholds on, mystified, alert. When the cliffs are very close,\nthe sub begins to dive."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Damn!"
  },
  {
   "type": "stage direction",
   "text": "He thinks hard. Inspiration hits just before the water. Indy\nflips his leather jacket up over his head and holds the jacket\nout in front of him. His head is hidden by the jacket as he\ngoes under water."
  },
  {
   "type": "location",
   "text": "INT. THE UNDERWATER TUNNEL - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "The sub enters an underwater tunnel that penetrates into the\ncliffs. Indy is held to the periscope by his crossed legs\nand the whip. His impromptu air bubble is working, but it's\na struggle to maintain it.\nThe sub begins to cut through think marine vegetation. Each\ndangling growth pulls at Indy's body and slaps at his leather\nbubble. Now a clump of entwined seaweed rips the leather out\nof his hands and his bubble of air rises away. Indy hangs\non, holding his breath, but the vegetation gets denser.\nFinally, it pulls him off the periscope. The sub moves on,\ndisappearing ahead.\nIndy rises desperately through the dark water, his hand\noutstretched. Then, almost simultaneously, hand and head hit\nsolid rock. But no air. Indy feels along the ceiling of rock.\nNothing. It's all submerged.\nIndy dives, stroking deep into the tunnel. When he has\ndescended 15 feet, he grabs a vine and steadies himself. His\neyes search the dim roof of the tunnel. He sees his last\nhope in the distance - a small blue circle, an air pocket.\nHe swims for it.\nIn the air pocket, Indy's head breaks the surface and smashes\ninto rock again. The pocket is only six inches deep. No\nmatter. Indy loves it. He'd like to move in. He gulps air."
  },
  {
   "type": "location",
   "text": "INT. THE SUB BASE - DOCKING BAY"
  },
  {
   "type": "stage direction",
   "text": "The Wurrfler has arrived at an extraordinary base built in\nthe hollow interior of the island. This chamber, with the\ndocking bay, is almost all water. A huge natural cavern, it\nhas been reinforced and enlarged by the Germans.\nThe Wurrfler sits surfaced at the dock. The Ark has been\nunloaded and placed on a cart. Shliemann, Belloq and Marion\nhave just disembarked and been met by a Nazi contingent from\nthe base. Marion looks worse for the trip. Her white nightgown\nis now ripped and smudged.\nOne of the greeting Nazis, a TALL CAPTAIN, salutes Shliemann\nand Belloq. As he speaks to them, we notice that right behind\nthis group, just above a great deal of sub unloading activity,\nIndy's whip hangs from the periscope. Working Nazis pass\nwithin feet of it unaware; the Tall Captain would see it in\na moment if he were not so focused on the new arrivals."
  },
  {
   "type": "stage direction",
   "text": "(to Belloq)"
  },
  {
   "type": "speech",
   "character": "TALL CAPTAIN",
   "text": "The tents have been arranged in\naccordance with your radioed\ninstructions, sir."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "Good. We must take the Ark there\nnow."
  },
  {
   "type": "stage direction",
   "text": "Shliemann looks a little unhappy about this exchange, but\nsays nothing. The group moves swiftly toward the end of a\nmine train arrangement. The train, consisting of small,\nseparate, electric-powered cars, sits on a track which\ndisappears into a tunnel cut in the rock.\nOn the turret of the Wurrfler, the Wurrfler's Captain lights\na cigarette as he watches the mine train disappear, then\nreturns his attention to the activity on the dock. He leans\nidly against the periscope, his head two feet below Indy's\ndangling whip. Something catches his eye, he yells an order\nand climbs down from the turret to deal with the matter. We\nhold on the whip for a long moment, until its owner's hand\nappears and quickly reclaims it."
  },
  {
   "type": "location",
   "text": "INT. TRAIN TUNNEL"
  },
  {
   "type": "stage direction",
   "text": "The Ark and its entourage are moving slowly up the tight\ndark tunnel, their way lit by intermittent lanterns. The\ntunnel is irregular, but generally about 7 feet wide. It's\nheight varies from an average of about 7 feet to a low of\nonly about 4.5 feet at the points (every 40 feet) where\nsupport beams cross the track. The result is that there is\nonly about a foot of clearance above the mine cars at those\npoints; passengers must duck to keep from being hit in the\nhead. Shliemann, looking worried, and Belloq, very excited,\nare focused on the Ark in the car ahead."
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "I am uncomfortable with the thought\nof this -"
  },
  {
   "type": "stage direction",
   "text": "(spitting it out)"
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "Jewish ritual. Are you sure it's\nnecessary?"
  },
  {
   "type": "stage direction",
   "text": "(playing him)"
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "Let me ask you this - Would you be\nmore comfortable opening the Ark in\nBerlin - for the Fuhrer - and finding\nout only then if the sacred pieces\nof the Covenant are inside? Knowing,\nonly then, whether you have\naccomplished your mission and obtained\nthe one, true Ark?"
  },
  {
   "type": "stage direction",
   "text": "Shliemann doesn't like any of his alternatives. He looks at\nBelloq with some suspicion as the train comes into bright\nlight."
  },
  {
   "type": "location",
   "text": "INT. COMMAND CENTER"
  },
  {
   "type": "stage direction",
   "text": "A second natural cavern, even bigger than the first, has\nbeen worked over by the Germans into a rectangular, three-\nstory high supply center around a huge, open, center court.\nUniformed Nazi Soldiers are everywhere, wrangling supplies\nand ammunition, monitoring electronic equipment. At the far\nend of the court, a second train tunnel disappears into the\nrock.\nAcross the open court, Belloq sees his destination: a large,\nbrilliant white silk tent has been erected in the midst of\nall this hardware. It looks incongruous, and more than a\nlittle eerie. It is the Tabernacle."
  },
  {
   "type": "location",
   "text": "INT. TRAIN TUNNEL"
  },
  {
   "type": "stage direction",
   "text": "Indy is making his way up the tunnel. He hears cars coming\nfrom up ahead and steps into the shadows. A mine car passes\nwith several laughing Nazis. Indy continues on his way."
  },
  {
   "type": "location",
   "text": "INT. THE TABERNACLE"
  },
  {
   "type": "stage direction",
   "text": "The light in here is lovely, unearthly. Oil lamps burn. The\nTabernacle is really several concentric, silk tents, which\ncreates a flowing maze effect. The innermost tent has at its\ncenter a 3-foot high, tapestry-covered altar. Belloq watches\nwith gleaming, obsessed eyes as two Nazis carefully lift the\nactual Ark out of its crate by means of the long poles. The\nArk dazzles the eye, seeming to glow gold in this strange\nlight. The two Nazis place it carefully on the altar.\nShliemann and some Aides hang back. Marion is nowhere to be\nseen."
  },
  {
   "type": "location",
   "text": "INT. COMMAND CENTER - END OF TUNNEL"
  },
  {
   "type": "stage direction",
   "text": "Indy makes a fast break from the shadows of the tunnel to\nthe protection of a high stack of supplies. He climbs the\nback of the stack, peeks over and surveys the area.\nWHAT HE SEES\nIn addition to the Tabernacle, the second train tunnel\nentrance, and all the activity, Indy's glance rests\nmomentarily on a large, heavy metal door halfway down one\nwall toward the Tabernacle. It bears the words, in German:\n\"DANGER - MUNITIONS\"\nIndy continues to scan the scene."
  },
  {
   "type": "location",
   "text": "INT. THE TABERNACLE"
  },
  {
   "type": "stage direction",
   "text": "In the central area with the Ark, Shliemann and the other\nNazis wait impatiently, eyeing the Ark with some discomfort.\nBelloq is not visible, because at the moment he is -\nIn the folds of the Tabernacle, the silk of the tents\nundulating around him. The light is even stranger, the scene\nalmost dreamlike. With the help of the Tall Captain, Belloq\nlets an extraordinary, gold-embroidered, ceremonial robe\nfall over his head and onto his body. Belloq looks\ntransported, possessed. The Tall Captain unlatches a wooden\ncase and takes from it a sturdy ivory rod about 5 feet long,\nelaborately engraved. Belloq takes it from him, turns and\nslips back through the silk. The Tall Captain stays in the\nfolds.\nBack in the central area, Shliemann and the other Nazis are\ntaken aback by Belloq's appearance in the robe. They exchange\nlooks. From one knot of men there is muttering about \"Juden\"\nand such, but when Belloq turns a fiery gaze on them there\nis immediate silence. Shliemann looks uncertain in this\npresence.\nBelloq approaches the Ark. He stops a few feet from it and\nbegins murmuring an invocation in Hebrew. After a few moments\nof this he advances a step and is about to place the ivory\nrod in a notch under the lid of the Ark itself. The end of\nthe rod is an inch from the notch when -\nIndy steps into the Tabernacle. On his shoulder is a bazooka\nand it is aimed directly at the Ark."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Hold it."
  },
  {
   "type": "stage direction",
   "text": "(the Nazi react)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "One move from anybody and I blow\nthat box back to Moses."
  },
  {
   "type": "stage direction",
   "text": "Shliemann makes it clear to the other Nazis that Indy is to\nbe obeyed."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "Jones, your persistence surprises\neven me. You are going to give\nmercenaries a bad name."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "What about you? Talked to God yet?"
  },
  {
   "type": "stage direction",
   "text": "(Belloq's eyes flash)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Where's the girl?"
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "Doctor Jones, surely you don't think\nyou can escape from this base."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "That depends on how reasonable we're\nall willing to be. All I want is the\ngirl. We'll keep possession of the\nArk only till we've got safe transport\nto England. Then it's all yours."
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "If we refuse?"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Then the Ark and some of us are going\nup in a big bang. I don't think Hitler\nwould like that a bit. Now I don't\nwant to talk about this anymore.\nShow me that girl in five seconds or -"
  },
  {
   "type": "stage direction",
   "text": "The Tall Captain flies out of the silk and takes Indy down\nby the neck. The bazooka clatters across the cement floor as\ntwo other Nazis help subdue Indy. The three Nazis take Indy's\npistol from his holster and raise him roughly in their grasp."
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "Jones, this is the second time I\nhave seen you looking very foolish."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "It's a bad habit. I'm trying to break\nit."
  },
  {
   "type": "stage direction",
   "text": "Shliemann draws his Luger."
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "I'll help you. This time I'll kill\nyou myself."
  },
  {
   "type": "stage direction",
   "text": "Shliemann raises the pistol."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "No! Not in the presence of the Ark!\nTake him outside."
  },
  {
   "type": "stage direction",
   "text": "Shliemann eyes Belloq, then the Ark. He lowers the pistol,\nmotions for the Nazis to take Indy out ahead of him. They\nstop a moment only when Belloq speaks."
  },
  {
   "type": "speech",
   "character": "BELLOQ",
   "text": "Indiana Jones, I salute you. I am\neven a little sorry you will miss\nthis moment."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Thanks. If you talk to Him, tell Him\nI'm on my way up."
  },
  {
   "type": "stage direction",
   "text": "Shliemann motions them out and follows. Belloq turns back to\nthe Ark, raising the ivory rod."
  },
  {
   "type": "location",
   "text": "INT. COMMAND CENTER"
  },
  {
   "type": "stage direction",
   "text": "Shliemann, the Tall Captain, Indy and the two Nazis holding\nhim emerge from the Tabernacle. Shliemann points to a nearby\nwall and the group starts that way with Shliemann and the\nTall Captain slightly ahead."
  },
  {
   "type": "location",
   "text": "INT. THE TABERNACLE"
  },
  {
   "type": "stage direction",
   "text": "Belloq has the ivory rod inserted in the notch under the lid\nof the Ark. He utters a short phrase in Hebrew and begins to\npress down on his end of the rod. The lid of the Ark begins\nto lift. It's difficult work. Belloq puts his whole weight\ninto one big press on his end and the lid opens two feet.\nInside the Ark of the Covenant is a preview of the end of\nthe world. A light so bright, a power so fearsome, a charge\nso jolting, that there is nothing in our world to compare to\nit. It's as though this magnificent golden box has been\ngathering electric energy for three thousand years, waiting\nfor just this crack of the lid to release it all in one fast,\ncleansing explosion of pure force.\nBlinding arcs of light shoot out across the Tabernacle\ninstantly killing all the Nazis inside and turning the white\nsilk to flame. But it is Belloq in his obsession who takes\nthe full blast. His whole body seems lit by a million volt\ncurrent and, for a moment, his complete form is white, then\nblue, then maybe green, but it is hard to tell because our\neyes are blinded now too. Two aspects of this ghastly,\nbeautiful display are somehow communicated in the chaos,\nalthough the communication is subliminal. First, that Belloq,\nin the instant of his destruction, has experienced some kind\nof sublime, transcendental knowledge. If a death's-head can\nsmile and look satisfied, that is how Belloq's incandescent\nface would be described. Secondly, this event is accompanied\nby a sound like no other. A sound so intense and so odd and\nso haunting that the suggestible among us might imagine it\nwere the whisper of God."
  },
  {
   "type": "location",
   "text": "INT. COMMAND CENTER"
  },
  {
   "type": "stage direction",
   "text": "Chaos. Shliemann and the Tall Captain have been temporarily\nblinded by the light from the Tabernacle. Indy makes short\nwork of his two escorts. He bashes their heads together.\nWhen only one goes down at this, Indy uses the handle of his\nbullwhip, which has appeared instantly in his hand, to put\nthe second one down.\nShliemann, hand on his eyes, aims his Luger blindly at the\nscuffle. Indy pushes the Tall Captain at Shliemann, who fires\non impact, killing the Tall Captain. Indy knocks out\nShliemann.\nBehind Indy, the brilliant light and weird noise of the Ark\nhave suddenly ceased, but the Tabernacle is ablaze and the\nfire has quickly spread to stacks of supplies on either side.\nSmoke is already starting to fill the cavern. Nazis are\nrunning around, yelling for firefighting water. A burning\ncrate at the side of the Tabernacle is pushed over, only to\nknock over a drum of heavy black oil. A river of flame shoots\nacross the cement.\nIndy grabs a rifle with bayonet from the prostrate body of\none of his former escorts and runs back into the flaming\nTabernacle."
  },
  {
   "type": "location",
   "text": "INT. THE TABERNACLE"
  },
  {
   "type": "stage direction",
   "text": "Indy jumps through the flames into what is now a tent of\nfire. He looks around at the dead bodies, then at the Ark.\nThe lid has slammed down shut again and the Ark shines gold\nin the flames. Before it, where Belloq once stood, is a pile\nof ash and charred debris. Indy registers this, then continues\nto scan the scene."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Marion! Marion, can you hear me?"
  },
  {
   "type": "stage direction",
   "text": "Suddenly, Indy looks as -\nThe far side of the Tabernacle burns completely away,\nrevealing Marion, tied spread-eagle between two upright posts.\nHer nightgown is now in tatters, black with soot. She is\ngagged, but her eyes are screaming, focused on the flaming\nriver of black oil which is about to engulf her feet.\nIndy rushes toward her, unaware of a uniformed Nazi who has\nappeared from the flames. Marion looks up to see Indy and\nthe Nazi leveling his submachine gun at Indy. She motions\ndesperately with her eyes. Indy dives and rolls through the\nflames just as the Nazi opens fire. From the floor, Indy\nblasts the Nazi.\nThe river of burning oil is only a foot from Marion.\nIndy jumps up and runs toward the bound Marion, his bayonet\naimed directly at her. Her wide eyes flash between the flames\nand the shining blade. Expertly, Indy slashes down both sides\nat Marion, cutting all four bindings. Marion falls backwards,\naway from the flames, but before she hits the ground, Indy\nis there, catching her in his arms.\nThey embrace. They kiss. They break."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Hi."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Oh, Indy! Thank god you're here."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Glad I could make it."
  },
  {
   "type": "stage direction",
   "text": "Indy rises, pulling her up with him. The Tabernacle is burning\naway so fast that soon Indy and Marion will be completely\nexposed. Indy rushes over and grabs the submachine gun and a\nLuger from the dead Nazi."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Let's get out of here."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "What about the Ark?"
  },
  {
   "type": "stage direction",
   "text": "Indy stops, startled by her spunky attitude. He's considering\ntheir changes."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Are you game?"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Hell yes! We've made it this far."
  },
  {
   "type": "stage direction",
   "text": "(grins at her)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Okay. Let's do it."
  },
  {
   "type": "stage direction",
   "text": "They approach the altar through the dying flames, Indy\nslinging the submachine gun over his back. The long carrying\npoles are still in place."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Whatever you do, don't touch it.\nLet's put it on the floor."
  },
  {
   "type": "stage direction",
   "text": "Marion nods. Each taking an end with the poles, they lift\nthe Ark from the altar and lower it to the floor. Marion\ngrunts under the weight. Indy registers this, hands her the\nsubmachine gun. He pulls out his whip, motions her back, and\nsweeps the whip tightly around the body of the Ark. The whip\nwraps snugly around the plaiting and Indy ties it off. The\nArk is now harnessed to the whip handle. Indy gives it an\nexperimental pull and the Ark slides across the smooth cement.\nIndy indicates the direction of the second train tunnel."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "We'll go down that side. Shoot anyone\nwho looks at us crosseyed."
  },
  {
   "type": "location",
   "text": "INT. COMMAND CENTER"
  },
  {
   "type": "stage direction",
   "text": "Two huge stacks of goods are ablaze and the Nazis are having\ntrouble getting water to them. The Nazis main concern at\nthis point is an enormous, neat stack of wooden cartridge\nboxes which are piled down the wall from one of the already\nblazing, and now teetering, stacks of general goods. Nervous\nNazis are moving the heavy cartridge boxes as fast as they\ncan, but it's slow work and the threatening fire is close.\nIndy and Marion make their way along the side of the center\ncourt, Indy grimacing with the strain of pulling the Ark.\nOne Nazi stops directly in front of them, looking at them\nqueerly. Indy knocks him out with the butt of his Luger just\nas Marion is about to fire.\nOut in the court, Shliemann has regained his eyesight. Now\nhe crouches, scanning the scene desperately for Indy. He\nlooks into the remains of the Tabernacle and spots the empty\naltar. Beyond it, the unoccupied posts where Marion was bound.\nAt the entrance to the second train tunnel, Indy and Marion\nstruggle to lift the Ark into a mine car. Marion has the\nsubmachine gun slung over her back. The Ark drops heavily\ninto the bottom of the car. The noise attracts the attention\nof five water-carrying Nazis. They see what's going on and\nreach for their side-arms. Indy grabs Marion, pulls her in\nfront of him - as though to use her as a shield - and flips\nthe submachine gun, still on her back, toward the Nazis.\nHe opens fire, turning Marion's body so he can mow all five\ndown.\nShliemann spins around and looks at the tunnel entrance. He\npoints at Indy and Marion, who have just hopped into the\nmine car with the Ark."
  },
  {
   "type": "speech",
   "character": "SHLIEMANN",
   "text": "Stop them! Kill them!"
  },
  {
   "type": "stage direction",
   "text": "A dozen Nazis spin and look at the mine car. Marion is just\nleveling the submachine gun. Indy pushes forward the throttle\nand the mine car moves toward the tunnel, picking up speed.\nAs the Nazis raise their guns to fire, Marion and Indy both\nopen up, peppering the area with lead. As the mine car is\nabout to disappear into the tunnel -"
  },
  {
   "type": "stage direction",
   "text": "(to Marion)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Get down!"
  },
  {
   "type": "stage direction",
   "text": "As the car disappears, bullets pock the entrance of the\ntunnel. Shliemann runs up with three Nazis. They jump into\nthe next mine car and take off, disappearing into the tunnel.\nOver at the burning stack of goods, some terrified fire-\nfighters scurry away as the burning pile of general goods\nfalls over onto the stack of cartridge boxes. The wooden\nboxes immediately start burning. Many of the Nazis just want\nto get out of there, but a couple of disciplined OFFICERS\nare trying to salvage the situation. They point to the far\nside of the court, the walls are lines with oil and gas drums."
  },
  {
   "type": "speech",
   "character": "OFFICER",
   "text": "We must cover the drums! Protect\nthem from the bullets!"
  },
  {
   "type": "stage direction",
   "text": "INTERCUTTING INDY AND MARION WITH SHLIEMANN AND THE NAZIS\nWe see a most extraordinary pursuit. This tunnel is of\nidentical design to the first, except more twisty. This early\nsection goes slightly uphill, as though headed for the summit\nof a rollercoaster. The low cross beams and the higher\nsections in between are causing the Nazis to alternately\nstand and duck in their efforts to get a clear shot at the\nlead car. One German times it wrong and gets whacked. Indy\nin unhappy with the speed of his car and he's right, the\nNazis are moving faster and gaining. When both cars are in\nthe same high section, the Nazis blast away at them. The\nnoise is deafening, with barking guns, splintering rock, and\ntwanging ricochets contributing to the din. As Marion fires\na return volley low over the Ark, Indy kicks at the throttle,\nconvinced it is jammed."
  },
  {
   "type": "location",
   "text": "INT. COMMAND CENTER"
  },
  {
   "type": "stage direction",
   "text": "The Officers are directing the placement of every moveable\nitem in front of the oil drums. Desks, crates, chairs, food,\nall are heaped in front of the fuel. All the workers cast\nfrequent nervous glances back at the burning cartridge boxes\nacross the court. Suddenly the worst begins to happen at the\ncartridge boxes. Hundreds of thousands of live cartridges\nbegin exploding, flying around the court like shrapnel. Hot\nlead begins to zing off the exposed fuel drums, leaving big\ndents."
  },
  {
   "type": "location",
   "text": "INT. TRAIN TUNNEL - LONG STRAIGHTAWAY"
  },
  {
   "type": "stage direction",
   "text": "The car with Indy and Marion looks almost sluggish compared\nto the pursuing Nazi car as they both make their way into an\nusually long straightaway. Marion discards her empty\nsubmachine gun as Indy kicks at his throttle and casts a\nworried look back at Shliemann.\nShliemann, sensing victory, smiles evilly and carefully takes\naim. Indy and Marion will be easy targets until they reach\nthat approaching low cross beam, which is the crest of the\nrising tunnel."
  },
  {
   "type": "location",
   "text": "INT. COMMAND CENTER - CLOSE ON FUEL DRUM"
  },
  {
   "type": "stage direction",
   "text": "A fuel drum, already pocked by bullets is finally penetrated\nby high velocity hot lead. It explodes in a ball of flame.\nAnd then its neighbor. Then all is exploding flame."
  },
  {
   "type": "location",
   "text": "INT. TRAIN TUNNEL - LONG STRAIGHTAWAY"
  },
  {
   "type": "stage direction",
   "text": "Shliemann and his cohorts hear the explosions behind them\nand look back that way.\nIndy kicks the throttle one more time and it goes! Their car\ndoubles its speed and shoots under the low cross beam at the\nsame instant as -\nA huge dragon of all-consuming fire shoots up the tunnel\nbehind the Nazis, catches their car and incinerates Shliemann\nand his men. The tunnel collapses in this section, burying\nthe fried Nazis forever."
  },
  {
   "type": "location",
   "text": "INT. TRAIN TUNNEL"
  },
  {
   "type": "stage direction",
   "text": "Indy and Marion look back at the low cross beam as the last\ntongue of flame makes it there and then is doused by falling\nrock and dirt. They look at each other, then turn their\nattention back to their own predicament. Their mine car is\ngoing incredible fast as it moves into a downward section of\nwildly twisting tunnel."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Slow it down!"
  },
  {
   "type": "stage direction",
   "text": "Indy is already pulling the throttle. It moves easily.\nUnfortunately, it is no longer attached to the motor. The\nmine car is out of control. After several moments, far ahead,\nappears a circle of bright daylight - the end of the tunnel!\nIt approaches at a frightening rate. Indy reaches out and\ngrasps Marion's hand. They exchange looks and then turn to\nlook ahead.\nTHEIR POV\nWe're taking this last stretch with them. It's a familiar\nnightmare. It has to do with a rollercoaster that ends\nsuddenly and disastrously. The shocking brightness of sunlight\nrushes up to engulf us, blinding us in its glare."
  },
  {
   "type": "location",
   "text": "EXT. THE ISLAND - END OF TRACKS, DOCK"
  },
  {
   "type": "stage direction",
   "text": "High up on the slope of the island, Indy and Marion's mine\ncar shoots out of the black tunnel and roars down toward a\nlittle dock at the end of the tracks.\nA small Nazi transport launch, carefully disguised as a Greek\nfishing boat, sits bobbing by the dock. The only human: a\nNazi Sentry dressed as a Greek peasant. He is perched on a\npile of seed bags which are stacked at the very end of the\ntrain tracks. As the mine car barrels noisily down toward\nhim, he throws away some burlap to reveal a mounted machine\ngun which he spins quickly around toward the approaching\nmine car. He opens fire.\nIn the out-of-control mine car, Indy pulls Marion down with\nhim. They are squashed into the corner trying to avoid contact\nwith the bouncing Ark. Bullets clang against the outside of\nthe car and whiz inches overhead. Indy and Marion are forced\ninto a tighter and tighter embrace of life.\nAt the machine gun post, the Nazi Sentry has been firing\nlike crazy, but now there is terror in his eyes. He realizes\nthe car is not going to stop. He lacks faith in his\nstronghold. Too late.\nThe mine car smashes into the seed bag bunker. And right on\nthrough. The Nazi Sentry, his machine gun and a dozen bursting\nseed bags are slammed into the ocean in a wild, hurtling\nmass. The mine car jumps, bounces and spins around, then\nslides to a stop in a cloud of seed at the edge of the water."
  },
  {
   "type": "location",
   "text": "INT. COMMAND CENTER"
  },
  {
   "type": "stage direction",
   "text": "Fire. Everywhere. No sign of life. A large gaping doorway,\nflames ringing it, blazing into the room beyond. Hanging by\none hinge there, its metal blasted and jagged, is a heavy\ndoor with the signed lettering, in German, \"DANGER -\nMUNITIONS\".\nThe first explosion happens. It's a baby compared to what's\ncoming yet it rocks the earth. It's terrible. And then, almost\nimmediately, another. The long, irregular, ever larger chain\nof explosions begins."
  },
  {
   "type": "location",
   "text": "EXT. THE ISLAND - VARIOUS SHOTS - DAY"
  },
  {
   "type": "stage direction",
   "text": "The island rumbles and shakes. From fissures and small natural\ncaves, dirt and rock shoot out like spraying water. Still\nthe explosion continue. A huge chunk of white cliff falls\naway into the turbulent sea. Birds scream and soar, afraid\nto land.\nFinally, we settle on a full shot of the island. We can\nrecognize that the small opening high on the slope from which\na cloud of smoke and dust is billowing is the end of the\nmine tunnel. And there below it, quite small from this\ndistance is the dock. And the boat that looks like a Greek\nfishing boat. There can be no mistake even from this far\naway - the boat is chugging out to sea."
  },
  {
   "type": "location",
   "text": "INT. THE PENTAGON - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy, Brody, and Marion, looking very stylish, are seated in\nColonel Musgrove's huge office. Sun pours in a window, through\nwhich Washington can be seen sparkling across the Potomac.\nEverything is neat and clean and regular. Including the three\nmen who are arrayed around the office. Two we know - Col.\nMusgrove and Maj. Eaton. The third is an unnamed Bureaucrat.\nHe hangs back, smiling and genial, his features obscured by\nthe glare of the window. He doesn't say anything, yet you\nhave a sense that the others defer to him in the matter at\nhand. He is the essence of all that is Byzantine and\ninscrutable in our scrubbed government machine.\nIndy and Brody are dissatisfied with the way the meeting has\ngone. Marion, on the other hand, is very happy and eager to\nget out of there. Eaton's manner is irritatingly cheery."
  },
  {
   "type": "speech",
   "character": "MUSGROVE",
   "text": "You've done your country a great\nservice."
  },
  {
   "type": "speech",
   "character": "EATON",
   "text": "And we trust you found the settlement\nsatisfactory?"
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Quite."
  },
  {
   "type": "speech",
   "character": "EATON",
   "text": "Good, good."
  },
  {
   "type": "stage direction",
   "text": "(glances around at\nthe others)"
  },
  {
   "type": "speech",
   "character": "EATON",
   "text": "Then I guess that about does it."
  },
  {
   "type": "speech",
   "character": "BRODY",
   "text": "When can we have the Ark?"
  },
  {
   "type": "stage direction",
   "text": "Eaton's glance flicks over to the mysterious Bureaucrat,\nthen back to Brody."
  },
  {
   "type": "speech",
   "character": "EATON",
   "text": "I thought we answered that. It's\nsomeplace very safe -"
  },
  {
   "type": "stage direction",
   "text": "(heated)"
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "That's a powerful force. Research\nshould be done -"
  },
  {
   "type": "speech",
   "character": "EATON",
   "text": "Oh, it will be, Dr. Jones, I assure\nyou. We have top men working on it\nright now."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Who?"
  },
  {
   "type": "speech",
   "character": "EATON",
   "text": "Top men."
  },
  {
   "type": "stage direction",
   "text": "Indy exchanges a look with Brody."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "We may be able to help."
  },
  {
   "type": "speech",
   "character": "EATON",
   "text": "We appreciate that. And we won't\nhesitate to call on you."
  },
  {
   "type": "stage direction",
   "text": "(dismissing them)"
  },
  {
   "type": "speech",
   "character": "MUSGROVE",
   "text": "Thank you all. Thank you again."
  },
  {
   "type": "stage direction",
   "text": "Indy looks them over coldly. He gets up, sullen."
  },
  {
   "type": "location",
   "text": "EXT. PENTAGON STEPS - DAY"
  },
  {
   "type": "stage direction",
   "text": "Indy, Brody and Marion emerge from the building. Brody bids\nthem farewell and moves off in another direction. Marion\nclings to Indy's arm in an energetic, very feminine way,\nscolding him."
  },
  {
   "type": "speech",
   "character": "MARION",
   "text": "Well they aren't going to tell you,\nso why don't you just forget it. I'd\nthink you'd had enough of that damn\nArk. Just put your mind on something\nelse."
  },
  {
   "type": "stage direction",
   "text": "Indy stops, looking across the river, his mind occupied."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "Yeah, like what?"
  },
  {
   "type": "stage direction",
   "text": "Marion makes a face, then puts her arms around his neck and\nplants a humdinger of a kiss on his mouth. It goes on a while.\nFinally they break."
  },
  {
   "type": "speech",
   "character": "INDY",
   "text": "It's not the Ark... but it'll have\nto do."
  },
  {
   "type": "stage direction",
   "text": "They move down the steps, smiling."
  },
  {
   "type": "location",
   "text": "INT. GOVERNMENT WAREHOUSE"
  },
  {
   "type": "stage direction",
   "text": "The Ark of the Covenant sits in a wooden crate. A wooden lid\ncomes down and hides it from view. The lid is solidly nailed\nto the crate as we read the stenciled message on top -\nTOP SECRET\nARMY INTEL. #9906753\nDO NOT OPEN!\nThe hammering is completed and hands shift the heavy crate\nonto a dolly.\nTHE END CREDITS ROLL AS WE SEE -\nA Little Old Government Warehouseman begins pushing the crated\nArk down as aisle. Soon we see that the aisle is formed by\nhuge stacks or crates. They come in many shapes and sizes,\nbut when it comes right down to it, they all look like the\none that holds the Ark. All have markings like the message\nwe've just seen. Pretty soon we're far enough and high enough\naway from the Little Old Government Warehouseman to see that\nthis is one of the biggest rooms in the world. And it is\nfull. Crates and crates. All looking alike. All gathering\ndust.\nAnd then we notice that the Little Old Government\nWarehouseman, pushing his new crate ahead of him, has turned\ninto another aisle and disappeared from view.\nFADE OUT:\nTHE END"
  }
 ]
}