{
 "movie_url": "https://imsdb.com/scripts/Strange-Days.html",
 "movie_title": "Strange Days",
 "movie_script": [
  {
   "type": "introduction",
   "text": "S T R A N G E   D A Y S\nby James Cameron & Jay Cocks\nfrom a story by James Cameron\nAUGUST 11, 1993"
  },
  {
   "type": "stage direction",
   "text": "1:06 AM DEC 30, 1999\nBlackness.  We hear:"
  },
  {
   "type": "speech",
   "character": "VOICE",
   "text": "Ready?"
  },
  {
   "type": "speech",
   "character": "SECOND VOICE (LENNY)",
   "text": "Yeah.  Boot it."
  },
  {
   "type": "stage direction",
   "text": "A burst of bright white static exploding across the\ndarkness.  A high whine on the audio track gives way to\nstreet sounds and rapid breathing.\nAN IMAGE wavers and stabilizes: A nervous POV.  We're in a\ncar, sitting in the backseat, and we're nervous, the view\nswinging around, showing the street rolling by outside the\nwindows, then whipping back to the two guys in the front\nseat.\nOur POV looks down at a SMALL RECORDING DEVICE in \"our\"\nhands.  A red LED is flashing.  We slip the recorder into\na coat pocket."
  },
  {
   "type": "speech",
   "character": "OUR VOICE",
   "text": "Okay.  It's goin'.  I'm recording."
  },
  {
   "type": "stage direction",
   "text": "The guy riding shotgun, LANE, is just pulling a pantyhose\nover his head, smearing his features into a pig-like mask.\nHe turns, DIRECTLY TO THE LENS, pissed off."
  },
  {
   "type": "speech",
   "character": "LANE",
   "text": "Good one, dickhead.  Thanks for\nwaitin' till I get this fuckin thing\non.  You tryin' ta I.D. me, or\nwhat?"
  },
  {
   "type": "stage direction",
   "text": "He tosses another pantyhose right at us and we catch it.\nOur POV looks down, into the pantyhose, which comes up\nover our field of view.\nWe realize: this is not some ride-along verite video.\nWE ARE ONE OF THESE GUYS.  Real honest-to-God point of\nview, with no cuts, no music.  This is not film, it is\nhuman experience.\nThe driver is a Hispanic guy named \"SPAZ\" DIAZ.  Lane is a\nwhite guy who looks very strung out.  Couple of\ncrackheads.  The car is a mid-seventies barge, piebald\nwith primer."
  },
  {
   "type": "speech",
   "character": "LANE",
   "text": "Next alley... just pull in slow."
  },
  {
   "type": "stage direction",
   "text": "(turning to us)"
  },
  {
   "type": "speech",
   "character": "LANE",
   "text": "Hurry up will ya.  Here."
  },
  {
   "type": "stage direction",
   "text": "He hands us a big stainless steel revolver.  The POV looks\ndown as our shaky hands snap open the cylinder, check the\nrounds, snap it closed.\nDiaz pulls the barge into an alley.  The headlights\nilluminate overflowing dumpsters.  A Chicano busboy is\nmaking trash runs out the back door of a restaurant, which\nhe has chocked open.  The busboy goes back inside."
  },
  {
   "type": "speech",
   "character": "LANE",
   "text": "Let's go."
  },
  {
   "type": "stage direction",
   "text": "Out of the car, quickly, our own breathing loud in our\nears.  We even hear our own heartbeat, racing now.\nThrough the door, after Lane, moving fast.\nInto the kitchen.  Fluorescent glare.  The busboy turning,\nsurprised, Lane putting the shotgun in his face.  Freezing\nhim.  Lane puts a finger to his lips: \"quiet\" in any\nlanguage.\nOur hand puts the magnum in the THAI COOK's face.  We get\nthem down on the greasy floor, Lane controlling them with\nthe shotgun.  He looks at us, snaps his eyes toward the\nfront room.\nWe hear voices as we approach the swing door.  Go through.\nWhip pan left, then right.  Scoping the layout.  Low-rent\nTHAI place.  Red wallpaper.  Closing time.  Middle-aged\nThai OWNER, by the cash-register, counting money.  Young\nThai WAITRESS, cleaning up.  They look up, stunned, as we\nput the gun on them."
  },
  {
   "type": "stage direction",
   "text": "(shouting, edgy)"
  },
  {
   "type": "speech",
   "character": "OUR VOICE",
   "text": "Don't move, don't talk, don't do\nnothing."
  },
  {
   "type": "stage direction",
   "text": "Our POV is whipping around, from the front door to the\nowner to the kitchen where Lane is standing in the doorway\ncovering the cook and busboy, back to the owner as he\nsteps back from the cash-register.\nWe scoop up the big wad of bills: seven, eight hundred\nbucks in tens and fives.\nNow yelling, herding the owner and the waitress into the\nkitchen, the owner trying to calm the girl in singsongy\nThai, Lane shouting at him to shut up.\nInto the walk-in cooler.  The steel door closes on four\nscared pair of eyes.  POV looking around, seeing... a\ndish-rack.  Our hand pulls out a spoon, drops the spoon\nhandle through the hole in the cooler door-latch.  Locking\nthem in.\nLane heading out the back door.  Laughing, as he looks at\nthe wad of cash our hand is waving in front of him.\nWe follow Lane to the car.  Snap a look down the alley one\nway, then the other.\nShit!  Cop Black-and-White pulling into the far end of the\nalley.  Heartbeat goes triple time.  Scrambling into the\ncar.\nDoor not even closed and SPAZ has it in reverse, burning\nrubber as he launches back down the alley.\nSCRUNCH!  The car grinds along one wall as SPAZ steers\nwildly backward.  Sparks right next to us.  Then--\nKBOOM!  As we slam into a dumpster and push it right out\ninto the street.\nThe cop has his lights and siren on, and is roaring at us\nas SPAZ cranks the wheel and punches it down the street.\nHe curses in English and Spanish as he weaves between\ncars.  We pull off the stocking to see better.\nThe cop car surges onto the street behind us.\nLooking ahead.  A red light.  Cars stopped, blocking the\nway.  Cutting to the right, onto the sidewalk, around the\ncars, into the intersection.\nA near miss with cross traffic, then accelerating.\nAnother red light ahead."
  },
  {
   "type": "speech",
   "character": "LANE",
   "text": "Don't stop!"
  },
  {
   "type": "stage direction",
   "text": "Truck entering the intersection.  Everyone yelling.  SPAZ\ncuts the wheel but too late...\nClipping the truck and spinning.\nThe street outside smearing past like the view from a\nTilt-a-whirl.\nThen KBLAM!  Hitting something, God-knows-what, and\nlaunching up and over, and--\nKRUNCH!  Crushing metal and an explosion of broken glass.\nIt gets quiet and still.  Tinkling glass as Lane moves.\nThen SPAZ is screaming.  The car is upside down.\nCrawling out of the side window.  A frenzy now.\nWhip pan to see the cops pulling up.\nThen whipping back to the wreck.  The engine is burning.\nFlames spreading rapidly.  SPAZ inside, pinned, upside\ndown, blood pumping across his face.\nOur hands pulling Lane out.  He comes up running.\nWe run after him, sprinting toward the welcoming darkness\nof an alley.\nPanting breath and heartbeats and sirens and somebody\nyelling.\nGunshots.  Looking back.  Cops next to their car, firing.\nAhead, Lane running into shadow.\nThen a door opening, a man coming out of a metal firedoor.\nLane grabbing him, throwing him out of the way, holding\nthe door open as we dive through into--\nA stairwell.  Lane sprinting up, two steps at a time.\nTrying the door at the second floor landing.  Locked.\nShit.\nRunning up.  Dizzying whirl as we run, up and up.\nThe POV is finally broken by a...\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  UNDERGROUND GARAGE"
  },
  {
   "type": "stage direction",
   "text": "But we don't know where we are yet.  We see a man in\nextreme close-up: just his eyes and mouth.  The eyes are\nclosed, the eyeballs tracking under the lids, like he is\nwatching a movie in there.  This is LENNY."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "This is great... the doors are all\nlocked.  Who are these losers,\nfriends of yours?"
  },
  {
   "type": "stage direction",
   "text": "CUT TO:\nBACK TO POV as we reach the fifth floor landing.  Lane is\ncoming unglued as he finds this door locked.  We look\ndown, see cops coming two floors below.  One cranks off a\ncouple rounds at us and we snap back from the railing.\nPounding up the last flight.  Finally!  The door is\nunlocked.\nBlasting through it, behind Lane, onto the roof.  Running\nall out past AC units and pipes, air vents.  Looking up:\nan LAPD helicopter orbiting close.  It flicks the xenon\nonto us and we are running in a vibrating circle of blue\ndaylight.\nRunning along the edge of the roof.  Looking down.  Car\nburning upside down in the street below.  The gas tank\nexplodes, filling the street with orange light.  We don't\nslow.  We're running all out."
  },
  {
   "type": "speech",
   "character": "LENNY (V.O.)",
   "text": "Wow... the gas tank is a nice touch.\nOh, oh, end of the line boys."
  },
  {
   "type": "stage direction",
   "text": "Ahead, in POV we see the edge of the roof coming up.\nBeyond it is another building, about ten feet lower and\nseparated by a 20 foot alley.\nBut Lane doesn't slow down.  He leaps across the void and\nmakes it to the other building, landing in a sprawl.\nWe reach the edge and look down.  Six stories.  No ladders\nor fire-escapes.  Whip to behind us.  Cops running across\nthe roof."
  },
  {
   "type": "speech",
   "character": "LANE",
   "text": "Come on!  Fucking jump man!"
  },
  {
   "type": "stage direction",
   "text": "The POV backs up from the edge and then runs toward it...\nOut into the void.  Moving... airborne... then...\nWHAM!  Right into the parapet wall.\nSlipping down.  Brick wall right in our face.  Bloody\nfingers grabbing for a rusty piece of pipe running along\nthe edge.\nLooking down... feet dangling over a sixty foot drop.\nA cat walking through a patch of light in the alley below,\noblivious.\nBreathing raspy.  Snapping a look up as the pipe gives\nway.\nA keening whine coming from us as we scramble to climb up\nbut...\nSnapping a look down--\nWalls rushing past, sound of wind, and our own raspy\nscream--\nGround rushing up--\nSplit second impression of a cat, looking up, yowling and\nrunning out of the way as--\nPavement fills frame.  A burst of violent red light.\nSound like a gunshot... but no echo.\nOnly silence.  And blackness.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  UNDERGROUND PARKING GARAGE"
  },
  {
   "type": "stage direction",
   "text": "Lit by miles of fluorescent.  Empty and echoing.  Close on\nLenny.  He has something on his head.  Something that\nlooks like a mutated set of Walkman headphones, except\nthey have little gecko fingers that fit along the temples\nand over the forehead.  PLAYBACK \"TRODES\".  Lenny whips\noff the trodes, gasping as if he got gutpunched."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Goddamnit!  You know I don't deal in\nsnuff.  How many times I hafta tell\nyou?!"
  },
  {
   "type": "stage direction",
   "text": "Lenny is with a guy everybody knows as \"TICK\", a pale-\nskinned creature of the night in T-shirt and leather\njacket.  Tick is a bottomfeeder in the techno-underground\nof the near future."
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "Don't have a fucking coronary, Lenny."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Well you could've at least warned\nme.  You know I hate the zap... when\nthey die.  It just brings down your\nwhole day.  Jeez, Tick."
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "Sorry."
  },
  {
   "type": "stage direction",
   "text": "LENNY NERO is low thirties.  Handsome.  Charming.  And you\nbetter check to see if you still have your ring after you\nshake with him.  He is wearing an expensive Italian\njacket, and what he thinks of as a \"power tie.\" His Rolex\nisn't real.  His greasy hair is too long and curls around\nhis collar.  He needs to shave.  A little sleazy.  But he\nhas energy, and heavy street smarts.\nLenny is sitting on the hood of his '97 BMW 1035i.  Tick\nis facing him, sitting in the back of his beat-to-shit\n70's van.  There are a lot of tapes and tech stuff piled\ninside the van.  Lenny has a Haliburton case open next to\nhim, like a drug dealer.  In fact the whole setup looks\nlike a drug deal, but it's not.  Though it is illegal.\nThe case holds Lenny's personal playback deck, his trodes,\nand a rack of the little tapes in which he deals.  They\nare about the size of DAT tapes, and hold about 30 minutes\nof sensory experience... everything a person sees, hears,\nand feels... recorded directly from the cerebral cortex at\nthe moment it is happening."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "How'd you get the tape?  Why didn't\nthe cops put it in evidence?"
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "With all the blood I guess they\ndidn't see the rig.  Guy had it\nunder a wig."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Yeah, but how'd it get to you?"
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "I got ways, Lenny, I got ways."
  },
  {
   "type": "stage direction",
   "text": "(off Lenny's impatient\nlook)"
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "Okay, okay... I got a deal with some\na the paramedics.  My guy pages me\nand I pick it up at the morgue.  So\nwhaddya think?  This clip's gotta be\nworth at least a grand.  Right?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Tick.  Not to dash your hopes, but I\ndon't deal this kind of product, you\nknow that.  I'll give you four for\nit, cause I've gotta cut off the\nlast bit.  And my customers want\nuncut."
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "Fuck that!  The last part's the\nbest.  You dry-dive six stories and\nblammo!  Jack right into the Big\nBlack."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I don't deal black-jack clips!  It's\npolicy.  I got ethics here."
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "Yeah, when did that start?  Come on,\nman!  It's what people want to see,\nand you know it."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "So lay it off to somebody else."
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "Come on, Lenny.  I got expenses.  I\ngot to get this rig fixed.  Look at\nit..."
  },
  {
   "type": "stage direction",
   "text": "Tick holds up a zip-lock bag containing the Walkman-sized\nstainless steel CORTICAL RESONANCE RECORDER, the record\ndeck we saw earlier in the POV.  Also in the bag is the\nSQUID NET, a matrix of sensors designed to conform to the\nhuman head (this is different from playback trodes).  The\nwhole works are covered with congealed blood."
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "Give me six at least.  This's a good\nclip, here.  Gets you pumpin'."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Yeah, well, the first part's okay.\nBetter than the usual soaps you\nbring me."
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "Now that is cold, Lenny.  I always\nbring you choice."
  },
  {
   "type": "stage direction",
   "text": "Lenny fishes around in a cardboard box at Tick's feet,\npulling out a tape."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Sure, like this low-grade shit here,\nsome girl in a fight with her\nboyfriend... it's a test-pattern.\nNothing happens.  I'm snorin'."
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "Hey, you're always saying, 'Bring me\nreal life.  Bring me street life.\nAnd, like, one man's mundane and\ndesperate existence is another man's\nTechnicolor.'"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I said that?  Look, I'll take it for\nfive, and you'll make out okay,\nbecause in this case it's pure\ncream, you don't have to cut\nanything back to the wearer."
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "Ha!  That's for fucking sure."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "What else you got?"
  },
  {
   "type": "stage direction",
   "text": "CUT TO:\nMONTAGE/SERIES OF SHOTS\nLenny in his BMW, driving through the LA streets.\nStreetlights and neon flare across the windshield in a\ncalligraphy of light.  Lenny works the cellular, gets\nmessages on his DIGITAL PAGER, weaves in and out of\ntraffic -- punches the buttons on his radio, changing\nstations all the time.  Raw, nervous energy: like a kid\nwho can't stay still.  It's a hard hustle in the big food\nchain."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Look, Jerr.  I'm nothing if not a\nman of my word.  I'll drop the money\nby tomorrow, next day latest.  It's\na little crazed right now.  Yeah, on\nmy mother's eyes, I swear.  Thanks,\nbuddy."
  },
  {
   "type": "stage direction",
   "text": "(hangs up)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Prick."
  },
  {
   "type": "stage direction",
   "text": "(to the car ahead\nhonking)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "What kinda move you call that?!\nLemmings."
  },
  {
   "type": "stage direction",
   "text": "Lenny turns up the radio.  SELECTED DRIVE-BY IMAGES, as\nthe talk-radio provides commentary.\nLenny's car passing under glowing Santa Clauses on the\nlight-poles.  Banners proclaiming the coming \"Millennium\nLA\" festivities."
  },
  {
   "type": "speech",
   "character": "TALK-RADIO HOST",
   "text": "... it's a little after 2 am on\nDecember 30th, 1999... the second to\nlast day of the whole darn century,\nand the phone lines are open.  Dan\nfrom Silverlake, you're on the air."
  },
  {
   "type": "stage direction",
   "text": "Transition to a rougher section of town.  Buildings roll\nby endlessly, tagged by gangs in graphic tribal patterns.\nsome are burnt-out ruins."
  },
  {
   "type": "speech",
   "character": "DAN FROM SILVERLAKE",
   "text": "Uh, hi."
  },
  {
   "type": "speech",
   "character": "HOST",
   "text": "So Dan, are you looking forward to\nthe New Year?"
  },
  {
   "type": "stage direction",
   "text": "A building is burning out of control.  In the foreground,\nsilhouetted, a drunk sleeps soundly on a bus-bench."
  },
  {
   "type": "speech",
   "character": "DAN",
   "text": "Not really.  I mean what's the\npoint?  Nothing changes New Years\nday.  The economy sucks, gas is over\nthree bucks a gallon, fifth grade\nkids are shooting each other at\nrecess... the whole thing sucks,\nright?  So what the hell are we\ncelebrating?"
  },
  {
   "type": "stage direction",
   "text": "A shanty-camp of homeless people under a freeway overpass.\nHomes made of cardboard and carpet remnants.  Their lives\nin shopping carts."
  },
  {
   "type": "speech",
   "character": "HOST",
   "text": "You're a glass-is-half-empty kind of\nguy, aren't you Dan?  Well I for one\nhappen to think that us making it\n2000 years is worth celebrating--"
  },
  {
   "type": "stage direction",
   "text": "Lenny cuts him off, punching to another station, and MUSIC\nblasts.  Something fast... a rap-metal hybrid.  Anger and\nenergy.\nWE CUT IN fast blitzes of images like a burst of automatic\nweapons fire: helicopters on patrol, people running in the\nstreets, buildings smoldering, fists raised, shouting\npeople, paramedics rushing a body into an ambulance,\nKorean store owners armed to the teeth, a body covered by\na yellow plastic sheet, blood running down the gutter.\nCops in riot gear, with M-16s, on patrol in a Hispanic\nneighborhood.\nBACK TO LENNY coming out of a bar with a nervous\nbusinessman.  We don't hear the conversation.  MUSIC OVER.\nLenny palms a roll of bills from the guy as he slips a\nsquid tape into the pocket of the businessman's suit\njacket.  Lenny claps him on the shoulder and walks away.\nLenny's beeper goes off and he pauses to look at the\nnumber.\nON LENNY DRIVING.\nAhead, through the windshield we see a police checkpoint.\nThe cops have thrown a block across the street and are\nshinning their lights in the cars as they creep through.\nLenny slaps his ID against the side window with one hand,\nnot missing a beat in his conversation.  This is just part\nof life in LA."
  },
  {
   "type": "stage direction",
   "text": "(on cellular)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Jimbo.  I'm there, Jimmy.  Right now,\ncan't you hear me knockin'?"
  },
  {
   "type": "stage direction",
   "text": "CUT TO LENNY working his way through a crowded club, music\npounding.  Strobe lights.  We don't see much.  He hears\nhis phone rings and pulls the tiny DIGITAL CELLULAR out of\nhis breast pocket.  Sticks a finger in his other ear and\nanswers.\nCUT TO LENNY, back in the BMW, on the streets.  On the\nmove."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "-- so you line up the talent, shoot\nthe clip, get it to me by Monday.\nOK?  Client wants a guy and two\ngirls, the guy wears... yeah, I\nknow, thinks he's being original.\nGirls have to be young.  So don't\nuse your mother like you usually do.\nYeah, you too, pendejo.  And no big\ntits... French tits.  That's it...\nlike Champagne glasses... you got\nit.  What a pro.  Page me."
  },
  {
   "type": "stage direction",
   "text": "LENNY PULLS UP to the security checkpoint of a gated\ncommunity.  The white upper-middle class hiding behind\nwalls and paid security."
  },
  {
   "type": "speech",
   "character": "LORI",
   "text": "If you read the Bible, Mark, you'd\nknow that there won't be another\nthousand years.  Right now we are in\nthe Last Days, as foretold in the\nbook of--"
  },
  {
   "type": "speech",
   "character": "HOST",
   "text": "The Last Days?  You mean the coming\nof the Apocalypse, right?  The\nRapture?"
  },
  {
   "type": "stage direction",
   "text": "Lenny fishes around in the glove compartment, flipping\nthrough about twenty plastic security passes for different\nparts of town, all bogus.  He finds the right one and\nflips it onto the dash."
  },
  {
   "type": "speech",
   "character": "LORI",
   "text": "Yes, that's right.  You only have to\nlook at the signs... there are wars\nand rumors of wars--"
  },
  {
   "type": "stage direction",
   "text": "The RENT A COP at the guardshack hits him with his light."
  },
  {
   "type": "stage direction",
   "text": "(lying)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I live here."
  },
  {
   "type": "stage direction",
   "text": "The cop waves him through.  Lenny is the right color."
  },
  {
   "type": "speech",
   "character": "HOST",
   "text": "Now just so the rest of us know how\nmuch time is left, when is the\nRapture supposed to hit, exactly?\nIs it midnight New Year's Eve?"
  },
  {
   "type": "stage direction",
   "text": "And WE CUT to a burst of news videotape, enlarged, noisy,\ndistorted... images of a great gathering in the desert,\nthe faithful waiting for God's sign as the millennium\napproaches."
  },
  {
   "type": "speech",
   "character": "HOST",
   "text": "Is that midnight LA time, or Eastern\nStandard or what?  I mean, what time\nzone is God in, anyway?"
  },
  {
   "type": "speech",
   "character": "LORI",
   "text": "I pray for you all."
  },
  {
   "type": "stage direction",
   "text": "Lenny's BMW cruises past an overturned burning car.  There\nis no-one around.  He barely glances at it.  Common sight\nthese days.  If it is the end of the world, Lenny's not\ngoing to let it break his rhythm."
  },
  {
   "type": "stage direction",
   "text": "(cellular)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I just got something in, Bobby, you\nmight appreciate.  A 211 at a Thai\njoint goes south, and these three\nscuzzballs end up in a gun-and-run.\nIt's a beauty, two thumbs up.\nParental discretion advised.  I'm\ntalking it's the master, not some\nstepped-on copy.  One of a kind."
  },
  {
   "type": "stage direction",
   "text": "LENNY INSIDE A GLOOMY BAR.  He slides into a booth with\nNORM SKINNER, a paunchy guy with thinning hair who dresses\ntoo young.  A pretty, stoned-looking girl is leaning\nagainst Skinner."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Yo, Skinner.  The Skin Man."
  },
  {
   "type": "stage direction",
   "text": "(fingering his\njacket)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Red leather.  Nice feminine touch."
  },
  {
   "type": "stage direction",
   "text": "(laughing)"
  },
  {
   "type": "speech",
   "character": "SKINNER",
   "text": "Fuck you, Nero."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Whattya got for me?"
  },
  {
   "type": "stage direction",
   "text": "CUT TO: POV of a woman writhing above us in ecstasy.\nLovemaking in point-of-view.  We look down, see OUR BODY,\na woman's body... our hands moving over the other woman's\ntorso.  The image is dark, a primal impression.  Sound of\nharsh breathing, rustling sheets.\nBACK TO LENNY in the booth with Skinner.  Lenny has\nSkinner's tape running in a playback deck clipped to his\nbelt, next to his pager.  He is hunched over the table,\n\"sampling\" the merchandise by touching a few of the trode\npads to his temple without putting on the whole headset.\nLike a coke dealer taking a little on the fingernail."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Yeah, I can use this..."
  },
  {
   "type": "stage direction",
   "text": "(to the stoned girl)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "... but honey you gotta move your\neyes slower next time.  It's too\njerky."
  },
  {
   "type": "speech",
   "character": "SKINNER",
   "text": "It was her first time, Lenny.  Cut\nher some slack."
  },
  {
   "type": "stage direction",
   "text": "TIGHT SLOWMO SHOTS... ABSTRACT: SQUID tapes and money\nchanging hands.  A SQUID tape sliding sensuously into a\ndeck.\nTIGHT CU LENNY, through the windshield of his car.  Neon\nmoving over him.\nNEWS FOOTAGE: LAPD Aerospatiales circling, their xenon\nlights turning night into day, giving the impression of a\nfuturistic war zone.\nINSIDE THE COCKPIT, the infrared camera shows green-screen\nimages of people in cars, in their homes... like footage\nof hyenas shot at night in total darkness.\nThe impression is of a society under siege, an occupied\nnation... a watched society where the camera eye and the\npolice spotlight define our reality."
  },
  {
   "type": "speech",
   "character": "HOST",
   "text": "Go ahead, caller, you're on the air."
  },
  {
   "type": "speech",
   "character": "VOICE",
   "text": "My name's DeWayne, and I got a New\nYear's resolution for the po-lice.\nHey, yo Five Oh, you better get down\nwith 2-K."
  },
  {
   "type": "stage direction",
   "text": "CRASH Unit cops with a bunch of Salvadoran gang kids\nracked up against a storefront.  A dozen 16 year-old girls\nand guys, hands against the wall, acting bored, as the\ncops walk up and down, reading IDs."
  },
  {
   "type": "speech",
   "character": "HOST",
   "text": "2-K?  What's that DeWayne?"
  },
  {
   "type": "stage direction",
   "text": "A group of cops have two black guys proned out.  Nearby a\ncrowd jeers, shouting insults.  A black kid throws a beer\nbottle and one of the cops chases him into the crowd."
  },
  {
   "type": "speech",
   "character": "DEWAYNE",
   "text": "2-K.  The big two thousand.  Comin\ntomorrow night.  Out with the old\nand in wit da new.  See for the Man,\nno new is good new, what I'm sayin.\nHe like to keep it the way it is.\nBut we going to take it, make it\nnew, make it our own.  History gonna\nstart right here, right now--"
  },
  {
   "type": "stage direction",
   "text": "LENNY cuts him off as his cellular call connects."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Hi, Dave, this is Lenny."
  },
  {
   "type": "stage direction",
   "text": "(pause)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Nero.  Lenny Nero.  That's right.\nOh, is it late?  Sorry.  It's just\nthat I have something that might be\nof interest, and since I always call\nyou first--"
  },
  {
   "type": "stage direction",
   "text": "(pause)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Uh, huh.  Well, what would be a good\ntime?  Okay, sure.  Catch you then."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:\nA GAME ARCADE.  Light and noise as the customers drop\nquarters for synthetic thrills.  Lenny is talking to a\nnice-looking street kid in his early 20's named EDUARDO."
  },
  {
   "type": "speech",
   "character": "EDUARDO",
   "text": "Let me get this straight... you\ngonna pay me 200 bucks to put on a\nhair net and bang some beautiful\nbabe.  I don't know, I gotta think\nabout this."
  },
  {
   "type": "stage direction",
   "text": "Lenny smiles and pulls out a SQUID-net.  He motions\nEduardo into the shadows."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Okay, let's get you wired up.  I\nhope this axle grease you got in\nyour hair doesn't screw up the squid\nreceptors."
  },
  {
   "type": "speech",
   "character": "EDUARDO",
   "text": "What's all this squid shit?"
  },
  {
   "type": "stage direction",
   "text": "As Lenny works, fitting the network of sensors over\nEduardo's head, he holds class."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Superconducting QUantum Interference\nDevice.  SQUID.  Got it?  There's\ngonna be a test."
  },
  {
   "type": "speech",
   "character": "EDUARDO",
   "text": "Hey, fuck you, man."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Easy, Eduardo, easy.  Preserve a\nsense of humor at all times.  Okay,\nthe receptor rig... what I'm putting\non your head... sends a signal to\nthe recorder."
  },
  {
   "type": "stage direction",
   "text": "(Lenny holds up the\nrecorder)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "See we call it \"being wired,\" but\nthere's no wire.  You gotta keep the\nrecorder close... five, six feet\naway max, like in your jacket pocket\nby the bed or wherever you're going\nto close escrow, know what I mean?"
  },
  {
   "type": "speech",
   "character": "EDUARDO",
   "text": "Yeah, right."
  },
  {
   "type": "stage direction",
   "text": "Lenny fits a wig from his briefcase over Eduardo's head,\nturning him into a headbanger.  Eduardo scowls at this\nset-back to his suavete."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Some tips.  Don't dart your eyes\naround.  Don't look in the mirror or\nyou'll ID yourself.  OK?  You got a\nhalf hour of tape, so give me some\nlead-in to the main event.  But\ndon't wait too long, I don't want to\nbe going out for popcorn.  And don't\nact natural.  Don't act at all.\nJust forget the thing is on.  Got\nit?"
  },
  {
   "type": "speech",
   "character": "EDUARDO",
   "text": "No problem."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "A star is born."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  TRAIN YARD - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "A woman's feet moving along the steel rail of a train\ntrack at night.  The woman has no shoes, her feet bare.\nIRIS stumbles along the track, clutching one shoe\npointlessly to her chest.  She is swearing and crying,\nrunny mascara leaving two tragic streaks down her pale\nface.  Despite this we see that she is attractive, though\nher dress and make-up seem designed to convey overt\nsexiness.  Her white skin is complemented by a wild mane\nof curly red hair.\nShe is in her early twenties, and the harshness of her\nlife has just begun to harden her features.  She looks\nlost and without hope, in fear of her life.  Her breath\ncomes in hitching sobs, and her eyes are wild.\nShe runs between cold steel walls of freight cars, looking\nbehind her frequently.  A police helicopter is circling.\nIts xenon beam plays over the train yard, sweeping over\nthe cars.  She hunches into the shadows of a freight-car\nas the beam passes over.  Looking under the cars she sees\nan LAPD patrol car cruising down a street adjoining the\nyard, its searchlight sweeping toward her.  It moves on.\nShe continues her run, moving away from the direction of\nthe patrol car.  She reaches a chain-link fence.  Crying,\nshe scrambles over it, cutting her hands and ripping her\ndress.  Another patrol car passes two blocks away.  She\ncrouches in the tall grass until it rounds a corner out of\nsight.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  ALLEY AND STREET - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Iris sprints down an alley between buildings.  Rats\nscatter into the shadows ahead of her.  She doesn't seem\nto notice.  All she cares about are the police lights, and\nthe sound of the helicopter droning, circling.\nShe pauses at the mouth of the alley, scanning the well-\nlit street beyond.  There are people here: downtown low-\nlife street people.  A half-block away is a brightly lit\nsign marking the entrance to a Red-Line subway station.\nShe walks along the sidewalk, her eyes on the sign,\nfeeling exposed as she walks openly, her heart pounding.\nShe is a mess, but in this section of town people barely\nglance at her.\nLOW ANGLE on her bare feet, standing out amid the shoes\nand boots of winter.\nSHE CROSSES the street, and reaches the sidewalk just as a\nblack-and-white rounds the corner at the end of the block,\nbehind her.\nIN THE CRUISER are TWO COPS, who are scanning the street.\nThey look intense.  Revved up.  They are BURDEN SPREG, a\nmassive, barrel-chested street-lifer in his mid-forties,\nand DWAYNE ENGELMAN, an aggressive hard-on in his twenties\nwith a brush cut, a Nautilus body, and a face like a\nferret."
  },
  {
   "type": "speech",
   "character": "ENGELMAN",
   "text": "She's a hooker, vice'll have her in\nthe book.  We can pick her up later."
  },
  {
   "type": "speech",
   "character": "SPREG",
   "text": "No.  Now."
  },
  {
   "type": "stage direction",
   "text": "IRIS knows the cops are behind her.  She is terrified to\nturn.  Finally she can't stand it any more.  She breaks\ninto a run.  The patrol car speeds up suddenly, roaring\nafter her.\nIris sprints along in her bare feet, all-out like a track\nrunner.  The black-and-white screeches to the curb next to\nher and the cops jump out.\nIris hits the stairs down to the subway station at a full-\ntilt boogie, knocking down some poor old guy whose\ngroceries go flying.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  SUBWAY STATION AND TRAIN"
  },
  {
   "type": "stage direction",
   "text": "Iris trips on the landing, spins sprawling across the\nfilthy tile floor, and comes up running.  Panting with\nfear and exertion she clears the turnstiles like a\nhurdler.\nThe cops pound down the stairs two at a time.  Spreg draws\nhis 9mm.  In his eyes we see an unaccountable craziness...\na hunter who has as much at stake somehow as the prey.\nStreet people fall back as Spreg thunders through them.\nThey aren't about to get in the way of this juggernaut cop\nand his boy wonder.\nThe two cops reach the platform.  No Iris in sight.\nMOVING WITH THEM as they slow to a walk, scanning.  A\ncouple of low-lifes standing around, waiting for trains,\neye them warily as Spreg gets a call on his Rover."
  },
  {
   "type": "speech",
   "character": "DISPATCHER (V.O.)",
   "text": "Do you request back-up?"
  },
  {
   "type": "speech",
   "character": "SPREG",
   "text": "Negative.  Suspect is a black male,\nage 35 to 40.  We're handling it."
  },
  {
   "type": "stage direction",
   "text": "A train pulls into the station with a whoosh of air.  A\nfew people board.  There is only the sound of the cops'\nfootsteps as they move along the empty platform.  With a\npneumatic hiss the train's doors begin to close.\nSuddenly Iris breaks from behind a column up ahead at a\nfull sprint.  Spreg unleashes his size 13 cop shoes,\nthundering along the platform to intercept her.  Engelman\nstraight-arms his pistol."
  },
  {
   "type": "speech",
   "character": "ENGELMAN",
   "text": "FREEZE!"
  },
  {
   "type": "stage direction",
   "text": "Iris clears the doors just as they hiss shut.  Her\nmomentum carries her clear across the car, where she slams\ninto the far wall and staggers back, almost falling.  She\ngasps for breath and looks up to see...\n... Spreg crashing against the outside of the doors she\njust came through as the train starts to move.  He tries\nto force the doors apart... can't.  He aims his gun\nthrough the window.\nThinking fast Iris dives to his side of the car and\npresses herself up against the solid wall next to the\ndoor, where he can't see her.\nOUTSIDE, Spreg is running next to the accelerating train.\nHe swings his pistol, smashing the window with the butt.\nIris screams as Spreg lunges through the opening next to\nher like some uniformed nightmare and grabs her.  He is\nstill running alongside, pulling on her.  Trying to drag\nher right out through the window.\nShe struggles.  Bites his beefy hand.  He swears and lets\ngo.  Then makes one last grab.  Gets his fingers into her\nlong mane of hair.  Yanks on her.  She comes half out the\nwindow, screaming.\nThen... RIP!  The hair pulls off her head.\nSpreg drops away, behind the speeding train, holding a\nred wig.  He looks at it stupidly, then raises his pistol\nand fires at Iris.\nShe jerks back through the window and drops to the floor.\nA couple of shots hit the metal outside.  We see Iris has\nshort hair, platinum white.  In it are a few of the many\npins which held the wig securely in place.  She gasps for\nair, sobbing and hugging her knees, trembling all over.\nSPREG STANDS on the platform, watching the train\ndisappear, as Engelman runs up.  Spreg looks at the wig in\nhis hand, disgusted.  He turns it and looks inside, at the\ncap.\nCLOSE ON THE CAP inside the wig: there is an intricate\nnetwork of sensors in a grid over the entire underside of\nthe wig.  The sensors are connected by wires, in a pattern\nlike the veins of a leaf, bundling to a small, flat metal\nbox, the size of a cigarette case.  It is a SQUID NET.\nIris was wired.  Spreg just stares at the SQUID NET, eyes\ngoing crazy wide."
  },
  {
   "type": "speech",
   "character": "ENGELMAN",
   "text": "Oh shit."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "EXT./ INT.  LENNY'S APARTMENT - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "IT'S 4 AM.  Lenny trudges through a heavy security gate\ninto the center court of his ratty building.  The pool\nfurniture is in the pool.  Gang graffiti marks the walls.\nBars on all the windows.  One of the doors looks like\nsomebody opened it with an ax.  The pool lights give the\nplace an eerie, dead glow.  Can out slick Lenny really\nlive in this dump?\nThrough a barred window we see Lenny approaching as we\nhear the OUTGOING MESSAGE on his answering machine in the\nF.G.\nBEEP.  And..."
  },
  {
   "type": "speech",
   "character": "IRIS (V.O.)",
   "text": "Lenny, goddamn it, you got to be\nthere, you got to help me, come on,\npick up, pick up..."
  },
  {
   "type": "stage direction",
   "text": "Through the window we see Lenny fishing in his pocket for\nhis keys.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  ALL NIGHT GAS STATION - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Iris at a pay phone in the cold of an all-night gas\nstation."
  },
  {
   "type": "speech",
   "character": "IRIS",
   "text": "... you got to be there for me...\nCOME ON!  Shit, I'll call later."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  LENNY'S APARTMENT"
  },
  {
   "type": "stage direction",
   "text": "As Lenny unlocks the door, all he hears is Iris' \"I'll\ncall later.\" He picks up the phone as the connection\nbreaks.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  ALL NIGHT GAS STATION - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Iris continues to grip the phone even after she has hung\nup.  She looks desolate, without hope.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  LENNY'S APARTMENT"
  },
  {
   "type": "stage direction",
   "text": "LENNY doesn't stop to play back Iris' message, or any of\nthe twenty others on his machine.  He just deadbolts the\ndoor and locks a steel bar across the door frame, then\ncarries his Haliburton...\n... toward the bedroom.  And we see the truth of his\nreality.  Lenny's crib is a shit-box.  It is a small one-\nbedroom, barely furnished.  A couple of chairs.  Swap-meet\ncouch.  Cardboard boxes full of tech gear stacked in the\ncorners, unidentified electronics components piled on a\ntable, cables strung everywhere.  God knows what this\nstuff is.  There is aluminum foil taped to all the\nwindows.  Fast food cartons, empty Coke cans, pizza boxes\neverywhere.  The bachelor apartment from hell.  High-tech\nlow-life.\nHe goes into the bedroom.  Mattress on the floor.  Same\ninfernal interior decoration, but this room is dominated\nby racks of tapes... Squid tapes.\nLenny pours himself a vodka from a bedside bottle, takes\noff his clothes and hangs them over a chair.  He sits on\nthe bed in his underwear, looking lonely and depressed.\nThis is the private Lenny: No plans.  No dreams.  Nothing\nto look forward to but another day of the hustle.\nHe puts a set of playback trodes carefully on his head,\nfishes around in a shoe box among a bunch of tapes,\nsquinting at the hand-written labels: they all say\n\"FAITH.\" Only the dates are different.\nHe selects one and inserts it in the deck, makes some\nminute adjustments.  Sips his vodka.  Leans back.  Closes\nhis eyes.  And hits PLAY.\nPLAY BACK SEQUENCE/ POV:\nWe are moving along the Venice boardwalk, following a\nYOUNG WOMAN on Rollerblades.  By our motion, it is obvious\nthat we are on Rollerblades too, and not doing so well.\nThe woman is laughing, turning circles around us, cracking\nup at our discomfort.\nWe hear Lenny's voice complaining a mile a minute, and we\nrealize the POV is his.  The girl takes our hands, skating\nbackward, towing us along the boardwalk.  It is a sunny\nafternoon, and it is the usual boardwalk freak show all\naround us.\nThe woman is FAITH JUSTIN, a singer.  Lenny is desperately\nin love with her.  It's not hard to see why.  She is\nbeautiful, in an alive, dynamic way.  Her hair is a wild\ndark mane, and her eyes are spectacular... intense.  She\nmoves with a lithe, sinuous grace.  We are staring at her\neyes instead of concentrating on skating.\nWhammo!  The POV spins and we are sitting, looking up at\nFaith as she circles, laughing.  She skates over to help\nus up.\nCUT TO LENNY, on his bed, smiling.  He punches Fast\nForward.\nBACK TO POV.  A kinetic blur of digital hash, then...\nWe are following Faith, now holding her skates, up the\nsteps to a beach apartment.  Inside it is funky and\ncomfortable.\nMusic from a disk player she left on.  Bob Marley singing\n\"Three Little Birds\".  Faith, covered with a sheen of\nsweat, sways to the music as she goes into a bedroom.  We\nfollow her.\nShe comes out of the small bathroom with a towel, starts\nto dry off.  Sunlight comes in the window lighting up\nFaith like she is in a spotlight.  We move up behind her\nand take the towel away, and now we see Lenny standing\nbehind Faith in the mirror over the dresser.\nHe puts his arms around her and they sway together to the\nmusic.  He runs his fingers in lazy circles over her\nsweaty belly.  Then leans down and licks the sweat off her\nshoulder, all the while watching her in the mirror.  A\nvoyeur recording his voyeurism through his own eyes, so he\ncan replay and relive the moment.\nTheir eyes meet in the mirror.\nThey both watch as Lenny slides his hand up under her\nhalter and caresses her nipples.  She moans softly,\nresponding.  She turns to him, and our POV shifts directly\nto her.  She is right in front of us, in TIGHT CLOSE UP.\nThe intimacy is power."
  },
  {
   "type": "stage direction",
   "text": "(laughs)"
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Hey, you going to watch or you going\nto do?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Watch and see."
  },
  {
   "type": "stage direction",
   "text": "We lean toward her, until her eyes fill frame as they\nclose in a kiss.  We (Lenny) keeps ours open.  Our hands\npull her halter over her head.  Then she pulls up on\nLenny's T-shirt, laughing.  We see it go over our eyes,\nblocking the view for a moment.\nThen Faith kisses Lenny's bare chest.  We are looking down\nat her, looking down across our body, Lenny's body, as\nFaith kisses lower, kneeling in front of us, unbuckling\nour belt and we--\nCUT TO LENNY in the here and now.  Lost in playback memory\nbliss.  He inhales sharply behind a wave of electronically\nrecorded pleasure.\nBACK TO POV.  Lenny pulls Faith up to his face, kissing\nher, then pushing her gently to the bed, where we lie down\ntogether in a pool of sunlight slashing across the tangled\nsheets.  She looks up, right at us..."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "I love your eyes, Lenny."
  },
  {
   "type": "stage direction",
   "text": "(she touches our\neyelids)"
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "I love the way they see."
  },
  {
   "type": "stage direction",
   "text": "CUT TO LENNY, lost in the swirl of sensation.  He touches\nhis tongue to his fingertip.\nIN POV we look down at Faith as we enter her.  She gasps\nand closes her eyes, grabbing the headboard with both\nhands.  There is only the sound of gasping breaths, the\ncreaking bed frame.  She rocks with the rhythm of our\nthrusts, borne away by the intensity until she cries out.\nCUT TO LENNY, reliving the past, under the electrodes.  He\nreacts to the past orgasm.  The tape ends, Lenny slowly\ntakes off the trodes.  There is a tiny tear at the corner\nof his eye.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  LENNY'S APARTMENT/SERIES OF SHOTS"
  },
  {
   "type": "stage direction",
   "text": "2:14 PM, DECEMBER 30\nLenny cracks an eye as the Sony 35\" blinks on in alarm\nmode: news flashes of the day before New Year's Eve...\npolice preparations for the epic Millennium L.A. shebang\ndowntown, the National Guard doing riot prep, etc.\nSunlight comes like lasers through holes in the aluminum\nfoil over the windows.  Lenny goes to the kitchen in his\nunderwear, searches for breakfast in the fridge, which is\nempty except for a red-white-and-blue 2-stick popsicle.\nGood morning.\nThe TV screen shows a murder scene with cops milling\naround, yellow plastic over three crumpled forms on the\nground.  It cuts to a file photo of a severe-featured\nblack man."
  },
  {
   "type": "speech",
   "character": "ANCHORWOMAN",
   "text": "... bodies of two men found early\nthis morning under the Hollywood\nfreeway have been identified as rap\nstar Jeriko One and bandmember James\nPolton, known to fans as \"Replay\".\nA third body, that of a woman, has\nnot yet been identified.  With his\nband, the Prophets of Rage, Jeriko\nOne's outspoken political stance\nand violent lyrics have stirred\nnationwide controversy..."
  },
  {
   "type": "stage direction",
   "text": "CUT TO: A little later.  Lenny sucks on the popsicle while\nhe puts the night's wardrobe together.  This is a ceremony\nhe observes carefully.  Suit laid out on the bed, shirt\nbeneath the jacket.  Lenny matches a tie to the ensemble\n-- well, maybe -- tries another -- that's the one.\nCUT TO:\nLenny, behind the wheel of the BMW.  He is revved up, his\nlook dialed-in.  He's on the move.  Seizing the day."
  },
  {
   "type": "stage direction",
   "text": "(on cellular)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "You know I can get you anything you\nwant, anytime you want it, just not\nright now.  We'll hook up at the\nclub later.  Around eleven.  Yeah."
  },
  {
   "type": "stage direction",
   "text": "Lenny wheels into a parking lot, finds a space, grabs his\nHaliburton and steps out, heading for the front door of\nthe Coral Lounge.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  CORAL LOUNGE"
  },
  {
   "type": "stage direction",
   "text": "The decor is sort of Polynesian.  Goofy tropical motif\nmurals on the walls.  The place has a mixed bag of\ncustomers, including upwardly mobile low-lifes who have\ngraduated from the streets and use it as a kind of office.\nIt is a crossroads for druggies, upscale hookers, junior\nentertainment suits slumming after a day in the pressure\ncooker.\nLenny cruises through like he owns the place, greeting a\nnumber of the early regulars.  We get the impression he\nknows everybody, all the time, everywhere he goes.  He\nleans on the bar."
  },
  {
   "type": "speech",
   "character": "BARTENDER",
   "text": "Hey, Lenny."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Anything without an umbrella."
  },
  {
   "type": "stage direction",
   "text": "He gets backslapped by a guy in a satin racing jacket:\nFabrizio."
  },
  {
   "type": "speech",
   "character": "FABRIZIO",
   "text": "Lenny my man, I think you want to\nmeet a friend of mine."
  },
  {
   "type": "stage direction",
   "text": "Lenny follows Fabrizio's look to a guy, dressed LA power-\ncasual, sitting at a booth across the room."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Looks like money to me."
  },
  {
   "type": "stage direction",
   "text": "Lenny grabs his drink off the bar and follows Fabrizio\nacross the room."
  },
  {
   "type": "speech",
   "character": "FABRIZIO",
   "text": "Don't forget your friends."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "10 percent, Fabri, like always."
  },
  {
   "type": "stage direction",
   "text": "They slide into the booth with KEITH."
  },
  {
   "type": "speech",
   "character": "FABRI",
   "text": "Keith, this is Lenny.  Guy I was\ntelling you about.  He can get you\nanything you--"
  },
  {
   "type": "stage direction",
   "text": "(cutting him off)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Just a second.  Not to be rude,\nKeith, but I got to ask, are you a\ncop?"
  },
  {
   "type": "speech",
   "character": "KEITH",
   "text": "I understand.  No, I'm not."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "You understand?  Attorney!  Right?\nAm I right?"
  },
  {
   "type": "speech",
   "character": "KEITH",
   "text": "That's right."
  },
  {
   "type": "stage direction",
   "text": "Lenny sizes the guy up, looks around the edge of the\ntable."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Tassel shoes.  Entertainment law,\nwould be my guess."
  },
  {
   "type": "stage direction",
   "text": "(off the guy's scowl)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Relax.  I just like to guess, is\nall.  It's my job to know people and\nwhat they want... what's behind\ntheir eyes."
  },
  {
   "type": "speech",
   "character": "FABRIZIO",
   "text": "Lenny gives people their heart's\ndesire.  Ain't that right, Lenny?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "That's right.  My second question I\ngotta ask, so we get our bearings\nhere... have you ever jacket in?\nHave you ever wiretripped?"
  },
  {
   "type": "speech",
   "character": "KEITH",
   "text": "No."
  },
  {
   "type": "stage direction",
   "text": "(a winning grin)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "A virgin brain!  Well we're going to\nstart you off right.  So what do you\nknow about this?  Save us some\ntime..."
  },
  {
   "type": "stage direction",
   "text": "(shrugs)"
  },
  {
   "type": "speech",
   "character": "KEITH",
   "text": "Just what I've read.  That the\ntechnology was developed for the\nFeds, to replace the body wire.  And\nnow it's gone black market.  So, uh,\ndo I get the deck from you?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I'll set you up, get you a deck at\nmy cost... since my thing is the\nsoftware."
  },
  {
   "type": "speech",
   "character": "KEITH",
   "text": "Clips."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "That's right.  Clips."
  },
  {
   "type": "stage direction",
   "text": "(Lenny leans in,\nworking the guy)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Look, I want you to know what we're\ntalking about here.  This isn't like\nTV only better.  This is life.  It's\na piece of somebody's life.  Pure\nand uncut, straight from the\ncerebral cortex.  You're there.\nYou're doing it, seeing it, hearing\nit... feeling it."
  },
  {
   "type": "speech",
   "character": "KEITH",
   "text": "What kind of things exactly?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Exactly anything.  Whatever you\nwant.  Whoever you want to be."
  },
  {
   "type": "stage direction",
   "text": "(handing Fabrizio a\ntwenty)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Fabri, get us another round, would\nyou."
  },
  {
   "type": "stage direction",
   "text": "Fabrizio gets the hint and heads for the bar."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "You want to go skiing without\nleaving your den, you can.  But I'm\nassuming a guy like you, you wanna\ngo skiing you fly to Aspen.  That's\nnot what you're interested in here.\nIt's about the stuff you can't\nhave... right?  The forbidden\nfruit."
  },
  {
   "type": "stage direction",
   "text": "Keith nods, mesmerized by Lenny."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Like running into a liquor store\nwith a .357 magnum in your hand,\nfeeling the adrenalin pumping\nthrough your veins.  Or..."
  },
  {
   "type": "stage direction",
   "text": "(pointing discreetly)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "... see that guy, with the drop-dead\nPhilipino girl friend?"
  },
  {
   "type": "stage direction",
   "text": "(Keith looks)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Wouldn't you like to be that guy for\ntwenty minutes?  The right twenty\nminutes.  I can make it happen.  And\nyou won't even tarnish your wedding\nring."
  },
  {
   "type": "stage direction",
   "text": "Keith touches his ring self-consciously, then grins."
  },
  {
   "type": "stage direction",
   "text": "(hooked like a carp)"
  },
  {
   "type": "speech",
   "character": "KEITH",
   "text": "Sounds good."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I can get you what you want.  You\njust have to talk to me.  I'm your\npriest, your shrink, your main\nconnection to the switchboard of\nsouls.  I'm the Magic Man, the Santa\nClaus of the Subconscious.  You say\nit, you even think it, you can have\nit.  You want a girl, you want two\ngirls?  I don't know what your thing\nis or what you're curious about...\nyou want a guy?  You want to be a\ngirl... see what that feels like?\nYou want a nun to tie you up?  It's\nall doable."
  },
  {
   "type": "stage direction",
   "text": "(flushed, sweating,\nready)"
  },
  {
   "type": "speech",
   "character": "KEITH",
   "text": "Talk to me about costs, here."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Listen, before we get into numbers,\nI want you to try a taste.  I got a\ndeck with me."
  },
  {
   "type": "speech",
   "character": "KEITH",
   "text": "What?  Right Here?"
  },
  {
   "type": "stage direction",
   "text": "(grinning)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Step into my office."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  CORAL LOUNGE/MEN'S ROOM"
  },
  {
   "type": "stage direction",
   "text": "Close on Keith's face, as he sits on the sink counter\nreacting to a Squid tape.  He jerks... his mouth drops\nopen... he gasps.  His hands start to move over his body,\nfeeling it wonderingly.  He gasps again, tilts his head\ndown, moans... and Lenny hits Pause on the Playback.\nKeith opens his eyes to a grinning Lenny."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "You were just an eighteen year old\ngirl taking a shower.  Are you\nbeginning to see the possibilities\nhere?"
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  PARKING LOT/CORAL LOUNGE"
  },
  {
   "type": "stage direction",
   "text": "A figure moves stealthily from the shadows and approached\nLenny's car: Iris, hair dyed black now, wearing jeans and\na coat but still showing scars from last night's pursuit.\nShe tries the door of the car: locked.  She looks toward\nthe Coral Lounge, debates whether to go look for Lenny.\nBetter not.\nShe takes a Squid tape from her pocket, and scribbles a\nnote on the label: \"HELP ME.  IRIS.\" She drops the tape\nthrough a 2-inch gap in Lenny's sun roof... and it bounces\noff the seat, onto the floor.\nShe looks through the windshield, totally distraught,\ntrying to see where the tape landed... and sees the\nreflection of cop cruiser lights coming down the street.\nShe crouches next to the BMW, trying to blot herself out.\nAnd when the cruiser passes, she slumps to the ground,\ncrying, afraid to move.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  CORAL LOUNGE"
  },
  {
   "type": "stage direction",
   "text": "A man in his late 30s: longish hair, no shave since the\nweekend, army jacket bulking over a massive frame.  A\ndaunting figure as he approaches the bartender."
  },
  {
   "type": "speech",
   "character": "MAN (MAX)",
   "text": "Where is he?"
  },
  {
   "type": "stage direction",
   "text": "Bobby, the bartender, cocks his eye toward the restrooms.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  CORRIDOR/CORAL LOUNGE"
  },
  {
   "type": "stage direction",
   "text": "Lenny unlocks the men's room door and walks down the dingy\ncorridor with her new customer, Keith."
  },
  {
   "type": "speech",
   "character": "KEITH",
   "text": "Yeah, I'm interested, but can we get\nsomeplace a little less public?"
  },
  {
   "type": "stage direction",
   "text": "(grinning)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "You nervous?  Forget it.  The cops\nhave more to worry about in this\ncity than the squid-trade, believe\nme--"
  },
  {
   "type": "stage direction",
   "text": "Behind them, the door of the women's bathroom whips open\nand the guy in the army jacket grabs Lenny from behind and\nSLAMS him face-first into the wall, jamming a .45 against\nhis skull."
  },
  {
   "type": "speech",
   "character": "MAN (MAX)",
   "text": "Don't move!  That's it, assume the\nposition you miserable techno-perv\npuke."
  },
  {
   "type": "stage direction",
   "text": "Cop style, the man in the army jacket kicks Lenny's feet\napart.  Starts to cuff him."
  },
  {
   "type": "stage direction",
   "text": "(to Keith)"
  },
  {
   "type": "speech",
   "character": "MAN",
   "text": "Beat it fuckwad."
  },
  {
   "type": "stage direction",
   "text": "Ash-white, Keith lays a smoke trail down the hall.  On the\nmain floor of the club, Fabrizio sees him splitting and\nhurries after him.\nBack in the corridor, Lenny spins around and shoves his\nattacker against the opposite wall.  The guy offers no\nresistance.  In fact, he's too weak from laughing."
  },
  {
   "type": "speech",
   "character": "MAN (MAX)",
   "text": "Gotcha."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Damnit, Max, I was with a client!\nYou think that's funny?  To mess\nwith a man's livelihood?  It's not\nfunny!"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "You see the look on that preppy\npuke's face?  Fuckin' pissed in his\nTopsiders."
  },
  {
   "type": "stage direction",
   "text": "(laughing a little)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Okay.  It was funny.  But it cost me\nmoney."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Come on, amigo, the world's full of\nmarks.  And nobody knows how to work\n'em like you do, pal.  You could\nsell a goddamn rat's asshole for a\nwedding ring!  Let me buy you a\ndrink."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Least you can do."
  },
  {
   "type": "stage direction",
   "text": "Max Peltier, which he mispronounces \"Pelcher\", slings his\narm fraternally over Lenny's shoulder.  They cross to the\nbar.  Max roars greetings to several regulars, pushing\nbetween strangers like an out of control tractor."
  },
  {
   "type": "speech",
   "character": "REGULAR",
   "text": "Yo, Pelcher!  Mad Max!"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Fuckin' A right I'm mad!  I might\nkill every man in here.  But first\nI'm buyin' my buddy here a drink."
  },
  {
   "type": "stage direction",
   "text": "(seeing another\nregular)"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Hey O'Neal!  You were right, your\nwife does give good head."
  },
  {
   "type": "stage direction",
   "text": "Max lurches onto a barstool and hunches there like a\nmisanthropic bear, pounding the bartop."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Bobbyyyy!  Tequila por favor!\nDouble shots.  Make it Tres\nGeneraciones, huh.  Nothin' but the\nbest for my good friend Lenny, the\nfinest cop that ever got thrown off\nthe vice squad.  Hey, nice tie."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Thanks, Max."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "D'you always have to dress like a\nfuckin' pimp?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "This tie cost more than your entire\nwardrobe."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "That's not sayin' much."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "It's the one thing that stands\nbetween me and the jungle."
  },
  {
   "type": "stage direction",
   "text": "Max raises his double shooter."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "To the jungle!  Where outa the blue\nsome shitbird can cap you in the\nback of the head and ruin your whole\nday."
  },
  {
   "type": "stage direction",
   "text": "He downs it in two fierce gulps."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "You were lucky, Max."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Yup.  So darn lucky.  I wake up with\na .22-short floating in my brainpan,\nand a cop pension I can't live off\nof.  Good thing I wasn't any\nluckier.  Bobby!  Another shooter\nright here!"
  },
  {
   "type": "stage direction",
   "text": "Bobby pours for Max."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "You seen Faith lately?"
  },
  {
   "type": "stage direction",
   "text": "Lenny reacts visibly to the name, his whole demeanor\nsagging."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Naw.  She won't call me."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Just as well, Lenny.  You gotta get\npast it.  I mean sure, Faith was by\nfar the most outstanding woman a guy\nlike you could ever hope to get, I\nmean it's completely and deeply\nhumiliating that she's gone, but\nit's over, campadre."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Thanks, Max.  I'm touched by your\nconcern."
  },
  {
   "type": "stage direction",
   "text": "CUT TO: Iris, working her way from the front door, staying\non the fringe of the crowd, wary, moving toward Max and\nLenny at the bar."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "I just hate to see you pining away.\nIt makes me want to vomit, frankly."
  },
  {
   "type": "stage direction",
   "text": "(philosophically)"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Broken hearts are for assholes."
  },
  {
   "type": "stage direction",
   "text": "(seeing Iris)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Hey, Iris, you okay?"
  },
  {
   "type": "speech",
   "character": "IRIS",
   "text": "Lenny, I got to talk to you, it's\nserious..."
  },
  {
   "type": "stage direction",
   "text": "(looking at her face)"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "What happened, honey, some john get\nrough on you?"
  },
  {
   "type": "stage direction",
   "text": "(to Lenny)"
  },
  {
   "type": "speech",
   "character": "IRIS",
   "text": "I mean talk private.  Please, I'm in\ntrouble, and so is Faith."
  },
  {
   "type": "stage direction",
   "text": "(as Lenny reacts to\nthe name)"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "There it is, the magic fuckin' word."
  },
  {
   "type": "stage direction",
   "text": "Lenny takes Iris by the arm and pulls her away from the\nbar."
  },
  {
   "type": "speech",
   "character": "IRIS",
   "text": "Can we go to your car?  There's\nsomething you have to see right\naway."
  },
  {
   "type": "stage direction",
   "text": "He nods and steers her toward the front door of the Coral\nLounge."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "What's going on?"
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  CORAL LOUNGE/PARKING LOT - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Lenny and Iris come out the front door."
  },
  {
   "type": "speech",
   "character": "IRIS",
   "text": "It's a bad situation... if they get\nme I know they're going to -- OH\nSHIT!"
  },
  {
   "type": "stage direction",
   "text": "She bridles like a startled horse.  Lenny looks at what\nshe sees: a red beam, sweeping the parking lot.  Must be\nthe cops.  He turns back...\nShe's gone.  What the hell?\nHe looks back at the red light... and edges around the\ncorner to see what the cops are up to...\nIt's not a cop car.  It's a tow-truck, with Lenny's BMW on\nthe hook.  Lenny runs to the TOW DRIVER, who looks like a\nbiker only meaner."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Hang on, that's my car--"
  },
  {
   "type": "speech",
   "character": "TOW DRIVER",
   "text": "Not anymore.  Belongs to the bank."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Hey wait a second..."
  },
  {
   "type": "stage direction",
   "text": "Ignoring him, the driver has started the hydraulic lift,\nand Lenny makes the mistake of grabbing his beefy arm.\nThe guy whips around, putting the muzzle of a .38 in\nLenny's face."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Oh, yeah, that's the answer!  Two\nmillion years of human evolution and\nthat's the best idea you can come up\nwith?"
  },
  {
   "type": "stage direction",
   "text": "(driver continues\nwith the hoist)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Okay.  Look, whattya get to repo a\ncar?  Two hundred?  Two fifty?  I'll\npay you three fifty, right now.  All\nyou gotta do is drop it off the hook\nand say you came by, your mark\nwasn't here.  Simple.  Make a few\nbucks.  Do a good deed.  Huh?"
  },
  {
   "type": "speech",
   "character": "DRIVER",
   "text": "You got the cash on you?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I was going to write you a check, if\nthat's--"
  },
  {
   "type": "stage direction",
   "text": "The guy is getting into his truck."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Okay, okay, I totally respect that\ncall.  I would want cash.  They'll\ntake my check inside... I can see\nyou're pressed for time, just give\nme two minutes... here keep my watch\nfor collateral."
  },
  {
   "type": "stage direction",
   "text": "He hands the guy his watch."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "It's a Rolex.  Be right back.  Two\nminutes."
  },
  {
   "type": "stage direction",
   "text": "Lenny gets to the front door of the Coral Lounge, turns\njust in time to see the tow-truck pulling out.  Lenny runs\nafter his car, yelling, watching it recede."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Son of a bitch!"
  },
  {
   "type": "stage direction",
   "text": "Lenny walks back to the bar.  He sets his Haliburton up on\nthe truck of a car and pops it open.  He takes out a tiny\ndigital cellular phone and dials a number.  While it's\nringing he takes another, identical Rolex knock-off out of\nthe briefcase and slips it on.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  CAR - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "A hand pulls a ringing cellular out of a black jacket.\nFollow the hand and phone to the face of a black woman.\nLORNETTE \"MACE\" MASON.  Late twenties.  Striking features.\nHair pulled back tight to her skull.  She is driving, but\nwe don't see the car, or anything but her face."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Hello?  Hey Lenny, whatup?"
  },
  {
   "type": "stage direction",
   "text": "(listens a beat;\nthen)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Uh huh.  Uh huh.  Sure.  So what\nhappened to your car this time?"
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  CORAL LOUNGE - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "A black limo pulls into the lot.  It is a Continental\narmored stretch, downsized from today's standards.  The\ndoor opens and Mace gets out.  She is compactly built,\ndressed in black slacks, a conservative black jacket,\nheavy rubber-soled shoes.  She glances around as she heads\nfor the Coral Lounge entrance, the unconscious sweeping\ngaze of a security professional.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  CORAL LOUNGE"
  },
  {
   "type": "stage direction",
   "text": "Mace scopes the room quickly, professionally, then heads\nfor the bar.\nON Max and Lenny at the bar."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "See, if you packed your piece you\ncould've made the guy see sense."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Uh unh, carrying a gun wrecks the\nline of a fine jacket."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "An ex-cop that doesn't carry.  It's\nembarrassing.  I oughta not be seen\nwith you."
  },
  {
   "type": "stage direction",
   "text": "(as she slips up\nbehind them)"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Hey, Mace.  What's goin' on?"
  },
  {
   "type": "stage direction",
   "text": "She plants herself between Max and Lenny and takes a\ngenerous handful of their nachos."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Greetings, gents."
  },
  {
   "type": "stage direction",
   "text": "(to Lenny)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "So let's hear this week's sad story."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "They jerked my wheels, d'you believe\nit?  I mean it's outrageous, the\ncomputer errors the banks are making\nlately.  Have you noticed?"
  },
  {
   "type": "stage direction",
   "text": "Mace and Max exchange a weary look."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "No.  I haven't noticed because I\nmake my payments.  So, Max Pelcher,\nhow's the P.I. business?"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Sucks."
  },
  {
   "type": "stage direction",
   "text": "(attention caught by\nTV)"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Hey, Bobby, turn that up."
  },
  {
   "type": "stage direction",
   "text": "The Bartender obeys: it's more news about the Jeriko One\nkilling.  There's file footage of Jeriko and his band, the\nProphets of Rage; interview with a lot of furious fans,\nmostly black inner city kids; and a news clip of Jeriko at\nan outdoor rally, exhorting the crowd with near religious\nfervor:"
  },
  {
   "type": "speech",
   "character": "JERIKO ONE (ON T.V.)",
   "text": "The LAPD is a military force turned\nagainst its own people.  We live in\na police state!  The mayor and the\ncity council sit up in their offices\nwith their social programs that\ndon't work... they're rearranging\ndeck chairs on the Titanic.  But the\nnew day is coming!  Two-K is coming!\nThe day of reckoning is upon us.\nHistory ends and begins again right\nhere!  Right now!"
  },
  {
   "type": "stage direction",
   "text": "Max raises a glass in salute to the TV screen."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "To the end of all things!"
  },
  {
   "type": "stage direction",
   "text": "(slugs down the shot)"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "You know how I know it's the end of\nthe world?  Because everything's\nbeen done, every kind of music's\nbeen tried, every government's been\ntried, every fuckin' hairstyle.\nHow you gonna make it another\nthousand years, for Chrissake?"
  },
  {
   "type": "stage direction",
   "text": "On the TV, clip of Jeriko's speech has been replaced by an\ninterview with Jeriko One's manager.  TRAN VO.  Tran is\nVietnamese, and around Lenny's age.  He's angular, suave,\ncool as an early frost.  Dialed in.  Lenny sees his face\non the screen like a personal nightmare."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "I'm telling ya, it's over.  We used\nit all up--"
  },
  {
   "type": "stage direction",
   "text": "(riveted to the TV)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Shutup a second!"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Hey, isn't that Tran Vo?"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Yup.  He was Jeriko's manager."
  },
  {
   "type": "stage direction",
   "text": "(to screen)"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Bummer, Tran!  Lost your golden\ngoose.  Couldn't happen to a nicer\nguy."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "But I mean isn't he Faith's new--"
  },
  {
   "type": "stage direction",
   "text": "(she mouths the word\n\"boyfriend\")"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Sssssh!  Not in front of Lenny.  You\nmay trigger a maudlin display which\nwill force us to tranquilize him."
  },
  {
   "type": "stage direction",
   "text": "ON THE SCREEN, Tran is being jostled as he walks,\nanswering the reporters questions in a glare of minicam\nlights."
  },
  {
   "type": "speech",
   "character": "REPORTER",
   "text": "The LAPD have said they believe\nthis is a gang-related incident.\nCan you comment on that, Mr. Vo?"
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "We have no facts yet.  All we know\nfor sure is that we have lost a\ngreat artist, that a great voice for\nchange is now silent..."
  },
  {
   "type": "stage direction",
   "text": "Lenny, scowling, pushes away from the bar.  Mace goes with\nhim."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Thanks for giving me a ride.  I just\nhave a few stops, mostly on the west\nside--"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Whoa, whoa, whoa.  I said I'd\ndrop you home, but I'm not taking\nyou on your sleazoid rounds.  I've\nalready pulled twelve hours today."
  },
  {
   "type": "stage direction",
   "text": "(upbeat again)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Come on, Mace.  This is gonna be a\nbig night.  Can't you feel it?  The\nenergy in the air?  There's money to\nbe made, dreams to sell."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Sleaze to peddle."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Just a couple of hours.  It'll be\nfun--"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Excuse me.  What part of NO don't\nyou understand?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Mace, you're my friend.  I need you.\nPlus I'll give you 25% of what I\nmake tonight."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Lenny, this may be a hard concept\nfor you, but friends don't have to\npay their friends."
  },
  {
   "type": "stage direction",
   "text": "Lenny starts to whine like a puppy.  Mace gives up."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Jeez, you're pathetic.  Okay, I got\na pickup at the St. James.  I'll\ntake you there, you can get a cab."
  },
  {
   "type": "stage direction",
   "text": "(an arm around her\nlike a buddy)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Mace!  You're a life-saver."
  },
  {
   "type": "stage direction",
   "text": "(resigned)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Driving Mr. Lenny."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  LIMO - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "As Lenny and Mace cruise the night streets, passing the\nongoing pageant of cops and decay.  Mace glances at Lenny,\nsitting next to her in front, and at his omnipresent\nHaliburton."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "So, what's up with you?  Another\nbusy night selling porno to\nwireheads?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "No, wrong... I sell experiences.\nSex is only part of it."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Buncha techno-perv jerkoffs."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Way I look at it, I actually perform\na humanitarian service.  I save\nlives."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Uh huh, I wanna hear this part."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Okay, take some executive... bored\nwith his life, bored with his\nwife... he picks up a hooker or some\ngirl at a bar.  Then he goes around\nfor months, torn up worrying that\nhe's got AIDS, that he'll infect his\nwife.  And maybe he really does\ncatch something--"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Price he pays for being a\nscumsucking pig."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Everybody needs to take a walk to\nthe dark end of the street sometime,\nit's what we are.  But now the risks\nare outa line.  The streets are a\nwar zone.  And sex can kill you.  So\nyou slip on the trodes, you get what\nyou need and it keeps you from\njumping your tracks."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Lenny, this shit's illegal."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Define illegal."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Me bailing your sorry pale ass out\nof jail twice in the last six\nmonths."
  },
  {
   "type": "stage direction",
   "text": "(kidding)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Yeah, but that was for love."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Define love."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  ST. JAMES CLUB - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Mace's limo wheels up to the hotel on the strip.\nA soberly-dressed Japanese executive is waiting next to\nthe doorman.\nINSIDE the car, Mace spots him and scowls."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Dammit, Lenny, you made me late."
  },
  {
   "type": "stage direction",
   "text": "Lenny opening the door before the car stops."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "What's his name?"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Fumitsu."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Mr. Fumitsu, good evening sir,\nLeonard Nero, Security Express.\nLornette Mason here is just\ncompleting our routine driver\nevaluation.  We do it to make sure\nthat out VIP clients, such as\nyourself, are always treated as\nhonored guests.  I just need to ride\nup front and take some notes, if you\ndon't mind."
  },
  {
   "type": "stage direction",
   "text": "Fumitsu nods politely and Lenny opens the car door for\nhim.  Lenny jogs around behind the car to the front\npassenger door."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Um, excuse me."
  },
  {
   "type": "stage direction",
   "text": "(can't stand to say\nit)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Sir.  Excuse me.  Mr. Nero."
  },
  {
   "type": "stage direction",
   "text": "She walks calmly to him."
  },
  {
   "type": "stage direction",
   "text": "(hissing through her\nteeth)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "What the fuck are you doing?"
  },
  {
   "type": "stage direction",
   "text": "(winning smile,\ninnocent)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Coming with you."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "You will not live to see the\nmorning."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  HANCOCK PARK HOUSE - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "As the limo stops at an elegant home in this top-bucks,\nold-line residential area.  There is a loud party in\nprogress, with a couple of hundred guests spread through\nthe house and backyard.  Mace scowls deeply as Lenny gets\nout of the car and starts into the party with Mr. Fumitsu.\nThey are laughing uproariously and getting along like old\nfriends.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  HANCOCK PARK HOUSE - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Mace, having a cigarette with other security drivers,\nwatches Lenny through the tall windows of the old Spanish\nhouse.  She sees him working the room, rubbing up against\nthe money, networking.  No dialogue.  A pantomime of Lenny\nworking his prime turf.  She stares at him for a while,\nthen looks at her watch.  Sighs.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "EXT./ INT.  HANCOCK PARK HOUSE/GARDEN - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "... as a tall, stern figure suddenly slides into Lenny's\npath, a top cop named PALMER STRICKLAND."
  },
  {
   "type": "speech",
   "character": "STRICKLAND",
   "text": "Nero."
  },
  {
   "type": "stage direction",
   "text": "(uh-oh)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Strickland."
  },
  {
   "type": "speech",
   "character": "STRICKLAND",
   "text": "Commissioner Strickland."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Sure.  Whatever.  See, since you\nshitcanned my career, I don't even\nhave to call you sir.  One of life's\nsmall pleasures."
  },
  {
   "type": "speech",
   "character": "STRICKLAND",
   "text": "Aren't you peddling your wares a\nlittle far from your usual gutter?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I was invited here by a close\nfriend, Mr. Fumitsu, see he's right\nover there."
  },
  {
   "type": "stage direction",
   "text": "Lenny waves.  Fumitsu waves back from across the room."
  },
  {
   "type": "speech",
   "character": "STRICKLAND",
   "text": "I don't like disappointments, Nero.\nAnd do you know what disappoints me\nvery much?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Your sex life?"
  },
  {
   "type": "speech",
   "character": "STRICKLAND",
   "text": "Your existence."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  HANCOCK PARK HOUSE - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Mace sits in her limo, talking on the cellular."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Now listen to me... you have to get\nto bed young man.  I mean it.  No\nwatching \"Tales from the Crypt\".  I\ndon't care what Cecile says.  I'll\nsee you in the morning, baby.\nNight, night."
  },
  {
   "type": "stage direction",
   "text": "As she hangs up, she glances out the window in time to\nsee...\nLenny flying over a hedge.  He lands on the sidewalk, then\nscrambles up and brushes himself off as TWO SECURITY TYPES\nloom toward him.  He adjusts his wardrobe and walks with\ndignity (but quickly) toward the car."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Are we having a bad night?"
  },
  {
   "type": "stage direction",
   "text": "(glancing back)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Let's talk in the car."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT./ EXT.  MACE'S LIMO - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "As Mace pulls out, Lenny starts fitting a pair of playback\ntrodes to his head.  Mace glances at him in disgust.  He\nhits his playback button.\nLenny's POV as he talks to Faith.  Back when things were\ngood.  He's wiring her.  They are playful, like a couple\nof kids."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "I feel like you're turning me into a\nVCR."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I just want to see what we're like\ntogether through your eyes."
  },
  {
   "type": "stage direction",
   "text": "He turns OFF the record button.  STATIC.  Then TAPE\nRESTARTS.  We see the two of them standing together,\nreflected in a mirror.\nWe are Faith now."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "I don't feel anything.  Is it on?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Forget it's there."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Make me forget it, baby."
  },
  {
   "type": "stage direction",
   "text": "He turns her to him.  They begin to make love.  Faith's\nface fills our field of view, eyes closed in dreamy\npassion.\nA sudden FLASH OF LIGHT.  Lenny opens his eyes to see...\nMace's glowing countenance.\nShe has stopped the car, torn the trodes from Lenny's head\nand tossed them out the window.  Now she's yanking him out\nof the car by his lapels."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Hey, careful on the jacket.  This is\nArmani."
  },
  {
   "type": "stage direction",
   "text": "(he looks at her)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "You angry?"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "I've had enough of this shit."
  },
  {
   "type": "stage direction",
   "text": "(getting back into\nthe car)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "You're on foot, Lenny."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "In LA?  Are you crazy?"
  },
  {
   "type": "stage direction",
   "text": "Mace starts to peel out, but Lenny leaps and plasters\nhimself on the hood.  Mace pretends she doesn't see him."
  },
  {
   "type": "stage direction",
   "text": "(as they drive along)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Can I come in please?  I'm having a\nhard time hearing the stereo."
  },
  {
   "type": "stage direction",
   "text": "Mace jams on the brakes and Lenny slides off in front of\nthe car.  Now she starts to move forward..."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I need my case.  It's still in the\nback."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Get it."
  },
  {
   "type": "stage direction",
   "text": "He quickly moves around the car and climbs in the back\ndoor.  Lenny grabs his Haliburton but instead of getting\nout, he leans through the divider window, next to Mace."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Listen, can we talk a little bit\nhere, like two rational adults?"
  },
  {
   "type": "stage direction",
   "text": "Mace hits a button on the dash.  The privacy divider rises\nsuddenly, pinning Lenny to the ceiling."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "That would be no."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "I've had it.  No more wirehead shit\nin my car.  You understand?  You\nwant to poach your lobes, do it\nsomewhere else."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Okay, you got my attention, but this\nis cutting off the circulation to my\nhead, here.  D'you mind?"
  },
  {
   "type": "stage direction",
   "text": "She lowers the divider, releasing him.  Lenny straightens\nhis jacket and tie.  Runs a hand through his greasy hair."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I thought we were friends."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "No, see a friend is more than one\nperson constantly doing favors for\nanother.  You just suck people along\nwith your schemes and your scams and\nyour slick act.  Well I'm out.  I\ngot a kid, I got rent, I got an ex-\nhusband someplace who doesn't send\nme a dime of support... I'm just\ntrying to hold on here."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "So am I.  Just trying to get by."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "No, you're just trying to get off."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Macey... I've never seen you like\nthis."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Lenny, you're turning into some\nkinda squid-head low-life.  You're\nalways broke, you just go from one\nscore to the next.  And you're\ngetting strung out... you don't even\nsee it.  Getting high on your own\nsupply like some crack dealer."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I know you wouldn't be saying all\nthis if you didn't care about me.\nThanks, Mace.  Really."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Look, I gotta get some sleep."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "You still like me, don't you?  We're\nstill buddies?"
  },
  {
   "type": "stage direction",
   "text": "She hates it that she can't resist his pathetic charm."
  },
  {
   "type": "stage direction",
   "text": "(a tiny smile)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Yeah.  I don't see a way out of it."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Macey, I know you're tired, but can\nyou drop me at the Retinal Fetish?\nIt's on your way."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Jesus, Lenny."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Begging?  Groveling?  Any pathetic\nbehavior at all?  Will that help?\nFaith's there tonight, and I've got\nto talk to her."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Sure, Lenny."
  },
  {
   "type": "stage direction",
   "text": "(she puts the car in\ngear)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "The only thing worse than a junkie\nis someone in love."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  RETINAL FETISH - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "As Mace pulls to a stop in the parking lot and Lenny opens\nthe door."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Come on, let me buy you a drink.\nLet's drink and make up."
  },
  {
   "type": "stage direction",
   "text": "(Mace shakes her\nhead)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Alright, I'm going to see Faith.\nThat means you can watch me suffer.\nI'll be in agony, you'll feel so\nmuch better.  Total and thorough\npayback, whatdya say?"
  },
  {
   "type": "stage direction",
   "text": "Mace smiles, shaking her head in wonder at this madman.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  RETINAL FETISH"
  },
  {
   "type": "stage direction",
   "text": "Mace accompanies Lenny into the pounding din of the\nRetinal Fetish.  The place is a fringe hangout, a\nconverted schmata factory transformed into a warren of\ndark rooms and corridors off the main dance floor.  A\nthundering labyrinth.  Steel cage-like partitions of\nchain-link give the place a harsh, concentration-camp\natmosphere.  The music is a bass tech-thump, and the\nclientele are young and on the rough side.  Cybergrunge.\nThere are many large video screens running a continuous\nmontage of wild graphics and images... a flurry of\ndisturbing videos: MTV baptized by William Burroughs.\nThe Fetish is a street-tech hangout, a meeting place for a\nlot of digital-underground types that Lenny knows.  You\ncan buy and sell what you want here: illicit hardware and\nsoftware, as well as chemicals for the wetware (brain).\nLenny and Mace are greeted inside by two suited guys with\nmetal detectors.  They barely notice as they are scanned:\nit's routine there days.  Mace shows her gun, a Sig Saur\n9mm, and her state carry-permit.  The security guys check\nher pistol like a coat, giving her a claim check.\nThrough the crowd in the lounge Lenny's eyes go\nimmediately to one table.  It seems to be in a pool of\nlight all it's own; or maybe this is just in Lenny's mind.\nSLOW MOTION: Lenny watches a man at the table holding\ncourt, with a beautiful young woman sitting next to him.\nIt is TRAN VO.  He's a mover and shaker in the record\nbusiness: he produces, he manages, he tries to keep\neveryone in his orbit.\nThe woman is FAITH JUSTIN.  We recognize her from playback\nas Lenny's ex-girlfriend.  But now her hair has been dyed\njet black and frames her face in a wild tangle.  She is\nwearing as expensive custom leather jacket over a sheer\nsilk top.  She has on too much make-up, which gives her\nfeatures a feral-doll quality.  Faith looks like what she\nis, a rock star wannabe.  But the look is red-hot.\nTran looks around the room.  His eyes miss nothing.  And\nshow nothing.  His hand -- unhurried, graceful, remarkable\n-- brushes past Faith's cheek, barely touching her.  His\nfingers pick up a strand of hair, tuck it like a treasure\nbehind her ear... fingers touching her head now... a\nmoment of suspended time.\n... and she trembles.  Just a little.  For a second.\nTran and Faith are flanked on either side by an entourage\nconsisting of music types, various hangers on, and Tran's\npersonal security force of four: JOEY CORTO, a whippet-\nthin skinhead; DUNCAN, a none-too-bright armbreaker in the\nclassic mold; a massively built ex-jock type called WADE\nBEEMER; and a sixteen year old Asian stone fox, CINDY\nMINH, aka 'VITA', possibly the most lethal of the four."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Who's the new side of beef in Tran's\nposse?"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Guy named Wade Beemer.  Used to be a\nrunning back for the Rams in '96 and\n'97."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Rams... that's football, right?"
  },
  {
   "type": "stage direction",
   "text": "He can't take his eyes off Faith.  Mace scowls at the\ntableau and pulls Lenny toward the bar."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Forget her."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "She still loves me."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "She thinks you're a bucket of dog\nvomit.  Trust me on this."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "She's my destiny."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Destiny?  You living in a perfume\ncommercial?  She's a hard-climber\nthat dropped you like a used tampon\nwhen she got a better ride."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "You'll see."
  },
  {
   "type": "stage direction",
   "text": "Mace gives up, shakes her head and Lenny plunges into the\ncrowd... toward Faith.  Several patrons greet him, just as\nin the Coral Lounge, but uncharacteristically, Lenny\nvirtually ignores them.\nApproaching the main table now.  Ringside.  Tran sees him;\nno reaction.  Now Faith sees him: her reaction's a little\ntougher to read.  Pissed off, maybe, or just tense.\nTran's security force has seen Lenny coming.  But they\nstay casual.\nLenny doesn't break stride.  It's like a game of chicken\nwithout cars.  Beemer stands, covering Lenny with his\nshadow.  Vita looks up at Lenny with cobra eyes.  Tran\ngives him a glance; royalty amused by Lenny's presumption."
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "You come to peddle me some tapes,\nLenny?  For old time's sake?  Make a\ncouple bucks for the holidays?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "You're not a client anymore, Tran.\nI wouldn't sell you the sweat off a\ndead dog's balls."
  },
  {
   "type": "stage direction",
   "text": "(glancing at Faith,\nback at Lenny)"
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "I already got everything I need from\nyou."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Cut it out, Tran."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Too bad about your guy Jeriko.\nTough break."
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "Show a little respect, Nero.  The\nman was an important artist."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Yeah, important for your label.\nWhich no doubt is why you're in\nmourning.  Don't worry, his\nrecords'll sell out now he's dead.\nYou'll make out."
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "I always do."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Faith, can I talk to you a second?"
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "I don't think that's a good idea,\nLenny."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I just got to talk to you for one\nsecond."
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "About what?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "That would be between me and Faith,\nwouldn't it?"
  },
  {
   "type": "stage direction",
   "text": "Tran takes one of his beautiful hands and passes it slowly\nin the general area between his table and Lenny."
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "I don't feel anything between you.\nSee, your trouble is you assume too\nmuch, Lenny.  You assume there's\nsomething where there's nothing.\nYou assume you have a life.  But\nyou're only hustling pieces of other\nlives on tape, and broken parts of\nyour own."
  },
  {
   "type": "stage direction",
   "text": "Faith glances at Tran, then cuts her eyes to Lenny."
  },
  {
   "type": "stage direction",
   "text": "(icy)"
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "We have nothing to talk about,\nLenny."
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "Joey, make sure Mr. Nero gets safely\nto his car."
  },
  {
   "type": "stage direction",
   "text": "Joey smirks, glances at Beemer who rises like a wall."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Faith, call me, okay?"
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "No, Lenny."
  },
  {
   "type": "stage direction",
   "text": "Wade gets Lenny in a wrist-grip come along hold and starts\nhim moving.  She looks at him -- slowly, gaze unwavering.\nAs Beemer ushers Lenny through the crowd, Tick greets him\ncoming the other way."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Tick, listen, I can't stop right\nnow.  but I'll call you tomorrow\nabout that thing we were talking\nabout."
  },
  {
   "type": "stage direction",
   "text": "He's working the room even as he's getting dragged\noutside."
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "Lenny the loser.  Panhandler of\nstolen dreams."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Leave him alone, Tran."
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "He's no concern of mine, as long as\nyou don't talk to him.  Don't talk\nto anybody.  You understand?  Not\nwith everything that's going on\nright now."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "You're too goddamned paranoid."
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "Paranoia's only reality on a finer\nscale."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  RETINAL FETISH"
  },
  {
   "type": "stage direction",
   "text": "Beemer deposits Lenny on the curb and goes back inside.\nA SMALL CROWD of people enters the club.  Lenny brushes\noff his jacket, falls into step at the rear of the\nentering crowd.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  RETINAL FETISH"
  },
  {
   "type": "stage direction",
   "text": "Lenny climbs to a landing overlooking the dance floor.\nThrough chain link he sees a swirl of activity below.  And\none face, looking up at him.  Kind of casual.  Lenny\nclocks the guy: cop instincts coming out.  Decides he\ndoesn't know him.  But we do.  It's Spreg.  Lenny walks\non, crosses to a door, and enters...\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  VJ BOOTH/RETINAL FETISH"
  },
  {
   "type": "stage direction",
   "text": "A tiny room overlooking the dance floor.  Crammed with\nelectronic gear, at the center of which is Tex Arcana,\nwhipping from one deck to another, hands flying.  He's in\na wheelchair, which pivots nimbly, managing to high-five\nLenny as he walks in."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "So, those rascals still haven't\ngrown back yet, huh?"
  },
  {
   "type": "stage direction",
   "text": "(peering under the\nblanket on his lap)"
  },
  {
   "type": "speech",
   "character": "TEX",
   "text": "Nope.  Guess not.  Any day now,\nthough."
  },
  {
   "type": "stage direction",
   "text": "(handing Tex a Squid)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Present.  Something I had made.  Let\nme know what you think."
  },
  {
   "type": "speech",
   "character": "TEX",
   "text": "Hey, alright.  Got something here\nfor you, too."
  },
  {
   "type": "stage direction",
   "text": "(passes him an\nenvelope)"
  },
  {
   "type": "speech",
   "character": "TEX",
   "text": "It just showed up tonight, don't\nknow who left it."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Fan mail from some flounder?"
  },
  {
   "type": "stage direction",
   "text": "Lenny looks at the envelope, which has \"Nero\" hand-printed\nin block letters.  Tex takes a pull from a flask as he\ntakes a squid-deck out of a drawer and sticks the tape in.\nHe puts on the headset and pushes PLAY.\nIN POV we are on a beach.  Early morning.  We are running\nflat out, with the wind.  Looking down... we are barefoot\non the wet sand.  Foaming water races up the sand and\nbreaks around our strong male legs.  Looking up again, to\nsee our running companion... a beautiful lithe woman in\nshorts and T-shirt.  She laughs and we speed up.  An\nexquisite moment of pure life force.\nTIGHT ON TEX'S FACE... as a tear leaks from the corner of\nhis eye.  He is smiling like he is listening to beautiful\nmusic.  We see the quiet magnificence of Lenny's gift.\nTex opens his eyes.  Looks for Lenny to say thanks: but\nLenny's gone.  Not a guy to hang around for thanks-yous.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  RETINAL FETISH"
  },
  {
   "type": "stage direction",
   "text": "As Lenny comes down the stairs from the VJ booth, tearing\nopen the envelope.  An unmarked Squid tape falls into his\nhand.\nThe HOUSE LIGHTS dim and the STAGE LIGHTS come up.  And\nFaith is standing there.  Like she beamed in.  She is\nwearing a revealing leather outfit, showing a lot of her\nmilk-white skin.  Her black hair frames her eyes, giving\nher an intense feral look.  Faith starts to sing.\nBeautiful, unearthly, clear notes.\nSUDDENLY the band kicks down with a wall of thundering\nsound.  Faith explodes into motion.  Her body convulses\nlike a 440 volt mainline is hooked up to her.  Her voice\nbecomes a scream, an inchoate wail, a police siren.  The\npain and rage of an entire, hell-bent tormented planet on\nits eve of judgment.\nLost in the song, Faith has found herself.  She wheels\nacross the stage, slashing her head up and down so that\nher hair bursts in the strobe-flashes like flak.\nA techno-erotic pagan.  A force of nature.\nLenny is mesmerized.  He has seen this before, many times.\nBut it always has the same effect on him.  He is\ntransported into another world by her, a world in which\nthere is only the two of them.\nTIGHT ON MACE, eyes on the stage... a big piece of the\npuzzle suddenly fits.  She's never seen Faith perform\nbefore.  Holy shit.\nFaith doesn't play to the audience, or engage them in any\nway.  She is merely taking what's in her head and letting\nit out.  She doesn't care if they are there or not.  Now\nshrieking into the silence after a climatic downbeat, and\nholding the note... holding it longer than you believe she\npossibly could.  Then nothing.\nWhen it is over she just drops the microphone and walk\naway.  Fuck you.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  RETINAL FETISH/BACKSTAGE & DRESSING ROOM"
  },
  {
   "type": "stage direction",
   "text": "At BACKSTAGE, Lenny wends his way through the warren of\ncorridors... past dim rooms full of wire junkies and\nplayback freaks, all trapped into Squid nirvana: post-\nmodern opium dens.  Sinister and scary.  He glimpses\nFaith, going into her dressing room.  He hurries...\n... but she doesn't even look around when his reflection\nappears in the cracked mirror above the crummy vanity\ntable.  She is drenched with sweat.  Spent.  Chugging a\nbeer.  This is the first time they have been alone\ntogether in real-time for months.  Pain and the memory of\njoy."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Hi, baby.  I've missed you."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "I know.  Lenny, if Tran finds you\ntalking to me he'll hurt you."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I'm already hurting."
  },
  {
   "type": "stage direction",
   "text": "She doesn't turn.  Just watches him in the mirror.  Most\nof the scene plays this way.  It is a cold parody of their\nlove-making playbacks."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "You have to go.  I mean it."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Yeah, OK, whatever you say.  Just\nanswer one question.  Is anything\nwrong?  Iris said you might be in\ntrouble."
  },
  {
   "type": "stage direction",
   "text": "(startled, turning\nto him)"
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "You talked to Iris?  When?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Tonight."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Well I haven't seen her in months.\nWho knows what's going on in her\nhead.  You're really running out of\nexcuses to come around, aren't you?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I know you Faith.  You're afraid of\nsomething.  What's going on?"
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Let it alone, Lenny.  It'll take\ncare of itself."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "It's Tran, isn't it?  This guy is\npoison, Faith.  Listen to me.  He's\ngot you walled in on all sides.  And\nhe uses the wire too much, he gets\noff on tape, not on you."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "That's a good one, coming from you."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Why don't you just split?  You don't\nlove him, anybody can see that.  And\nto him you're just some kinda\npossession, like a Ferrari,\nsomething to show the other guys."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "He has his uses too."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "What?  He gonna record you on his\nlabel?"
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Maybe."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Come on, Faith!  He's just toying\nwith you.  And when he gets bored,\nyou'll be yesterday's papers."
  },
  {
   "type": "stage direction",
   "text": "Lenny is right behind her now.  He puts his hands on her\nshoulders, tenderly."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Look, baby, I've watched you create\nyourself out of nothing.  You're\nlike a goddamn cruise missile,\ntargeted on making it.  And you\nwill."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Damn right."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "It's you up on that stage, not him.\nYou don't need him."
  },
  {
   "type": "stage direction",
   "text": "She shrugs away from his touch.  Cold again."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "You have to get out of here.  If\nTran catches you he'll... he's\nacting crazy.  He's doing way too\nmuch playback and he's getting\ncompletely paranoid.  He's such a\ncontrol freak, he's even paying Max\nto follow me around."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Max Pelcher?  You're kidding?"
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Yeah, for about a month now.  Lenny,\njust stay away from Tran, okay?  And\nstay away from me.  Stop trying to\nrescue me.  Those days are over.\nI'm a big girl now.  Stop trying to\nsave me, okay, because I don't need\nsaving... Just... give up on me."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Can't do it."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "You know one of the ways movies\nstill have Squid beat?  Because they\nalways say \"The End.\" You always\nknow when it's over.  It's over!\nNow please leave.  I have to go on\nagain in a couple of minutes."
  },
  {
   "type": "stage direction",
   "text": "She looks at him and, after a moment, he nods and leaves.\nAs the door closes behind him, Faith tosses her towel on\nthe table.  She looks frightened and alone."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Hell."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  RETINAL FETISH/CORRIDOR AND MAIN FLOOR"
  },
  {
   "type": "stage direction",
   "text": "Turning a corner from the dressing room into the CORRIDOR,\nLenny runs into Max."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Shoulda told me about your new gig,\nbuddy."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "I was gonna tell ya.  Hey, it's just\na job.  I feel like shit about it."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "You should feel like shit."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "I figured, what the hell, I could\ntake the prick's money and make sure\nFaith was OK at the same time.  Do\nus both good.  Right?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Fairly twisted logic, Max, even for\nyou."
  },
  {
   "type": "stage direction",
   "text": "(already over it)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Hey, at least you got a job!"
  },
  {
   "type": "stage direction",
   "text": "(slaps him on the\nback)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Watch her for me.  Stay on her."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "I'm on her."
  },
  {
   "type": "stage direction",
   "text": "Lenny climbs the stairs to the MAIN FLOOR, pushing his way\nthrough the crowd.\nVita, watching the backstage area leans over to Tran,\nwhispers in his ear.  Tran makes a sign to Beemer, and he\nstands to go after Lenny.\nMace, at the bar, sees the Tran-Vita-Beemer action, looks\naround for Lenny.  Can't find him.  But figures there's\ngot to be only one reason Beemer's on the prowl: he's\nlooking for Lenny.  She whips out her cellular.\nCUT TO: Beemer, grabbing Lenny in a painful come-along\nhold and hustling him toward the back of the club.\nLenny's cellular rings."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Can I get that?"
  },
  {
   "type": "stage direction",
   "text": "He reaches for his cellular, connects with...\nMACE, over by the bar."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Hey Lenny, where the hell are you, I\nthink Tran's got Beemer looking for\nyou."
  },
  {
   "type": "stage direction",
   "text": "BACK TO: Lenny, as he's hustled out the rear door."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Thanks for the tip."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  ALLEY/RETINAL FETISH - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Beemer shoves Lenny into the alley and shuts the door\nbehind him."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I recognize you.  You're Wade\nBeemer.  Running back for the Rams,\nam I right?"
  },
  {
   "type": "stage direction",
   "text": "Beemer, who was about to go to work on Lenny, pauses."
  },
  {
   "type": "speech",
   "character": "BEEMER",
   "text": "Yeah, that's right."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I saw you play, man.  You were good.\nLike a fucking freight train I\nremember saying.  So what happened,\ninjuries or what?"
  },
  {
   "type": "speech",
   "character": "BEEMER",
   "text": "Bullshit politics."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "It's always politics.  Like this\nthing we're in here, he's paying you\nto tune me up, right?  But I could\npay you more not to.  See what I\nmean?  I could write you a check\nright now--"
  },
  {
   "type": "speech",
   "character": "BEEMER",
   "text": "Come on, let's go, I got to get\nback."
  },
  {
   "type": "stage direction",
   "text": "(pulling money out\nof his pocket)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Okay cash!  Logical.  Here's\neverything I have on me, what do you\nsay?  How about a Rolex?"
  },
  {
   "type": "stage direction",
   "text": "(barely a glance at\nit)"
  },
  {
   "type": "speech",
   "character": "BEEMER",
   "text": "I already got a real one.  Come on,\nit won't be too bad.  It's not\npersonal."
  },
  {
   "type": "stage direction",
   "text": "(taking off the\nArmani carefully)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Just not the eyes."
  },
  {
   "type": "stage direction",
   "text": "Beemer swings.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  PARKING LOT/RETINAL FETISH - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "As Lenny approaches the car, moving painfully, dabbing at\na bloody nose.  Mace looks at him pityingly."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "They oughta get some lights back\nthere.  A person could get killed\nslipping on those stairs.  Let's go."
  },
  {
   "type": "stage direction",
   "text": "CUT TO: an eerie NIGHT VISION SHOT of Mace and Lenny\ngetting into the limo.  Then we see: Spreg and Engelman,\nthe two street Hun cops.  Watching.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  MACE'S LIMO"
  },
  {
   "type": "stage direction",
   "text": "Lenny slumps in the back seat."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "You're some piece of work, you know\nthat.  Just calmly backstroking\naround in the big toilet bowl, and\nsomehow you never let it touch you.\nI mean, between Vice and this so-\ncalled occupation you're in now, you\nmust've seen it all."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I have crawled through the gutter...\nthrough every wrinkle in the human\nbrain."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "What I'm saying.  But you still come\nout this goofball romantic."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "It is my sword and my shield, Macey."
  },
  {
   "type": "stage direction",
   "text": "Lenny finds the anonymous tape in his pocket.  He looks a\nit, puzzled."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "What's that?  Present from Faith?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "No idea."
  },
  {
   "type": "stage direction",
   "text": "He opens his briefcase, pops the tape into the deck, puts\nthe Squid rig on and closes his eyes.  Maybe he can forget\nabout Faith a minute.  He punches PLAY.\nPOV SEQUENCE: the first thing we notice is that the POV is\ndistorted visually.  The colors are de-saturated.  Almost\nblack and white.  Yet the detail is crisp and clear,\nalmost hyper-real.\nWE ARE WALKING down a windowless hallway at a large hotel.\nAn apparently endless row of doors.  The Wearer's glance\ngoes to the numbers on the doors from time to time.\nWe come to a particular door.  There is a DO NOT DISTURB\nsign on the door.  The Wearer moves to the room next door.\nLooks both ways.  The corridor is empty."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "It's a test pattern so far."
  },
  {
   "type": "stage direction",
   "text": "\"Our\" hands appear, quickly pulling on latex surgical\ngloves.  They look like male hands.  The snapping of the\nrubber is the only sound in the corridor.  The POV hunches\ndown to the lock and we see the hands go to work with\nlock-picking tools.  Several seconds and the lock is very\nprofessionally picked."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Alright, a little B&E action."
  },
  {
   "type": "stage direction",
   "text": "We enter the dark room, which is vacant.  The drapes are\nopen and we see city lights.  It is night.  One gloved\nhand picks up the guest directory and looks at it in the\nmoonlight coming in the window: the SUNSET SHERATON.\nThe Wearer drops the directory and the hands reappear\nholding... a black ski-mask.  He pulls it on, leaving the\nsubsequent POV seen through the eye-holes of the mask.\nThe Wearer now looks into a mirror on the dresser.  He has\navoided his reflection up until now.  We see a man,\ndressed in a jogging suit and black fanny-pack, and of\ncourse the ski-mask.  Totally anonymous."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Hey, getting good.  Solid suspense\nbuild."
  },
  {
   "type": "stage direction",
   "text": "The Wearer crosses to the balcony door.  Opens it quietly\nand goes outside, moving to the wall dividing this room's\nbalcony from the one next door.\nThe Wearer climbs the railing and, six stories above the\npavement, slips around the wall, stepping down onto the\nother balcony.  We hug the wall, looking furtively into\nthe room.  It is a suite.  In the living room we see a\nwoman making herself a drink at the mini-bar.  She\nturns...\nIt is Iris.  She is wearing a T-shirt and panties.\nProbably ready for bed.  She looks like she can't sleep.\nPours the Scotch shakily.\nCUT TO LENNY, the streetlight washing across his face.  He\ngets suddenly serious with a flash of premonitory dread.\nIN POV we see Iris go into the bedroom, out of sight.  We\ncan hear the television on in there.  Using a steel jimmy\nthe Wearer slips the latch on the balcony slider and\nsilently opens it, slipping inside.\nWe stalk quietly to the bedroom door, listening to her\nmovements.  Water running in the bathroom.  We come around\nthe door frame.  Bedroom dark, bathed in TV glow.  Iris in\nthe bathroom, washing her face with cold water.\nWe move toward her.  Crossing the room as she reaches for\na towel.  We are now only a couple of feet away.  She\ncomes out of the bathroom, walking right past us, drying\nher face.  She lowers the towel, turning away... her eyes\nwhip back.  Widening in terror.\nShe reacts with surprising speed, diving across the bed.\nWe go after her.\nHer hand goes under the pillow and comes out with a small\nautomatic.  She whips it around toward us but we grab it\nand twist it away before she can fire.  She smashes the\npalm of her hand into our face and rolls off the bed,\nlightning-fast.\nWe follow her as she scrambles up, running through the\nbedroom door.  Across the living room and down the short\nhall to the front door.  Closing rapidly on her as she\nsomehow gets the chain off the door and gets out into the\nhall.\nSlam!  We tackle her against the far wall of the corridor.\nOur right hand comes into view holding a small electric\nstunner.  ZAP!  We nail her right in the back between the\nshoulder blades.\nShe sags to the floor, gasping.  We zap her again.  The\nWearer's glance does a 180 both ways down the corridor...\nnobody in sight.  We clamp our hand over Iris' mouth and\ndrag her back into her room, locking the door.\nON LENNY, reacting.  Going white."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "What is it?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Go to the Sunset Sheraton.  RIGHT\nNOW!  Just go!  GO!"
  },
  {
   "type": "stage direction",
   "text": "Lenny goes back under the wire, seeing...\nWE ARE DRAGGING a semiconscious Iris into the bathroom...\npropping her up with her back against the white tile\nwall... grabbing her hands and handcuffing them one by one\nto the steel towel rack above her.  She is moaning.  And\ncrying."
  },
  {
   "type": "stage direction",
   "text": "(voice distorted)"
  },
  {
   "type": "speech",
   "character": "IRIS",
   "text": "I haven't seen your face... I\nhaven't heard your voice... you can\nstill let me go..."
  },
  {
   "type": "stage direction",
   "text": "ZAP!  The Wearer hits her with the stunner again.  She\njerks and gasps for breath.  We see our latex-gloved\nfinger come up in front of us and hear SSSHHH.\nMoving quickly now.  Our hands unbuckle the fanny pack.\nPull out something... a set of playback trodes.  Our hands\nplace them on her head.  She stares uncomprehending.\nWhat?  We catch a glimpse of some electronics stuff inside\nthe pack... a record deck, some wires, a small metal box."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Holy shit.  He's jacking her in to\nhis own output.  She's seeing what\nhe's seeing.  She's seeing herself."
  },
  {
   "type": "stage direction",
   "text": "Iris can now see herself as the Wearer sees her... wide-\neyed with terror, white-lipped, weeping.  Helpless.  And\nshe can feel what he feels.\nThe Wearer's hand goes back into the fanny-pack and pulls\nout something else.  A black athletic headband.  We slip\nit over her head, down over her eyes.  A blindfold.  Now\nshe can only see what the wearer sees.\nAnd also from the bag we pull... a yellow plastic object.\nWith our thumb we extend the five inch blade of the razor\nknife, the type with tips that can be broken off by\nsegments when they get dull.  It extends with an ominous\nclicking sound.\nWe lower it toward her and cut up the middle of her T-\nshirt, laying it open.  Exposing her torso.  We then look\ndown and slide the knife under the side band of her\npanties, slicing them off.  We put the knife up to her\nthroat, and she whimpers, afraid to cry out, and then we\ndraw the flat side of the blade across her body as if to\ntease her with the prospect of her death.\nMACE LOOKS AT LENNY'S EXPRESSION of dawning horror and\npulls the car to the curb about a half-block from the\nSunset Sheraton.  Lenny is hyperventilating, shifting in\nhis seat as if ants are crawling over him.  He is\nexperiencing the stalker's exhilaration.\nIN POV we see the Wearer pull his jogging pants down below\nhis knees (R-rated please) and reach for Iris.  Kneeling\nin front of her, he pushes her legs apart and pulls her\nhips forward onto him, pushing into her.\nIris is feeling and seeing what he sees and feels... She\nfeels her own pain and humiliation swirling with the\nkiller's exhilaration.\nON LENNY, sweating and barely able to breath.  Mace stops\nthe tape... concerned by Lenny's reaction.  He opens his\neyes... Mace see the fear there, of what the tape may\nreveal.  But he shakes his head.  He has to know.  He\npushes her hand away and punches PLAY.\nIT FLOODS INTO HIS HEAD AGAIN.  The sweaty, grunting\nhorror.  The stalker picks up her slit T-shirt and quickly\nwraps it around her neck.  He knots it tight and twists\none powerful hand into the knot.  The muscles in his\nforearm look like cables as he turns the knot tighter.\nThe stalker viciously twists the knot a full turn and the\nT-shirt fabric almost disappears into the skin under her\njaw.\nVia her trodes, Iris watches herself die.  Her death comes\nat the moment of his orgasm which is fed to her...\nblasting off the planet on total overload... terror, pain,\ndeath merging with ecstasy and exultation at the same\ninstant.\nON LENNY, crying out and grabbing for the trodes, but he\njust holds onto them, as if they are sucking his brains\nout of his skull."
  },
  {
   "type": "stage direction",
   "text": "(like a mantra)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "On my God.  Oh my God."
  },
  {
   "type": "stage direction",
   "text": "BACK TO POV, a glimpse of the Wearer's hand relaxing the\nknot.  Iris' head lolls.  Her mouth is slack and open.  We\nremove her blindfold.  Her eyes are half-lidded.  Very\ndead looking.  Our fingers gently push them wide open.\nBACK TO LENNY, looking like he has been gut kicked.  He\ngasps for breath.\nTO POV, as the killer's hand calmly moves Iris' head from\nside to side... studying her dead face.  Her staring eyes.\nHe leans very close to her and stares into one dead eye,\nthe pupil wide, seeing nothing.\nA burst of static.  End of tape.\nLenny opens his eyes.  He fumbles open the car door and\npractically rolls out onto the sidewalk.  The trodes pull\noff his head as he lurches up, reeling across the sidewalk\nto a darkened storefront where he leans for support.  He\ndoubles over and heaves up the contents of his stomach.\nMace circles around the car and catches him as he sags to\nhis knees.  She holds his shoulders while he throws up\nagain."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "My God, Lenny.  What is it?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Black.  Jack."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Blackjack?  I don't understand--"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Snuff clip.  It was Iris.  She said\nshe needed my help and I... aw\nJesus, Mace... the sick fucker\nkilled her."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Are you sure it's real?"
  },
  {
   "type": "stage direction",
   "text": "Lenny looks up, in the direction of the hotel.  Mace\nfollows his glance.  They notice for the first time: cop\nlights; cop cars; ambulance; coroner's wagon.\nCLOSE on Iris' body, in a bag, being loaded into the\ncoroner's van.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  PARKING LOT/DIM SUM JOINT/LITTLE TOKYO - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Neon reflections on the roof of Mace's limo as it pulls\ninto the lot and slides up to Max's car.  Max is sitting\nin the open door, feet on the pavement, eating dumplings\nfrom a take-out carton.  He looks up as Lenny and Mace get\nout of the limo.  Sees their expressions."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Ohhhh shit."
  },
  {
   "type": "stage direction",
   "text": "TIME CUT: Lenny, sitting on the hood of Mace's Lincoln,\nhas his head propped in his hands.  His eyes are\ndistant... replaying.  Still shocked to his soul.  Mace\npaces nearby.\nMax sits in the open door of his car ten feet away, trodes\non, playing back the tape.  His face is transformed into\nan ashen mask lit by neon... mouth open in shock.  With\nshaky hands he stops the deck.\nOpens his eyes.  Long beat.  He glances down at the dim-\nsum carton in his hands."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Well... I've lost my appetite."
  },
  {
   "type": "stage direction",
   "text": "(lofts it into a\nnearby dumpster)"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "For about a year."
  },
  {
   "type": "stage direction",
   "text": "He gets to his feet, offering the deck and trodes to Mace."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "No way."
  },
  {
   "type": "stage direction",
   "text": "Max pulls a hip-flask full of tequila from his army jacket\nand takes an eye-watering pull.  Offers it to Lenny, who\nfollows suit."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "You alright?  Y'okay?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Yeah.  No, not really."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Let's work it."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Not now... I don't want to think\nabout it--"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Come on, Lenny.  You used to be good\nat this stuff.  Play it down.\nWhat's the perp doing?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "He stalks her.  He rapes her.  Then\nhe does her..."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "And he records it.  Thrill kill.\nWants to see it again.  And again."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "He records himself raping and\nkilling her--"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "But at the same time he's sending\nthe signal to her--"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "So she feels... what he feels...\nwhile he's in her.  The thrill while\nhe's killing her... is sent to her,\nheightening her fear... which in\nturn heightens the turn on for him."
  },
  {
   "type": "stage direction",
   "text": "(turns to him)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I've seen a lot, Max."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "So've I.  Too much."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "But this is a bad one."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Top ten."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "He makes her see her own death,\nfeeds off the reaction... killer and\nvictim merging... orgasm and agony\nmerging.  And he records it all."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "And gives it to you."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Wants to share."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "That's right.  He wants to share.\nNeeds an audience.  This is one sick\npuppy."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Why me?"
  },
  {
   "type": "stage direction",
   "text": "Mace is hugging herself.  Edgy and tense."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Cause you're the man, right?  The\nMagic Man.  If it's got something to\ndo with the wire, sooner or later it\nwashes up on your beach."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I've never dealt in black-jacks.\nNever.  Everybody knows that."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "He's skull-fucking you, bud.  Trying\nto get a reaction.  Maybe pushing\nyou to do something."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Maybe he just figures Lenny will\nappreciate what he's created.  It's\nthe dark end of the street, Lenny.\nHow do you like it now?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Jesus, Mace.  Back off."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "This guy is someone you know, one of\nyour squid-head contacts."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Problem is, Lenny knows everybody."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Take the tape to the cops."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Uh unh.  No way!  They'd crucify me."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "So some psycho wire-freak gets to\nkeep running around--"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Naw, he's right.  They'll figure\nLenny's the perp, or go through his\nclient list, ruin his life... such\nas it is.  Look, I'll call the guys\nin Homicide... tell them she was a\nfriend of mine and they'll keep me\nin the loop.  Get me the forensics\nand all that."
  },
  {
   "type": "stage direction",
   "text": "(he opens his car\ndoor)"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Get some sleep.  I'll call you when\nI get something."
  },
  {
   "type": "stage direction",
   "text": "(he starts his car)"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "And Lenny... I'd keep moving if I\nwere you."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  ELEVATOR AND TRAN'S LOFT"
  },
  {
   "type": "stage direction",
   "text": "The elevator is huge -- big enough for a truck -- and\nLenny seems small in the huge space, while shadows crawl\nacross his body as the old machinery pulls him up\ntoward...\nFAITH, in the loft above.  She looks into the vast\nbedroom...\n... at Tran sitting in a chair, tranced out under playback\ntrodes, his eyes closed.  She softly closes the sliding\ndoor and walks across the cavernous main room.  The place\nis lit by the flickering reflections from a series of huge\ntelevision screens along both walls.  Otherwise there is\nlittle light.  The cavernous loft is sparsely but very\nexpensively furnished.  Haute-tech design.  Total contrast\nto Lenny's ratty digs.\nLENNY'S POV through the cage-door of the elevator as it\nreaches the loft and Faith is revealed, waiting for him in\nthe shadows.  He slides open the cage-door and she moves\nquickly to him."
  },
  {
   "type": "stage direction",
   "text": "(whispering, furtive)"
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "You're crazier than I thought,\nLenny.  Coming here... Tran's just\nin there."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Iris is dead.  She was murdered."
  },
  {
   "type": "stage direction",
   "text": "Faith stiffens.  We see the fear, now, exposed."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Who did it?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Don't know.  But this guy's real\ndamaged goods.  Iris knew someone\nwas after her... and she said you\nwere in danger too."
  },
  {
   "type": "stage direction",
   "text": "(he grabs her\nshoulders)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Now no more games, Faith.  Whatever\nyou're hiding, whatever's going on,\nyou have to get out of here now.\nCome with me right now.  Don't even\nthink about it."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Then what?  Then what, Lenny?!  You\ngoing to protect me?  Big tough guy.\nYou're a talker, Lenny.  You don't\neven have a gun."
  },
  {
   "type": "stage direction",
   "text": "(hurt)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I have a gun.  It's under my bed."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "You don't know what you're fucking\nwith here."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Tell me."
  },
  {
   "type": "stage direction",
   "text": "A VOICE from the shadows, like the whisper of a blade in\nthe air."
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "Go ahead, Faith.  Tell him."
  },
  {
   "type": "stage direction",
   "text": "Tran steps forward, totally at ease with the situation.\nOut of the shadows behind him step Joey Corto, Duncan and\nVita Minh."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Look, Tran... Lenny just came by to\ngive me some bad news.  An old\nfriend of mine has been murdered.\nYou remember Iris?"
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "A tragic story, no doubt."
  },
  {
   "type": "stage direction",
   "text": "(to Lenny)"
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "How'd you get up here?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Charm."
  },
  {
   "type": "stage direction",
   "text": "(looks at Faith)"
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "Uh huh.  Look, Nero.  I'll make you\nan offer."
  },
  {
   "type": "stage direction",
   "text": "(he grabs Faith by\nthe arm, steps\ncloser)"
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "Take her.  Right now.  If she wants\nto go, if she's unhappy here, she\ncan go.  I'll let her choose.  Faith\nalways knows what she wants."
  },
  {
   "type": "stage direction",
   "text": "(he turns her loose)"
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "Hands off.  See?"
  },
  {
   "type": "stage direction",
   "text": "Lenny glances at the open elevator right behind him.  So\nclose.  She just has to take one step to him... and they\nwill be out of there.  Together."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "It's alright.  He means it."
  },
  {
   "type": "stage direction",
   "text": "(to Faith)"
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "I do mean it."
  },
  {
   "type": "stage direction",
   "text": "(to Lenny)"
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "And I mean this... if Faith stays\nyou go away and never come back.\nYou scuttle back into your cockroach\nhole and never cross my vision\nagain.  You understand?"
  },
  {
   "type": "stage direction",
   "text": "She glares at them both for a long moment.  Emotions play\nacross her face, complex and unreadable.  She steps back,\ntaking her place at Tran's side."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "I made my choice, Lenny."
  },
  {
   "type": "stage direction",
   "text": "(to Lenny, nodding\ntoward the elevator)"
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "You're going down."
  },
  {
   "type": "stage direction",
   "text": "Joey Corto and Duncan shove Lenny roughly backward into\nthe elevator.  Corto slams the gate shut and slaps a\nbutton to lower the lift.  The last thing Lenny sees as he\ndescends is Faith's face, above him."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "I don't love you, Lenny.  Give up."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  BEDROOM AREA/TRAN'S LOFT"
  },
  {
   "type": "stage direction",
   "text": "Faith is crying as Tran comes up behind her."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "You said you were going to get her\nout of this."
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "Maybe now you appreciate the danger\nwe're in."
  },
  {
   "type": "stage direction",
   "text": "(he moves very close)"
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "It was touching the way you stood by\nme in there.  \"Stand by your man\".\nI was moved.  You were very good.  I\ndon't think he even understands that\nyou did it for him."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "He doesn't know what's going on.\nLeave him alone."
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "I'd love to.  But he keeps showing\nup.  And you keep talking to him.  I\ncan't have that--"
  },
  {
   "type": "stage direction",
   "text": "And he slaps her.  Really hard.  Decks her.  He's\ntrembling with rage... and something else.  Fear."
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "The only time a whore should open\nher mouth is when she's giving head."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Fuck you."
  },
  {
   "type": "stage direction",
   "text": "(walking away)"
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "Maybe later."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  ELEVATOR/TRAN'S LOFT"
  },
  {
   "type": "stage direction",
   "text": "The huge elevator, with Lenny its sole occupant, descends\nthrough the shadows toward the first floor.  Lenny watches\nthe shadow patterns on the wall through the iron grillwork\ndoor.  He's still thinking about Faith...\n... even when the elevator reaches the first floor and\nMace comes into view.  She's waiting for him.  He steps\nforward.  But he can't open the grillwork door.  And the\nelevator doesn't stop.  It keeps going down.  Lenny,\nspooked, works the door hard... as Mace disappears from\nview above him...\n... and the elevator bumps to a stop in the basement.\nWith Vita and the beef squad waiting for Lenny, stoney-\nfaced.  Last stop.  All out.\nLenny tries to keep the door shut, but Duncan wrenches it\nopen.  Vita grabs Lenny and twists his arm painfully\nbehind him in one fluid move.  They hustle him toward a\ndank basement room near the elevator."
  },
  {
   "type": "stage direction",
   "text": "(speed-rap)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Listen, can we be smart here?  I\ncould make it really worth your\nwhile... I could cut you a check for\n500 each... hell, make it an even\ngrand... I'm not saying you don't\nland a couple shots, just go light\nis all I'm saying... here, take my\nRolex."
  },
  {
   "type": "speech",
   "character": "CORTO",
   "text": "Lemme see."
  },
  {
   "type": "stage direction",
   "text": "A glimmer of hope in Lenny's eye as he whips it off his\nwrist.  Corto doesn't even look at it.  Gets it over his\nhand about mid-way, then -- using the watch like a pair of\nbrass knuckles -- clobbers Lenny in the face.  Watch parts\ngo flying as Corto steps away and Duncan slams Lenny up\nagainst a column.\nVita weighs in... gut-punching Lenny savagely.  She works\nhim expertly, with a series of painful jabs.\nHe sags to his knees.  Not only is this painful.  It's\ngoddamn humiliating.  And Duncan and Corto enjoy every\nsecond of it."
  },
  {
   "type": "speech",
   "character": "CORTO",
   "text": "We tried to find a smaller girl, to\nbeat the shit out of you, Lenny...\nbut it was short notice."
  },
  {
   "type": "stage direction",
   "text": "Vita grabs Lenny by his hair and pulls him up with one\nrock-hard arm.  She is cocking back the other arm for a\npile-driver punch when...\nSuddenly a dark shape materializes behind her.  Mace\ndrives Vita head first into the steel column.\nDuncan lunges in and grabs for Mace.  This is a mistake.\nMace doesn't fight fancy.  And she doesn't fight fair.\nShe fights to win.  And she is awesomely fast.  Her moves\nare street moves, coupled with arm-locks and come-alongs\nshe has been trained to use as a security driver.\nLenny recovers enough to size up Vita, who is still a\nlittle stunned.  She has blood dripping in her eyes and\ncan't see too well.\nBut she charges him.  And -- being the gent that he is --\nhe busts her over the head with a dusty old folding chair.\nMace drops Duncan about the time Vita is hitting the\nground, leaving...\nCORTO, who fumbles out a Beretta 9mm and sticks it in\nMace's face.  He sniggers, loving the upper hand."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Safety's on."
  },
  {
   "type": "stage direction",
   "text": "And like a jerk, he looks.\nShe snaps sideways in a headfake and closes blindingly\nfast, twisting the gun out of his hand.  She continues to\ntwist his wrist brutally and Corto goes down to one knee,\ngroaning.  She takes his Beretta and backhands the barrel\nhard across his face.  Mace releases his wrist and he\ncrumples in a heap.\nShe and Lenny back out the door.  Then Lenny runs back in\nand kicks Corto in the ribs."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Lenny!"
  },
  {
   "type": "stage direction",
   "text": "Mace grabs him and pulls him out of the room, then slams\nthe metal firedoor behind them, locking it with a piece of\njunk wedged behind the release bar.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  STREET - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Mace and Lenny hotfoot it toward the parked limo.  Mace is\ndisassembling the Beretta without looking at it.  She\nchucks pieces over a chain-link fence as they go.  Lenny\nbrushes himself off, checking his jacket for damage.  He\nis high from winning the fight."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Is this great fabric or what?"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "You ever wonder why you get beat up\na lot?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Never really thought about it."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  LENNY'S APARTMENT"
  },
  {
   "type": "stage direction",
   "text": "Squid POV: the killer enters the vacant hotel room,\npassing the mirror on the dresser."
  },
  {
   "type": "speech",
   "character": "LENNY (V.O.)",
   "text": "Come on... look in the mirror.  You\nknow it's there, you're keeping your\neyes off it, you bastard... SHIT!\nWho are you?"
  },
  {
   "type": "stage direction",
   "text": "CUT TO: Lenny, yanking the wire off his head, Mace near\nhim."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "He knows what he's doing.  He's worn\nbefore... a lot."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "So that gives you something."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "It gives me... I don't know... maybe\ntwo hundred people who I know wear."
  },
  {
   "type": "stage direction",
   "text": "As he talks Lenny fiddles with some custom electronics\ngear.  The back is off the deck, and he has a ribbon wire\nconnecting it to some kind of amplifier black-box which he\nis using to boost the gain."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Don't crank the gain any more.\nYou're gonna fry yourself."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I need to see more... get more\ndetail.  Something.  I feel his\npresence, so strong..."
  },
  {
   "type": "stage direction",
   "text": "Mace watches, concerned, as Lenny puts the trodes back on\nand hits playback.\nSquid POVs: strobe-like images of Iris' rape and death,\nseparated by burst of static...\n... as Lenny keeps hitting the forward and rewind buttons,\nsearching the tape for clues, reacting to the feelings on\nthe tape, trying to manage his revulsion...\n... until Mace yanks the trodes off and Lenny sags back on\nthe couch.  He rubs his eyes.  He is seeing ghosts,\nafterimages burned into his visual cortex.  The room is\nalive with them, shimmering."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "No more, Lenny."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Yeah.  I'm ghosting pretty bad."
  },
  {
   "type": "stage direction",
   "text": "Lenny see Iris' terrified face.  Literally.  It floats\niridescent on his living room wall, fading slowly."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "She came to me for help.  I should\nhave read it better... I just\nfigured, y'know... another strung-\nout hooker having a bad night."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "It's not your fault."
  },
  {
   "type": "stage direction",
   "text": "Lenny gets up, staggering to the kitchen.  She goes with\nhim."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Sex killers act alone.  So there's\nno information on the street, which\nis how cases get made.  Cops know\nthey'll never nail this guy the\nsecond they look at the scene."
  },
  {
   "type": "stage direction",
   "text": "Lenny sucks down four Tylenol with a long pull from a\nbottle of vodka."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "And anyway, nobody gives a shit\nabout a dead hooker.  They're\nroadkill."
  },
  {
   "type": "stage direction",
   "text": "Requiem for Iris.  Mace watches Lenny rubbing his eyes,\nwaiting for the Tylenols to hit."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "See, it's all about what they see\nwalking in.  A dead hooker,\nhandcuffs, penetration... they'll\nsee a trick gone wrong.  Random\nkill.  The kind you never solve."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "But that doesn't add, does it."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "No it doesn't."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Because Iris knew somebody was after\nher."
  },
  {
   "type": "stage direction",
   "text": "Lenny, wound up like a Swiss movement, starts pacing."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "She said \"If they get me\".  They.\nWhich means the whole sex-killer\nthing is a cover, which means\nsomebody whacked her for a reason."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "So the guy's not a sicko."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "If he could do what's on that tape,\nhe's a sicko."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Okay, so he's a freak who thinks\nhe's sane pretending to be a freak.\nThe point is, he was a hitter.\nSomebody wanted to shut her up.  But\nwhy not just put a little lead in\nher ear?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Because it had to look random.  Not\nconnected to anything or anyone."
  },
  {
   "type": "stage direction",
   "text": "(he seems to run out\nof energy)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "But then why give the rape to me?"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "That's where it gets a little\nstrange."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "And what about the guy that was\nfollowing me?"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Now you're really getting paranoid."
  },
  {
   "type": "stage direction",
   "text": "Lenny collapses on the couch, rubbing his temples."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "The question is not whether I am\nparanoid, but whether I am paranoid\nenough.  You want to rub my neck?"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Sure."
  },
  {
   "type": "stage direction",
   "text": "Mace sits next to him and starts to work.  Strong, knowing\nfingers.  Lenny starts to relax a little."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "How's Zander?"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "OK.  He asks about you all the time.\nIt's been weeks since you've seen\nhim."
  },
  {
   "type": "stage direction",
   "text": "Lenny sort of keels over.  His head slumps in her lap."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "I'm sorry about getting on your case\nearlier.  I just see you getting\nsucked in deeper and deeper, and I\n-- anyway.  I'm sorry."
  },
  {
   "type": "stage direction",
   "text": "(drifting off,\njoking)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "S'okay.  I know you still love me."
  },
  {
   "type": "stage direction",
   "text": "She looks down at him, gently brushes his hair off his\nsweaty forehead in an unconsciously maternal gesture.  He\nis out cold.\nMace gazes at Lenny's sleeping face in a way we haven't\nseen before: unguarded.  Caring.  Loving.\nAnd we get it: she does love him.  It makes no sense, and\nit is a great burden to her that he doesn't see her... but\nthere it is.\nShe shakes it off: she doesn't want to deal with it now.\nMaybe not ever.  She leans her head back against the ratty\ntop of the couch, sighs.  And keeps her hand moving\nsoothingly on his head.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "EXT./ INT.  MACE'S HOUSE/INGLEWOOD - DAY"
  },
  {
   "type": "stage direction",
   "text": "Mace pulls the limo into the driveway of a modest stucco\nhouse in Inglewood.  It's dawn.  A neighbor is walking the\ndog.  Mace heads into the house, picking up a couple of\ntoys left scattered in the front yard.\nInside, ZANDER, age 6, is watching TV in his pajamas and\neating a bowl of cereal.  Behind him, on the couch, is\nMace's younger sister CECILE, zee'd-out.  Zander frowns at\nher and looks at a red-plastic (toy) watch."
  },
  {
   "type": "speech",
   "character": "ZANDER",
   "text": "Where were you Mom?  Did you meet a\nguy?"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Just Lenny."
  },
  {
   "type": "speech",
   "character": "ZANDER",
   "text": "Right.  That explains it."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Are you going to make me beg?"
  },
  {
   "type": "stage direction",
   "text": "Zander scrambles over to his mom, throws his arms around\nher.  Big hug."
  },
  {
   "type": "stage direction",
   "text": "(looking at weird\nstuff in cereal)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "What is that?"
  },
  {
   "type": "speech",
   "character": "ZANDER",
   "text": "Cheerios and wieners.  I made it\nmyself.  It's good."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Well give me some then... I'm\nstarving."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  LENNY'S APARTMENT"
  },
  {
   "type": "stage direction",
   "text": "2:20  P.M.  DEC 31\nLenny wakes up to the sound of the phone ringing.  He is\non the couch, still clothed.  He hears Max's voice on the\nanswer machine and groggily grabs the receiver."
  },
  {
   "type": "speech",
   "character": "MAX (V.O.)",
   "text": "Hey, the last day of the world and\nyou spend it in bed."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "W'sup, Max?"
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  A.M.E. CHURCH AND STREET/SOUTH CENTRAL - DAY"
  },
  {
   "type": "stage direction",
   "text": "Max, on the cellular, across the street from a church\nwhere mourners stream out of a memorial for Jeriko One.\nThe sidewalk and street are clogged with fans, and further\noff -- a cordon of very anxious-looking crowd control\ncops."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Not a whole hell of a lot.  They've\njust been saying words over Jeriko.\nTensions running pretty high down\nhere.  I'm telling you."
  },
  {
   "type": "stage direction",
   "text": "WHAT MAX SEES across the street... SLOWMO as Tran comes\nout of the church with Faith next to him.  Corto, Vita,\nDuncan and Beemer form a loose protective shell around\nthem as the press bears down, shouting out questions.\nTran ushers Faith into a waiting limo and climbs in after\nher.  The rest of the muscle keeps the press away from the\ncar as it pulls away.\nCUT TO: Max, still on the phone to Lenny."
  },
  {
   "type": "speech",
   "character": "LENNY (V.O.)",
   "text": "Faith OK?"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Yeah.  She's leaving with Tran so I\ngot to boogie.  Real quick... Iris\nchecked into the Sheraton last night\nunder a false name.  Paid cash."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Looks like she was holding out."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Yup.  Hey, so I heard you dropped in\non Tran last night.  Another slick\nLenny move."
  },
  {
   "type": "speech",
   "character": "LENNY (V.O.)",
   "text": "He's in this somehow... I don't know\nhow.  Just stay close to Faith."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "I'm on her, amigo.  No worries.\nGotta jam."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  LENNY'S APARTMENT"
  },
  {
   "type": "stage direction",
   "text": "As Lenny is hanging up he notices something.  A MANILA\nENVELOPE stuck between the steel bars and the glass of his\nfront window, next to the door.  \"NERO\" is printed on the\nenvelope.\nOh shit.  He opens the door, looking both ways.  No-one is\naround.  He fishes out the envelope from behind the bars\nand takes it inside.  Of course it contains a tape.  He\nstares at it with dread.\nLenny sits down and put the tape in his playback deck.  He\npicks up the trodes and places them on his head.  He\nnotices his hands are shaking.  He takes a deep breath and\npunches PLAY.\nPOV SEQUENCE: DAY.  As expected we see the de-saturated\nsignature look of the killer's vision.  The Wearer is\nwalking through the courtyard of Lenny's apartment\nbuilding.  We recognize it by the unkempt pool, the sunken\ndeck furniture.  We walk through a breezeway to an ally-\nlike courtyard behind the building.  We approach a door...\nthe back door to Lenny's apartment.\nThe killer picks the lock on the back door.  Opens the\ndoor and enters.  The apartment is dark, blacked out.  We\nare in the kitchen.  We stop and listen.  Water dripping\nin the sink.  Soft snoring from the living room.\nMoving to the other room.  Slowly, silently.  Furtively\nlooking around the door frame to the living room.  There\nis Lenny, crashed out on the couch.\nNow moving stealthily toward him.  Kneeling down beside\nhim.  Lenny, burned out from the night before, is deep\nunder.  Our hand comes into view, holding the yellow\nplastic razor knife.  With his thumb, the killer extends\nthe blade... click, click, click, click.\nThe blade flashes in a beam of sunlight as it moves toward\nLenny.  The killer lays it gently against Lenny's throat.\nDraws it slowly across... not leaving a mark.\nThe POV backs away and -- static as the tape ends.\nLENNY, IN THE PRESENT, whips off the trodes, freaking.  He\nfeels around his throat with one hand... can't feel\nanything.\nCrossing quickly to a mirror near the front door, he\ninspects his neck minutely.  There is a hair-line red line\nover his carotid.  He looks around the room wildly, his\nheart hammering.  Slowly, he gets his breathing under\ncontrol.\nThen... he hears something in the kitchen.  A tiny click.\nHis eyes go wide.  Hyperventilating, Lenny moves silently\ninto the bedroom.  He fishes around under the bed and\npulls out a GLOCK 22 .45 auto pistol.  He stalks silently\ntoward the kitchen.\nThen he looks at the butt of the pistol-grip: no magazine.\nHe un-stalks back to the bed and finds a loaded magazine\nunder a bunch of dirty socks.  He inserts it quietly,\nwincing as he chambers a round.\nHeart thudding, he works his way to the kitchen door.  He\nedges around the frame, pie-ing the room.  Cop reflexes\nintact.\nMace is sitting at the kitchen table, giving him a funny\nlook.  She is drinking a cup of coffee, made from the\nbottle of instant on the counter.  She is dressed\ncasually, in bicycle pants, work boots and oversized nylon\njacket over a tank-top."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Whatup Lenny?"
  },
  {
   "type": "stage direction",
   "text": "(hands shaking)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Jesus, Mace!"
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  LENNY'S APARTMENT"
  },
  {
   "type": "stage direction",
   "text": "A little later.  As Lenny tosses stuff into a folding bag:\nclothes, a playback deck, a box of .45 hollow points.  He\ngrabs his grimy old Second Chance body armor from the LAPD\nand stuffs it into his Haliburton.  When Mace sees him do\nthat, she knows things are freaky."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Where we going?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Anywhere."
  },
  {
   "type": "stage direction",
   "text": "(finger to his lips)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "We'll talk about it in the car."
  },
  {
   "type": "stage direction",
   "text": "Mace glances around... unnerved by the possibility of\naudio surveillance."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Hand me that box of tapes, will you?"
  },
  {
   "type": "stage direction",
   "text": "He's pointing to a shoe box full of \"Faith\" tapes.  Mace\nhands them over with obvious distaste.  He throws them in\nthe bag, starts to zip it...\n... then sees his reflection in the bedroom mirror:\nsomething's the matter."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "What is it?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "This tie doesn't go with blue!"
  },
  {
   "type": "stage direction",
   "text": "He yanks off the tie and grabs another.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT./ EXT.  MACE'S LIMO AND STREET - DAY"
  },
  {
   "type": "stage direction",
   "text": "Mace and Lenny drive through the streets of LA on the last\nday of this millennium.  There are cops in body armor and\nhelmets on some street corners, holding automatic rifles.\nHelicopters orbit endlessly.  And a National Guard tank\nrumbles down the street.  State of siege.  The car radio\nis on, with KROQ's poor Man hyping the impending\nMillennium LA party."
  },
  {
   "type": "speech",
   "character": "POOR MAN",
   "text": "... the New Years Eve mega-bash of\nthe century.  Ten square blocks of\nmadness, with live music, fireworks\nand the actual rich and famous of LA\nhobnobbing with us peons.  Also\nyours truly the Poor Man will be\nthere at the KROQ bandshell, giving\naway \"Millennium LA\" and \"KROQ 2-K\"\nT-shirts by the truckload--"
  },
  {
   "type": "stage direction",
   "text": "Lenny is keyed up and tense.  He keeps looking out the\nback window."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Will you relax.  There's nobody back\nthere."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Mace, the guy had a knife.  To my\nthroat.  In my living room.\nRelaxing might be right out, okay?!"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "You better keep a low profile for a\nwhile."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "No shit.  You got someplace in mind?"
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  BACKYARD/MACE'S HOUSE - DAY"
  },
  {
   "type": "stage direction",
   "text": "On Zander, face lighting up, giving Lenny a high five.\nLenny drops his bag, shakes, does a little silly hand\nchoreography -- a goof on a bro grip -- that makes Zander\nlaugh.  Mace watches this ritual and smiles herself.\nZander can call out a part of Lenny that Mace would like\nto see more of.\nCecile is there, hanging out with her boyfriend CURTIS,\nand Curtis' friend VEJ.  These two guys are about 18,\ndressed in gangsta garb.  They are listening to \"The\nProphets of Rage\" on a CD player, and watch Lenny with a\ndispassion that flirts with distaste."
  },
  {
   "type": "speech",
   "character": "ZANDER",
   "text": "What do you got?"
  },
  {
   "type": "stage direction",
   "text": "(pulls a tape out of\nhis pocket)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Today I have..."
  },
  {
   "type": "stage direction",
   "text": "(seeing the tape)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Lenny, have you lost it completely?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Easy, there, Mom.  Easy.  This is\naudio only."
  },
  {
   "type": "stage direction",
   "text": "(hands tape to\nZander)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "John Coltrane.  \"A Love Supreme.\"\nGive it a listen, let me know what\nyou think, maybe you won't go for it\nnow, but it'll get in your head and\ngrow like a seed into something\nreally beautiful."
  },
  {
   "type": "speech",
   "character": "ZANDER",
   "text": "Let's play it now!"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Later.  Your mom'n I are heading\nright back out."
  },
  {
   "type": "stage direction",
   "text": "Groans of outrage and protestations of unfairness from\nCecile, Vej and Curtis follow this bad news.  Cecile even\nmusters the gumption to speak up."
  },
  {
   "type": "speech",
   "character": "CECILE",
   "text": "Hey, come on, I been baby-sitting a\nfull 24 hours, I have to get ready\nfor the party tonight..."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Cecile."
  },
  {
   "type": "stage direction",
   "text": "Mace frosts her with a look.  You don't mess with Mace."
  },
  {
   "type": "stage direction",
   "text": "(to a disappointed\nZander)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "You're not the only little boy I\nhave to look out for, honey."
  },
  {
   "type": "stage direction",
   "text": "Zander nods: OK.  Lenny gives him the grip.  Zander's hand\noutmaneuvers his, and the boy smiles in triumph.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  UNDERGROUND PARKING GARAGE"
  },
  {
   "type": "stage direction",
   "text": "POV: squid tape of Iris' death.  Quick barrages of the\nsavage imagery interspersed with bursts of static...\n... until Tick slips off the trodes.  He's been totaled by\nwhat he's seen."
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "Whoa.  That is one unbelievable\npiece of eyefuck."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Skip the art criticism, Tick, what\ncan you tell me about the wearer."
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "Well... the guy's fucked up."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "We know that, Tick."
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "No, I mean the killer's got some\nkind of distortion in his visual\ncortex.  The color and gray-scale\nvalues are all messed up, like color\nblindness."
  },
  {
   "type": "stage direction",
   "text": "He gives the tape a fast run through his processing\nequipment."
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "Lookit, you see the peak period\nratios there?  Could be some kind of\ntumor or brain lesion or something.\nSome kind of trauma"
  },
  {
   "type": "stage direction",
   "text": "(shaking his head)"
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "This is not good.  I don't like this\nat all..."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "What?"
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "Well, it's cutting awful close to\nme.  I mean she was just here."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Who was just here?"
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "Iris, man.  Pay attention."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Wait, wait... wait a minute.  Iris\nwas here?!"
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "Yeah, she came by last night.\nShaking like a junkie, wanting me to\nmake a copy of some clip."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "What clip?  What was it?"
  },
  {
   "type": "speech",
   "character": "TICK",
   "text": "I don't know, man, she wouldn't let\nme see it.  Said I wouldn't want to\nsee it.  She said she was going to\ngive it to you to hold for her.\nLike insurance or somethin'"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "She never gave me a tape."
  },
  {
   "type": "stage direction",
   "text": "(to Lenny)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Think back about what she said.\nExactly what she said."
  },
  {
   "type": "stage direction",
   "text": "(revved up)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "She wanted to go out to my car,\nsomething about my car..."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Something in your car..."
  },
  {
   "type": "stage direction",
   "text": "Lenny and Mace swap a look: oh shit.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  SAN PEDRO IMPOUND YARD - DUSK"
  },
  {
   "type": "stage direction",
   "text": "6:05  P.M.\nThe last night of this millennium is falling.  Mace's limo\npulls to the curb.  The yard is located in the vast no-\nman's land of storage lots, cranes and warehouses near\nharbor piers.  The impound office is locked.  Closed for\nNew Years Eve.\nCUT TO Lenny and Mace cutting the chain off the gate with\nthe long-handled bolt-cutters.  They enter the yard.  Mace\nis carrying a blunt object that looks like a ray-gun.  A\nTAZER.\nRight on cue a huge Rottweiller bounds out of the shadows\nat them, growling, its head low on an attack run.  Mace\nfires and the tazer lights up the with 120,000 volts (low\namperage, not lethal).  It whines and flips over twice,\nthen runs off behind some parked cars."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "That's a handy little attitude\nadjuster."
  },
  {
   "type": "stage direction",
   "text": "(sees his car)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Damn.  I'm boxed in."
  },
  {
   "type": "stage direction",
   "text": "Lenny and Mace approach his BMW, blocked in by ten other\ncars, so he's not getting it back this trip.  He unlocks\nthe door and looks inside with a tiny Mag-Lite while Mace\ncovers them with the tazer.  A puppy-like whine comes\noccasionally from behind some cars nearby.  We catch a\nglimpse of the puzzled, snuffling Rottweiller eyeing them\nwarily.\nLenny finds the tape on the floormat, passenger side,\nstill wrapped in the note.  He reads the note: \"HELP ME.\nIRIS.\""
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "What's it say?"
  },
  {
   "type": "stage direction",
   "text": "He crumples the note."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Nothing.  Let's go play this back."
  },
  {
   "type": "stage direction",
   "text": "CUT TO LENNY AND MACE returning to the limo.  As they\nreach the car they are hit by two flashlight beams.  It is\nthe two cops, SPREG AND ENGELMAN, out of uniform, but\nlooking very serious with their pistols aimed at Lenny and\nMace.  They have been following Lenny, knowing sooner or\nlater he would lead them to the tape."
  },
  {
   "type": "speech",
   "character": "SPREG",
   "text": "Give me the tape.  Right now."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "What tape?  I'm just trying to get\nmy car back but the place is\nclosed--"
  },
  {
   "type": "speech",
   "character": "SPREG",
   "text": "Shut the fuck up Nero."
  },
  {
   "type": "stage direction",
   "text": "Engelman grabs a fist-full of hair at the top of Mace's\nhead and jams his 9mm into the back of her skull."
  },
  {
   "type": "stage direction",
   "text": "(cool and even)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Lenny, give them the tape."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "It's in my case.  Okay?  I'm going\nto open my case..."
  },
  {
   "type": "speech",
   "character": "ENGELMAN",
   "text": "Facing us, where we can see it."
  },
  {
   "type": "stage direction",
   "text": "Lenny slowly opens the Haliburton.  He takes out the tape\nand holds it out toward Spreg."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Take it and turn her loose.  Okay?"
  },
  {
   "type": "speech",
   "character": "SPREG",
   "text": "Absolutely."
  },
  {
   "type": "stage direction",
   "text": "And you see in his eyes that it isn't going to go that\nway.  Spreg edges forward and takes the tape.  Then he\npoints his pistol at Lenny's head, about to fire--\nWhich is when the pissed-off Rottweiller shoots through\nthe open gate like a black torpedo and tears into\nEngelman's leg.  Engelman screams in pain.  Mace twists\nout of his grip.  Engelman shoots the dog.\nLenny swings up his Haliburton, using it as a shield, and\ndives for the car.  The case takes three rounds from\nSpreg's 9mm before Lenny gets behind cover.\nMace just seems to vanish.  She reappears over the trunk\nof the limo and puts two rounds squarely into Spreg's\nchest, knocking him down.  Lenny and Mace scramble into\nthe car, starting it up.\nSpreg sits up, pulling up his shirt to make sure his body\narmor stopped the slugs.  No blood.  He comes up firing.\nHe and Engelman empty their magazines at the limo as it\npulls away.  No damage.  They realize the limo is a bullet\nproof security model and run to their pickup truck, parked\nnearby, to give chase.\nSpreg's face is a mask of rage.  He slams the truck in\ngear and accelerates after the limo before Engelman even\nhas the door closed.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT./ EXT.  LIMO AND SAN PEDRO STREET - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Mace has the big car floored.  She looks in the rear-view\nas the truck gains on them.  Mace is doing her thing...\nwhat she's trained for.  Security driving.  She whips some\nmoves in the big car, but the truck is closing on them."
  },
  {
   "type": "stage direction",
   "text": "(holding on)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Oh no, we're not being followed,\nLenny, Don't be so paranoid, Lenny."
  },
  {
   "type": "stage direction",
   "text": "They hear rounds hitting the car, and look back.  The\ntruck is right behind them."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Shit!"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Take it easy.  The glass is bullet\nresistant."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Bullet resistant?  Whatever happened\nto bullet proof?"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Lenny.  Calm down.  This is what I\ndo."
  },
  {
   "type": "stage direction",
   "text": "THE LIMO slides broadly through a turn, side slamming a\nparked van.  Mace accelerates.  The truck stays with them.\nEngelman is leaning out the passenger side window with an\nAK-47 assault rifle.  He rips off several burst which\nriddle the limo, cracking the glass in starburst patterns.\nThe Lexan-laminated windows are cracked to hell, but the\nrounds don't come all the way through.\nSpreg's truck comes alongside, ramming them.  The impact\ndrives them sideways.  Mace swerves to miss a light-\nstandard and finds herself roaring between warehouse\nbuildings which front the harbor.\nThe truck stays right with them.  Engelman fires bursts at\nthe tires, shredding them off the rims.  The limo thunders\nalong on steel rims, throwing rooster-tails of orange\nsparks.\nMace finds herself boxed in by the buildings.  No way to\nturn.  Ahead is a short concrete pier.  She hits the\nbrakes and the limo skids on its rims out onto the pier,\nstopping before it reaches the end.\nThey are trapped.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  SAN PEDRO PIER - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Engelman and Spreg jump out of the truck, taking cover\nbehind it.  They rake the limo with bursts from their AK-\n47s.\nINSIDE THE CAR.  Lenny and Mace keep their heads down\nbelow the door frame.  It sounds like they are inside a\nsteel drum in some psychotic Calypso band.  But the\narmored body panels hold.\nLenny is punching his cellular."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Goddamnit!!  911 is busy!"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "It's okay, Lenny"
  },
  {
   "type": "stage direction",
   "text": "(he looks at her\nhopefully)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "They'd never get here in time\nanyway."
  },
  {
   "type": "stage direction",
   "text": "Mace has reloaded her Sig and is trying to open the door\non her side (away from the bad guys).  It is jammed from\nthe sideswiping.\nSpreg reaches into the bed of the truck and pulls out a\ngallon gas can.  He uncaps it and throws it across the\npavement.  It slides under the limo, glugging its contents\nonto the ground.  Spreg grabs a road-flare from under the\nseat of the truck and strikes the cap, lighting it.\nHe tosses the flare under the limo...\nKA-WHOOMPH!!  The gas can explodes in a fireball.  The\nContinental is engulfed in flames.  From the inside all\nLenny and Mace can see is fire.  All the windows are\ncovered in roaring flames."
  },
  {
   "type": "stage direction",
   "text": "(matter-of-fact)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "This is bad."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "The gas tank's going to go any\nsecond!"
  },
  {
   "type": "stage direction",
   "text": "Mace slams the car into gear and floors it.  The powerful\nLincoln thunders forward.  It crashes through a chain-link\nfence and launches right off the end of the pier.  A\nfireball plunging in a meteoric arc into the oily black\nwater.\nInside, they are slammed forward by the impact.  The car\nsinks.\nUNDERWATER: The car hits bottom, twenty feet down, sitting\nthere amid the junk.  Shafts of light play down from the\nbig streetlights at the end of the pier.\nINSIDE, Lenny and Mace are in a flooding black tomb."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Are you out of your fucking mind?!"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Fire's out, isn't it?"
  },
  {
   "type": "stage direction",
   "text": "She scrambles into the back seat.  She wrenches at the\nrear seatback, pulls it free... and crawls half-into the\nhuge trunk.  Water is up around their legs.  She grabs her\nshotgun: a sawed-off ten-gauge."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Get in here.  Come on Lenny, move\nit.  MOVE!!"
  },
  {
   "type": "stage direction",
   "text": "Mace yanks him toward her and he tumbles in."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Get ready to hold your breath."
  },
  {
   "type": "stage direction",
   "text": "She aims the ten-gauge at the trunk latch mechanism."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Lenny, kick out hard, then just\nfollow me. Okay?"
  },
  {
   "type": "stage direction",
   "text": "He nods.  BLAM!!  She blows the trunk latch into shrapnel.\nThe trunk lid belches open in a whoosh of bubbles.  Lenny\nand Mace kick out, heading toward the lights of the pier.\nON THE SURFACE: Mace breaks the surface slowly alongside\nthe slimy concrete wall.  Lenny comes up beside her,\nspluttering.  Her hand goes over his mouth.  They are in\nthe inky shadows under a massive bumper made of rail-road\nties.\nEngelman and Spreg are standing above them, scanning the\nblack water over the barrels of their AKs."
  },
  {
   "type": "speech",
   "character": "SPREG",
   "text": "Let's get out of here."
  },
  {
   "type": "stage direction",
   "text": "They run back to the truck and high-tail it out of there.\nDown below, Lenny and Mace are clinging to the pier,\nchest-deep in the water.  They hear the truck pulling\naway.  They let out a big exhalations of relief.\nCUT TO LENNY AND MACE walking on the pier, shoes\nsquishing.  They leave a shiny trail behind them."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "I can't believe we had to give them\nthe damn tape."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Yeah, me neither.  It was one of my\nfavorites.  Me and Faith in a hot\ntub on my birthday.  I'm going to\nreally miss it."
  },
  {
   "type": "stage direction",
   "text": "He feels around in his jacket pocket.  He pulls out the\nMYSTERY TAPE... nice and dry in its plastic case.  He\nholds it up to show a grinning Mace."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Are we impressed yet?"
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT./ EXT.  FREEWAY AND CURTIS' CAR - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "7:45  P.M.\nLenny and Mace, still wet, riding in the back seat of\nCurtis' car."
  },
  {
   "type": "stage direction",
   "text": "(pissed)"
  },
  {
   "type": "speech",
   "character": "CURTIS",
   "text": "I got better things to do on New\nYear's Eve than be some kinda damn\nchauffeur..."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Hey Curtis?  Just drive."
  },
  {
   "type": "stage direction",
   "text": "Curtis swears.  But he shuts up and drives."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Those two guys were cops."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "You sure?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "It's the walk.  Something.  Anyway,\nthey'll run your plates and get your\naddress.  We gotta keep moving."
  },
  {
   "type": "stage direction",
   "text": "Mace takes it in.  She nods.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  MACE'S HOUSE"
  },
  {
   "type": "stage direction",
   "text": "Mace comes in the front door and walks straight to the TV,\nswitching it off.  Zander and Cecile are shocked."
  },
  {
   "type": "speech",
   "character": "CECILE",
   "text": "Lornette, girl... what's going on?"
  },
  {
   "type": "stage direction",
   "text": "Lenny goes past them and starts grabbing his stuff...\nwardrobe bag, playback gear."
  },
  {
   "type": "stage direction",
   "text": "(to Zander)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "We're going to aunt Cecile's, honey.\nWe're going to watch fireworks from\nthere.  Let's go.  Chop chop."
  },
  {
   "type": "speech",
   "character": "ZANDER",
   "text": "Aw, Mom!"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Come on Zander.  You can ride on my\nshoulders.  Here you go."
  },
  {
   "type": "stage direction",
   "text": "Lenny hoists him overhead and goes out the door.  Cecile\ncatches up to Mace in the hall, just as she is opening a\nlocked cabinet and pulling out a little .380 auto, holster\nand ammo."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Cecile, get in the car.  Now."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT./ EXT.  STREET AND CIVIC - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Sirens pierce the night.  Two pillars of fire are visible\nblocks away.  There are dark crowds of people everywhere.\nPeople on the sidewalks, lighting fireworks.  There are\nflashes and explosions.  It could be a celebration, or a\nwar zone.  Maybe both.  Or one about to turn into the\nother.\nMace is driving, scanning the streets.  She has her .380\nauto in her hand, resting in her lap.  Lenny is riding\nshotgun, while Curtis, Cecile and Zander are in the back\nseat.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  CECILE'S APARTMENT - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "It is gang territory pure and simple.  Blacks and\nHispanics.  Graffiti everywhere.  Burned-out buildings.\nLenny sees abject poverty, here.  Even so, people are\npartying.\nThey pull up to the front of Cecile's apartment building\nand get out.\nThere are some homeboys chillin' on the front steps who\ngive Mace the local hand-sign.  She returns the sign\nautomatically as she carries Zander past them."
  },
  {
   "type": "speech",
   "character": "ONE OF THE BOYS",
   "text": "Yo, Mace.  Whatup wit you, homegirl?\nYou never come roun' here no more."
  },
  {
   "type": "stage direction",
   "text": "Lenny follows with his wardrobe bag.  The homeboys give\nLenny the eye as he brushes past them.  Mace chills them\nwith a glare."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "He's with me."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  CECILE'S APARTMENT - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "A small and dingy place.  Cecile has done her best to make\nit a home.\nMace and Lenny go into the kitchen and shut the door.\nHe quickly sets up his playback deck on the table.  He\nputs on the trodes and pulls the tape out of his pocket.\nThen he pauses, looking at it apprehensively... knowing\nthat it contains the answer to all this madness.\nHe puts it into the deck.  The deck closes.  He punches\nPLAY.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  APARTMENT/LIVING ROOM - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Mace watches Zander lighting bottle rockets with Curtis on\nthe balcony of the apartment... visible through the\nwindow.  Staccato fireworks nearby sound like automatic\nweapons, making her flinch.  She goes back into the...\nKITCHEN.  Where she sees Lenny sitting at the table,\ntrodes in his hands.  Stunned.  Face the color of old\ncement.  Hands shaking."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Tell me."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I can't tell you.  You've got to\nsee."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Uh unh.  I won't do it."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Mace.  I know what you think about\nthe wire.  But I'm asking you to do\nthis.  It's that important."
  },
  {
   "type": "stage direction",
   "text": "Mace sees how serious he is.  She nods: OK.  He puts the\ntrodes on her."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Sorry this has to be your first\nplayback."
  },
  {
   "type": "stage direction",
   "text": "He hits play and Mace reacts as the sensory input hits\nher.  She opens her eyes..."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Keep your eyes closed, or you'll see\ndouble."
  },
  {
   "type": "stage direction",
   "text": "She bites her lip as the sensation of being another person\nfloods through her.\nPOV SEQUENCE: We are Iris.  Riding in a car.  Fixing our\nmakeup in a mirror on the passenger side sun visor.  Iris\nflips the sun visor back up, revealing the moving street.\nIt is night.\nWe look down, and recognize the dress Iris was wearing\nwhen we first saw her, two nights ago.  She puts her\nlipstick into a purse which is belted to her waist.  Iris\nturns her head and we see the driver.\nIt is JERIKO ONE.  He is laughing, talking to someone in\nthe back seat.  Iris looks and we see REPLAY, Jeriko's\nsideman, and another woman, DIAMANDA.  They are amorously\nentwined.  Then they are all laughing and passing around a\nbottle of Jim Beam.  The car stereo is thumping loudly.\nIris' POV swings around and looks down, seeing Jeriko's\nhand caressing her thigh.  She puts her hand on his chest\nand leans close to him.  Jeriko grins, then looks up and\nswears at a wash of red/blue cop flash."
  },
  {
   "type": "speech",
   "character": "JERIKO",
   "text": "Shit.  Fuckin' Five-O"
  },
  {
   "type": "stage direction",
   "text": "Our POV swings to the rear-view mirror and we see an LAPD\ncar behind us, with the gumball machine on.  A spotlight\nhits us and we hear a single whoop on the siren.  Jeriko\npulls over, but they are on an overpass... no shoulder."
  },
  {
   "type": "stage direction",
   "text": "(on bullhorn)"
  },
  {
   "type": "speech",
   "character": "COP VOICE",
   "text": "Go to the bottom of the ramp."
  },
  {
   "type": "stage direction",
   "text": "Jeriko and Replay are both swearing.  He pulls the car\ndown the ramp, stopping on a deserted street in a\nwarehouse district.  Our POV looks around nervously.\nBlack shadows and concrete pillars.  No-one around.  Cars\nwhoosh by on the bridge above but they might as well be on\nMars.  The car is stopped next to a train yard.  We hear\nthe rumble of diesels nearby, the clank of freightcars.\nWe see the outlines of TWO COPS advancing through the beam\nof the spotlight, their guns drawn."
  },
  {
   "type": "stage direction",
   "text": "(jumping out of the\ncar)"
  },
  {
   "type": "speech",
   "character": "JERIKO",
   "text": "Goddamn, now what you pull me over\nfor?  If I was going any slower I'd\nbe parked--"
  },
  {
   "type": "speech",
   "character": "COP VOICE 1",
   "text": "Get down on your knees and put your\nhands on your head.  Now!"
  },
  {
   "type": "speech",
   "character": "COP VOICE 2",
   "text": "Everyone else, out of the car and\ndown on the ground."
  },
  {
   "type": "stage direction",
   "text": "Our POV comes up and out of the car.  Jeriko is\nrighteously pissed off.  He's not following orders."
  },
  {
   "type": "speech",
   "character": "COP VOICE 1",
   "text": "Put your hands behind your head\nright now!"
  },
  {
   "type": "stage direction",
   "text": "He goes along, madder than ever.  The cops get Replay down\non his knees as well, in the wet gutter next to the curb.\nThe cops are closer now.  We see that they are SPREG and\nENGELMAN."
  },
  {
   "type": "stage direction",
   "text": "(to us)"
  },
  {
   "type": "speech",
   "character": "ENGELMAN",
   "text": "Put your hands on the hood of the\ncar and don't move."
  },
  {
   "type": "stage direction",
   "text": "We exchange a look with Diamanda.  Fucking cops.  But\nJeriko is winding them up.  Not giving them the pleasure\nof the humiliation.  You can see it escalating."
  },
  {
   "type": "speech",
   "character": "JERIKO",
   "text": "I suppose you stopped us cause you\nhad suspects fitting our description\nin the area, what you're gonna tell\nme.  What was the description?  Two\nblack males in a car?  Yeah, right,\nI heard that one before..."
  },
  {
   "type": "stage direction",
   "text": "As Engelman pulls out Jeriko's wallet, looks at his ID,\nJeriko checks name tags."
  },
  {
   "type": "speech",
   "character": "JERIKO",
   "text": "Well you stopped the wrong black\nmale tonight officer... what is it?\nSpreg.  Officer Spreg.  Cause I'm\nthe 800 pound gorilla in your mist,\nfucker.  I make more in a day than\nyou make in a year, and my lawyers\nlove to spend my money dragging\nsorry-ass Aryan robocops like you\ninto court.  Get a man down on the\nground with no probable cause.  Fuck\nyou!"
  },
  {
   "type": "speech",
   "character": "SPREG",
   "text": "Shut the fuck up!"
  },
  {
   "type": "stage direction",
   "text": "He kicks Jeriko down on his face.  Jeriko hits the ground\nhard."
  },
  {
   "type": "stage direction",
   "text": "(yelling)"
  },
  {
   "type": "speech",
   "character": "DIAMANDA",
   "text": "Leave the fuck off of us, we weren't\ndoing anything..."
  },
  {
   "type": "speech",
   "character": "SPREG",
   "text": "Shut up!  Don't make me walk over\nthere."
  },
  {
   "type": "stage direction",
   "text": "Engelman shows the ID to Spreg, saying something we can't\nhear."
  },
  {
   "type": "speech",
   "character": "SPREG",
   "text": "You're that rap puke?  Jeriko One?\nYou're the one getting all the\ngangbangers to form citizens groups\nand go downtown... trying to rake\nthe LAPD over a cheese grater?"
  },
  {
   "type": "speech",
   "character": "JERIKO",
   "text": "That's right.  And you're gonna be\nin my next song, motherfucker, it's\ncalled Robo-Spreg."
  },
  {
   "type": "stage direction",
   "text": "Replay starts laughing.  Diamanda stifles a giggle.  Spreg\nis white-lipped with rage.  Years of frustration coming to\na head.  Too many disciplinary actions, too many\nsuspensions, too little appreciation of the tough job they\ndo."
  },
  {
   "type": "speech",
   "character": "JERIKO",
   "text": "It's a song about a cop who meets\nhis worst nightmare, a nigger with\nenough political juice to crush his\nass like a stink bug.  You're gonna\nbe famous."
  },
  {
   "type": "stage direction",
   "text": "Spreg looks around the empty street.  Looks at Engelman.\nDown at Jeriko, proned out on the pavement.  Replay's\nlaughter in his ears."
  },
  {
   "type": "speech",
   "character": "SPREG",
   "text": "I don't think so."
  },
  {
   "type": "stage direction",
   "text": "And shoots him BLAM!  BLAM!  Twice in the back of the\nhead.  Just like that.\nDiamanda screams.  Replay tries to roll to his feet.\nSpreg shoots him twice in the stomach.  Replay is\nscreaming.  Rolling around, holding his guts."
  },
  {
   "type": "stage direction",
   "text": "(shouting)"
  },
  {
   "type": "speech",
   "character": "SPREG",
   "text": "Hey... I don't hear you laughing!"
  },
  {
   "type": "stage direction",
   "text": "Engelman's yelling something at him we can't hear.  Spreg\nturns, eyes wide with adrenaline."
  },
  {
   "type": "speech",
   "character": "SPREG",
   "text": "Get the bitches."
  },
  {
   "type": "stage direction",
   "text": "Engelman hesitates and then spins toward us.  Diamanda is\nscreaming, backing away from Engelman.  Spreg shoots\nReplay four more times.\nWe spin one-eighty and start to run.  Hear shots... BLAM!\nBLAM!  BLAM!  Spin back... to see Diamanda dropping to her\nknees.  Engelman shoots her again.  Then raises his gun\ntoward us.\nWe spin away.  The world becomes a kinetic blur.  The\nsound of shots.  We see puffs of dust on the ground in\nfront of us.  Missed shots.  We tumble over a guardrail\nand roll down an embankment... get up and keep running.\nTrain tracks ahead.  Looking back... here come Spreg and\nEngelman down the embankment, overtaking us.  We hear the\nthunder of a train... spinning again to look forward.\nFreight-train doing fifty on the nearest track.  Almost to\nus.\nWe leap forward.  Over the track.  The diesel roars past\nbehind us.  Looking back... a black wall of moving steel.\nBacking away from it.\nWe see Engelman and Spreg crouching down... trying to aim\nthrough the wheels.  Hear the impotent pop of their guns\nover the roar of the train.\nTurning to run again.  We see a tiny hole appear in a sign\nright in front of us with a metallic SPANG.  Running and\nrunning.\nLooking back.  No pursuit.  Train still rolling by.  Can't\nsee the cops.  Running, running.  Heart pounding and lungs\nheaving.  Sobbing sounds coming from somewhere, seeming to\nfill the night.\nLooking down... one shoe on, one shoe off.  Iris' hand\ntakes off the remaining shoe, clutches it to her chest.\nWe move forward into the dark train-yard as--\nTHE TAPE ENDS.\nAnd Mace sits stone still.  Shakes.  For a beat.  And\nanother.  Then she tears the trodes off and throws them\nacross the room, near where Lenny is on the cellular."
  },
  {
   "type": "stage direction",
   "text": "(into phone)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Hang on.  Hang on, Max."
  },
  {
   "type": "stage direction",
   "text": "(looks at Mace)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "You see?"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "I see."
  },
  {
   "type": "stage direction",
   "text": "(trembling)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "I see the earth opening up and\nswallowing us all."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Yeah I know."
  },
  {
   "type": "stage direction",
   "text": "(into cellular)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "So what do we do?"
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT./ EXT.  MAX'S CAR - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "As Max drives along a crowded downtown street."
  },
  {
   "type": "stage direction",
   "text": "(into phone)"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Don't talk to anybody.  Anybody.\nYou're invisible.  Okay?  Just meet\nme at Tick's in a half hour.  And\nLenny... don't get pulled over."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  CECILE'S APARTMENT - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Lenny pushes \"End\" on his cellular and looks at Mace.  The\nfirst-time impact of the Squid experience, and the killing\nof Jeriko, still haunts her.  We've never seen Mace\nscared.  But she looks scared now."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "We got to make another copy of this.\nLittle life insurance."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "You know what this tape could do if it\ngets out."
  },
  {
   "type": "stage direction",
   "text": "(tucking Glock in\nhis waistband)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I've got a good idea, yeah."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "People finding out... seeing... that\nthe LAPD just flat out executed\nJeriko One.  Jesus.  Maybe they\nought to see."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Maybe.  But tonight is probably not\nthe best night.  Come on, we're\nrollin'."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  CECILE'S APARTMENT - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Cecile catches them on the steps as they are leaving."
  },
  {
   "type": "speech",
   "character": "CECILE",
   "text": "Lornette, when you gonna stop laying\noff everything on me?  We had plans\ntonight--"
  },
  {
   "type": "stage direction",
   "text": "(steely)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Listen to me, little sister.\nThere's something going on, and it's\nvery big.  Now you've got to take\ncare of Zander.  And stay off the\nstreets tonight... you hear me on\nthis?"
  },
  {
   "type": "stage direction",
   "text": "Cecile gets the message.  She nods."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Curtis.  What about you?  Do we\nunderstand each other?  You stay\nput."
  },
  {
   "type": "speech",
   "character": "CURTIS",
   "text": "Yeah.  I'm wit it."
  },
  {
   "type": "stage direction",
   "text": "Mace and Lenny go on down the steps to the car."
  },
  {
   "type": "stage direction",
   "text": "(to Cecile)"
  },
  {
   "type": "speech",
   "character": "CURTIS",
   "text": "Damn!  She worse than you."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT./ EXT.  CIVIC AND STREET - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Lenny and Mace see helicopters circling as they maneuver\nthe dark streets.  Xenon searchlights crisscross the\nrooftops nearby.  They see patrol cars passing on cross-\nstreets, lights flashing.  It feels like the entire LAPD\nis looking for them.\nEverywhere in the street there are small crowds, street\nparties in progress.  People drinking and firing bottle\nrockets.  The police watch everything."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "So, let's see, I've got Tran's\ngoons, some squidhead psycho and the\nLAPD all trying to kill me.  Happy\nnew year, Lenny."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Well, look at the plus side."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "There's a plus side?"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Yeah.  You gave up your hot tub tape\nto save me.  That's real progress\nfor you."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "It was a tough call."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "I still can't square the psycho\nsmarts of whoever did Iris with\nthose two cops."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I don't think those cops did Iris.\nI think whoever Iris was wearing for\nkilled her."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Why?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "To break the trail.  If those cops\nhad gotten hold of her, they would\nhave beat it out of her who she was\nwearing for, and then gone after\nthem too.  Our killer is running as\nscared as we are.  Which makes him\nreally dangerous.  Judging by how\nscared I am."
  },
  {
   "type": "stage direction",
   "text": "They pull up to the checkpoint; Lenny squirrels into the\nseat, hiding in the shadows, as Mace flashes her security\npass and the cop waves them on.\nLenny lets his breath out slowly.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  UNDERGROUND GARAGE/TICK'S VAN"
  },
  {
   "type": "stage direction",
   "text": "Lenny and Mace pull in with a SQUEAL of brakes and park\nthe car.  Sound of rock music -- some kind of refried\npsychedelia -- coming from Tick's van down the ramp.\nMace and Lenny get out, approaching the van.  Hearing\ntires squeal, they turn to see Max pull up.  He gets out\nwearing an ill-fitting rental tux.  Music louder, echoing\nin the empty garage, even though the van is shut tight."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Sounds like Tick's already\ncelebrating."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "You may be a little overdressed for\nthis party."
  },
  {
   "type": "stage direction",
   "text": "(Lenny pounds on the\nvan door)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Yo, Tick!  It's Lenny.  Open up!"
  },
  {
   "type": "stage direction",
   "text": "Mace slips out her .380, on alert."
  },
  {
   "type": "stage direction",
   "text": "(knocks again, then opens\nrear van door)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Tick, I got to talk to you, man...\noh shit."
  },
  {
   "type": "stage direction",
   "text": "Tick's slumped in the back of the van with playback trodes\non his head.  He's breathing, but otherwise he's still.\nNear lifeless.  A cyborg after a power outage.  All the\nequipment in the van is trashed."
  },
  {
   "type": "stage direction",
   "text": "(as he starts to\nexamine Tick)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "He's been cooked-off"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Is he dead?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "No.  But his frontal lobes are like\ntwo runny eggs.  They put an\namplifier in-line to boost the\nsignal till it french-fried his\nbrain."
  },
  {
   "type": "stage direction",
   "text": "Mace hits \"Off\" on the built-in CD player.  The sudden\nsilence is creepy.  Lenny gets right in front of Tick's\neyes, shouting at him, at the top of his lungs.\nTICK'S POV: We see a roaring blizzard of inchoate static.\nSomewhere in the middle of it is a suggestion of Lenny's\nface, almost invisible.  We hear the tiniest ghost of his\nvoice, like a radio playing two blocks away."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "He's totally cut off from the outer\nworld."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "How long does it last?"
  },
  {
   "type": "stage direction",
   "text": "(off Lenny's look)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Oh."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Those two psycho cops are on a\nslash-and-burn to find the tape and\ncover their tracks."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "This seems a little sophisticated\nfor them.  These are not subtle\nguys."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "There's more to this whole thing\nthan you think."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Whattya mean?"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "All I'm saying... you don't know how\nhigh up the food chain this thing\ngoes.  I've heard stuff."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "What stuff?"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Smoke.  Rumors.  I've heard stuff\nabout a death squad.  A group a guys\nloyal to the hardline school.  Guys\nthat've had too many years of city\nhall and the review boards and the\ngoddamn media pissing down their\nnecks, suspending cops right and\nleft, tying their hands... while\nouta the other side a their mouths\nthese same people're squealing save\nus, save us, do something you\nfucking morons, crime is totally out\nof control."
  },
  {
   "type": "stage direction",
   "text": "Lenny takes this in.  All the fight goes out of him.  This\nis just too overwhelming."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Jesus."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Yeah.  So don't walk near me in\npublic, alright."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Thanks, buddy.  See... things\nweren't bad enough.  They weren't\nfucking bad enough!"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "The only card we have to play is the\ntape.  You know, we get it to the\nmedia somehow..."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Yeah, right, blow it open."
  },
  {
   "type": "stage direction",
   "text": "(interrupting)"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Mace... no disrespect... but you run\nthis on the 11 o'clock news, by\nmidnight you got the biggest riot in\nhistory.  They'll see the fucking\nsmoke from Canada."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Okay... what about Strickland?"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "No.  Bad idea."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Who's Strickland?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Deputy Commissioner Palmer\nStrickland.  The sanctimonious prick\nwho busted me out.  His ass is so\ntight when he farts only dogs can\nhear it.  I know this guy.  If\nthere's one cop who's not dirty\nit's him."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Listen to me, Lenny... stay away\nfrom cops.  All cops.  You have no\nway of knowing who you can trust."
  },
  {
   "type": "stage direction",
   "text": "Mace looks from one to the other with a growing expression\nof outrage."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "So you're saying we just pretend is\ndidn't happen?  It happened!  The\nLAPD executed one of the most\nimportant black men in America!  Who\nthe fuck are you to bury this?!"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Fine.  Do you want blood running\nwaist deep in the storm drains?  The\ngangbangers'll spread like a wave\nthrough this city and burn it to the\nground.  And when the fires start\nthe street cops'll be capping off at\nanything that moves.  It'll be all-\nout war and you know it."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Yeah, well maybe it's time for a\nwar!"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "You really want that on your head?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Hey, Max, Mace... whoa... time out."
  },
  {
   "type": "stage direction",
   "text": "(together/annoyed)"
  },
  {
   "type": "speech",
   "character": "MAX/MACE",
   "text": "What!?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Whoever killed Iris did Tick.  It's\nthe same sick wirehead shit.  Same\nreason... to burn the trail.  If\nFaith knows anything about this, and\nI think she does, then she's on the\nlist.  So... who's driving?"
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  RETINAL FETISH/ALLEY - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Roadies are loading out gear through the back doors of the\nclub into a van in the alley.  Lenny and Mace ENTER FRAME\nand we follow them between the roadies, going through the\ndoors into..."
  },
  {
   "type": "location",
   "text": "INT.  RETINAL FETISH"
  },
  {
   "type": "stage direction",
   "text": "A grungy black corridor.  The thunder of music gets louder\nwith each step as Lenny and Mace walk down the corridor\nwith purposeful strides.\nThrough chainlink partitions and banks of dark equipment,\nLenny catches glimpses of the stage.  He can see Faith in\na blue-white spotlight.  She is a whirling dervish,\nconvulsing with the divine madness of her music.  Beyond\nher, beyond the lights, in the gloom... Lenny can just see\nTran and his entourage.  Dressed in tuxes, they look out\nof place... clearly on their way somewhere else as the\nevening progresses.\nFaith whirls to a stop as the band crashes in a final\ndownbeat.  The spotlight goes out and the set is over.\nON TRAN, clapping.  Watching.\nNEARBY, Max arrives through the crowd, scanning for\nTran... spotting him.\nBACKSTAGE... FAITH, bathed in sweat, walking along a dark\ncorridor backstage.  WE TRACK WITH HER, as she walks\nthrough the shadows, like a fighter returning from the\nring, soaked and breathing hard.\nA HAND shoots from a black doorway and covers her mouth,\npulling her into the shadows.  Terrified for a split\nsecond... before she recognizes that it is Lenny.  He\npulls her into the room and closes the door.  It is Tex\nArcana's VJ control room, full of monitors and constantly\nchanging graphic images.  Tex is not there."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Lenny!  Jesus!  You scared the Hell\nout of me."
  },
  {
   "type": "stage direction",
   "text": "Faith sees that Mace is standing there, in the shadows,\nwaiting.  She turns back to Lenny with a frown."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "What's going on?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Faith, we know about Jeriko.  Iris\nmade me a copy of the tape."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Oh God, Lenny.  I was trying to keep\nyou out of this."
  },
  {
   "type": "stage direction",
   "text": "But she seems relieved now that he knows, now that there\nis someone to talk to."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "How did it happen?  What was Iris\ndoing riding around with Jeriko\nwearing a wire?"
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "We should talk alone."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "No.  Mace is in this."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Tell us."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Tran's gotten obsesses with\nplayback, a total wiretrip junkie.\nAnd he's such a control freak, he's\nbeen having people followed,\nvideotaped... recording his business\npartners' calls.  Wiring up people\nleft and right."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  CLUB/MAIN FLOOR"
  },
  {
   "type": "stage direction",
   "text": "Tran looks at his watch and gets up from the table,\nimpatient."
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "Let's go get her.  We're late."
  },
  {
   "type": "stage direction",
   "text": "Max shows up suddenly, right in front of him.  Stopping\nhim."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Tran, listen.  I was wondering how\nyou want me to work it tonight, down\nat the Bonaventure.  You want me\ndownstairs at the party or upstairs\nat the suite?  Where you going to\nbe, mostly?"
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  TEX'S ROOM"
  },
  {
   "type": "stage direction",
   "text": "While Max stalls, Faith talks."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Tran and Jeriko weren't getting\nalong.  He was afraid Jeriko was\ngetting ready to dump him, but he\nwasn't sure, so he started with the\nsurveillance.  A couple nights ago\nhe wires up Iris and sends her and\nthe other girl, Diamanda, over to\nJeriko's table."
  },
  {
   "type": "stage direction",
   "text": "CUT TO: TWO NIGHTS AGO, Iris, wearing a wig, leaves Tran's\ntable with Diamanda and moves toward... a booth in the\nRetinal Fetish where Jeriko One sits with Replay.  Iris\nstands over Jeriko for just a moment.  Then he nods,\nsmiles a little, and moves over to make room for her in\nthe booth right next to him."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "That night Iris calls up, freaking.\nShe comes over and Tran watches the\ntape.  He just loses it.  He can't\nbelieve the disaster she's gotten\nhim into.  He's terrified the cops\nwill beat it out of her who she was\nworking for, and come looking for\nhim."
  },
  {
   "type": "stage direction",
   "text": "CUT TO: TRAN'S LOFT as a tear-streaked and frantic Iris is\ntelling Tran about how the cops tried to kill her (we\ndon't hear).  Tran backhands her furiously, his face thin-\nlipped with rage.  She crumples to the floor, sobbing.\nTran keeps looking at the squid tape in his hand like it's\npoison."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Kinda guy you can count on in a\npinch."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Why didn't he just go public with\nthe tape?  Save himself that way."
  },
  {
   "type": "stage direction",
   "text": "CUT TO: An image of Tran burning the squid tape.  It\nblazes in his hand and he hurls it into the fireplace like\na venomous snake."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "The scandal would wipe him out.  If\nit got out that he had his own\nartists under surveillance... he'd\nlose all his other acts.  He'd be\nover."
  },
  {
   "type": "stage direction",
   "text": "Now we see Tran, more composed, comforting Iris.  He wipes\nat her tear-streaked face.  Hands her a wad of bills."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "So finally he gives Iris some cash\nand tells her to check into the\nhotel under a wrong name till he\nfigures out what to do."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Yeah... he figured out what to do\nall right."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "You think Tran killed her?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "The killer knew right where she was.\nBecause he put her there."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "What a nightmare."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  MAIN FLOOR"
  },
  {
   "type": "stage direction",
   "text": "Tran impatiently gestures to Corto."
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "Go get her, Joey.  Stupid bitch."
  },
  {
   "type": "stage direction",
   "text": "(to Max)"
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "We'll talk about this later."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  TEX'S ROOM"
  },
  {
   "type": "stage direction",
   "text": "Mace is getting the sixth sense feeling that seconds\ncount."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Come on.  We're out of here."
  },
  {
   "type": "stage direction",
   "text": "Lenny gets close to Faith, taking her face in his hands."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Leave here with me, right now."
  },
  {
   "type": "stage direction",
   "text": "Mace sighs heavily, rolls her eyes toward the ceiling.\nFaith considers her options.  Then she smiles at him."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Okay, Lenny.  My guardian angel."
  },
  {
   "type": "stage direction",
   "text": "Faith hugs him, and he clutches her.  Mace locks her jaw\nand looks away.  This is hard for her.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  CORRIDOR"
  },
  {
   "type": "stage direction",
   "text": "Mace leads the way, with Lenny following, gripping Faith's\nhand like Orpheus leading Eurydice out of Hell.  They push\nthrough shapes of people in the thundering dark corridor.\nHalf-lit, in alcoves, far-gone wireheads loll in semi-\nconsciousness.  Faith looks back and sees:\nTRAN'S POSSE rounding a corner... spotting them.  They\nstart shoving through the crowd like juggernauts, knocking\nprotesting people out of the way.\nMace, Lenny and Faith break into a run, pounding down the\ncorridor.\nBehind them, Duncan leads the charge.  Suddenly TEX ARCANA\nshoots into the hallway, intentionally blocking their path\nwith his wheelchair.  Duncan crashes over him, toppling\nthe chair, and they both sprawl to the floor.  Vita,\nBeemer and Corto go around the sprawl.\nTex, like many legless men, has incredibly strong arms.\nLenny looks back to see him pounding Duncan's head against\nthe floor..."
  },
  {
   "type": "speech",
   "character": "TEX",
   "text": "Teach you..."
  },
  {
   "type": "stage direction",
   "text": "(pound)"
  },
  {
   "type": "speech",
   "character": "TEX",
   "text": "to mess with..."
  },
  {
   "type": "stage direction",
   "text": "(pound)"
  },
  {
   "type": "speech",
   "character": "TEX",
   "text": "a helpless cripple!"
  },
  {
   "type": "stage direction",
   "text": "Lenny et al reach the main floor of the club where they\nshove through the buffeting crowd amid strobe-flashes and\na wall of sound.\nBehind them we see Corto and Beemer hurling partiers\naside, cutting a swath, while Vita moves like a mongoose\nthrough tall grass.  Mace drops back, going tail-end-\nCharlie... her bodyguard mode kicking in.\nON LENNY AND FAITH, charging through the jostling crowd,\nLenny is looking back, then he looks ahead and...\nTRAN is right in front of him.  In the whirling shapes and\ncolors of the crowd, he is an island of composure in a\nwhite tux.  He holds a glass of champagne in one hand, the\nbottle in the other.  In one lightning-fast move he\nuppercuts with the bottle, clipping Lenny under the jaw.\nFaith screams as Lenny staggers.  Tran swings again,\nsmashing the bottle over the back of Lenny's head.  Lenny\nsprawls on the floor amid champagne foam and glass.\nLenny, blood flowing in his eyes, rises blearily to see\nFaith being pulled away by Tran, who has her arm twisted\nviciously behind her back.  They go around a chain-link\ndivider and double back, heading for the exit.  Lenny\nstaggers to the chainlink, sagging to his knees again as\nFaith passes within a few inches of him.  He slips down\nthe chainlink, into unconsciousness, as her image is lost\nin the pounding darkness.\nMace gets to him through the crowd, and then whirls like a\ncat as the Posse arrives.  She stands guard over him like\na rabid dog, her .380 auto straightarmed and covering them\nexpertly.  Corto eyes her with hatred.  The stitches on\nhis nose and the bruised swelling are a reminder of his\nlast run-in with her.  He backs off."
  },
  {
   "type": "stage direction",
   "text": "(to the others)"
  },
  {
   "type": "speech",
   "character": "CORTO",
   "text": "Not here.  Lets go."
  },
  {
   "type": "stage direction",
   "text": "They back off, fading into the crowd... catching up with\nTran at the exit.\nMace watches them recede.  Then she bends to Lenny.  Max\narrives a moment later and they lift him to his feet.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  RETINAL FETISH/ALLEY - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Max and Mace support a semi-conscious Lenny, hustling him\nto the car.  As they are putting him in the car, TWO LAPD\nOFFICERS come through the crowd, eyeing the bleeding\nLenny."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Everything's cool.  Too much to\ndrink."
  },
  {
   "type": "stage direction",
   "text": "Lenny picks this moment to slump sideways, falling half\nout of the car.  The squid tape of the Jeriko kill falls\nout of his jacket pocket and clatters to the pavement.\nMace's eyes go wide.  The boot of one of the cops is\ninches from it."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Yeah, uh... he slipped on the\nstairs.  We're taking him to\nemergency."
  },
  {
   "type": "stage direction",
   "text": "(to the nearest cop)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Excuse me."
  },
  {
   "type": "stage direction",
   "text": "The cop steps back, giving Mace room to push Lenny back up\nin the seat.  She surreptitiously kicks the tape under the\ncar, over to the driver's side."
  },
  {
   "type": "speech",
   "character": "COP",
   "text": "Go to Cedars.  It's closest."
  },
  {
   "type": "stage direction",
   "text": "Mace nods and goes around the car.  Max starts asking them\nquestions and the cops turn away, distracted.  She picks\nup the tape and gets in.  Closes the door.  Let's out a\nbig breath.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  PARKING GARAGE/BONAVENTURE HOTEL - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "A line of expensive cars waiting to valet park.  Tran's\nlimo jumps the line and swoops up parallel to the elevator\ndoors.  The posse get out, scowling at the valet who\nswallows his protest.  Tran emerges, helping Faith out\nwith a firm grip on her arm which he does not release as\nthey head for the elevators.\nThey push through a group waiting for an elevator... men\nin tuxes, women in gowns and diamonds.  The elevator opens\nand Tran's entourage sweeps inside.  Beemer and Duncan\nblock any civilians from entering."
  },
  {
   "type": "location",
   "text": "INT.  ELEVATOR"
  },
  {
   "type": "stage direction",
   "text": "They ride in silence a moment.  Faith is pale, her jaw\nclenching.  Tran has her arm in a tight grip.  There is a\nmarch-to-the-gallows feel about the moment."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Well, I'm certainly in the mood for\na party."
  },
  {
   "type": "stage direction",
   "text": "(to Wade)"
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "Take her up to the suite."
  },
  {
   "type": "stage direction",
   "text": "(to Faith)"
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "Have a glass of champagne... or\nsix... I'll be up in a while to help\nyou ring in the New Year."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "I live for the moment."
  },
  {
   "type": "stage direction",
   "text": "The elevator doors open, revealing..."
  },
  {
   "type": "location",
   "text": "INT.  FOYER AND BALLROOM"
  },
  {
   "type": "stage direction",
   "text": "The heart of the MILLENNIUM L.A. New Year's ball.  A\nglitterati event in full swing.  Red carpet, minicam\nlights and paparazzi.  Limos pulling up outside four deep.\nMovie stars rubbing elbows with politicos, music movers\nand shakers chatting with city hall types.  This is a\nparty to celebrate the millennium, sure, but its main\nfunction is to celebrate the celebrants: if you're here,\nthere's no need to be anywhere else.  There is a heavy\npolice presence, as well as lots of private security.\nTran exits the elevator with Vita Minh, Joey Corto and\nDuncan.  They wedge through the crowd, Tran smiling.\nNodding to people he knows.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  CECILE'S APARTMENT - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Lenny is in a chair in the kitchen, listening to Max on\nthe cellular.  He is holding a dish-towel full of ice\ncubes on his scalp.  It is soaked with blood and his\nArmani jacket and silk shirt are spattered.  Mace lifts\nthe ice pack to check that the bleeding has stopped."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "You are a pussy-whipped sorry-ass\nmotherfucker, you know that?"
  },
  {
   "type": "stage direction",
   "text": "She slaps the ice pack back down."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Owww!!  Take it easy."
  },
  {
   "type": "stage direction",
   "text": "(to phone)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Uh huh.  So where are they now?"
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  BALLROOM/BONAVENTURE HOTEL"
  },
  {
   "type": "stage direction",
   "text": "TIGHT ON MAX, leaning against a pillar.  He looks over his\nshoulder, around the column.\nMAX'S POV: through a dense throng of glitterati we see\nTran and his entourage seated at a table, holding court\nwith music types and politicos."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "He's got her up in the room, under\nguard.  And he's still working the\nparty... acting smooth like nothin's\nnothin'.  So buddy... I say we work\na trade."
  },
  {
   "type": "speech",
   "character": "LENNY (V.O.)",
   "text": "What do you mean?"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Give him the tape.  See?  It's\nfucking brilliant!  The tape for\nFaith.  I know he'll go for it.  I\ncan set it up."
  },
  {
   "type": "speech",
   "character": "LENNY (V.O.)",
   "text": "This is what we laughingly refer to\nas a plan, right?"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Come on!  If he gives us any shit,\nwe kill 'em all.  Whattya say?"
  },
  {
   "type": "stage direction",
   "text": "(same old Max)"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Just get your butt down here.  If\nI'm not at the shindig downstairs\ngo to the room.  It's 2203.  You\nwritin'?"
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  APARTMENT"
  },
  {
   "type": "stage direction",
   "text": "On Lenny, at the table.  He dabs his finger in the blood\non the ice pack and writes the number on the table top."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "2-2-0-3.  Got it.  Stay on her."
  },
  {
   "type": "speech",
   "character": "MAX (V.O.)",
   "text": "I intend to."
  },
  {
   "type": "stage direction",
   "text": "Lenny punches END.  Mace looks at the number written in\nblood on the white formica.  Her eyes ratchet up, boring\ninto Lenny.  Not noticing, he gets up, still woozy, and\nstaggers to his wardrobe bag across the room."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Okay, we gotta get over there."
  },
  {
   "type": "stage direction",
   "text": "(opens the bag)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Can you borrow a dress from Cecile\nor something--"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "I'm not going."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Whatya mean?  We're going!  Tran's\ngonna do her right there unless--"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Lenny... shutup.  Just park your\nmouth and listen.  It's a set-up.\nThink about it!  Why's he been\nsending you tapes?  To freak you,\nget you to rush in without thinking.\nThen they put one in you, put one in\nher, put the gun in your hand...\ncrime of passion.  This guy's bent\nenough to think of that."
  },
  {
   "type": "stage direction",
   "text": "Lenny nods, hearing what she is saying."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "That sounds right."
  },
  {
   "type": "stage direction",
   "text": "(but it changes\nnothing)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I'm going."
  },
  {
   "type": "stage direction",
   "text": "He reaches into his wardrobe bag... pulling out the box of\n\"Faith\" tapes and setting it aside, then pulling out the\nsuit.  Mace's frustration explodes as anger.\nShe grabs his shoebox full of tapes.  Holds them up to\nhim."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "You gonna get yourself killed for\nthis?  This toxic-waste bitch!"
  },
  {
   "type": "stage direction",
   "text": "She dumps the box of tapes on the floor.  She starts\nstomping on them with one heel, crunching several into\njunk."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "What the fuck are you doing?!"
  },
  {
   "type": "stage direction",
   "text": "Lenny freaks out and scrambles to pick them up, trying to\nstop her, push her away.  They struggle for a pathetic,\ntragic moment.\nMace snaps.  She grabs him by the lapels and swings him\naround, slamming him back against a wall."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Lenny!  This is your life, Lenny!\nRight here.  Right now.  This is\nrealtime... not playback.  Real...\ntime.  Time to get real.  Understand\nwhat I'm saying... she doesn't love\nyou.  Maybe she did once, I don't\nknow, but she doesn't now.  These\nare used emotions.  It's time to\ntrade them in."
  },
  {
   "type": "stage direction",
   "text": "Mace's tone becomes more gentle.  We see that her outburst\nis, beneath it all, coming from a place of compassion."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Lenny, memories were meant to fade.\nThey're designed that way for a\nreason."
  },
  {
   "type": "stage direction",
   "text": "Lenny seems to crumple.  He knows he has to let go.  But\nit is so painful."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Have you ever been in love with\nsomebody who didn't return that\nlove?"
  },
  {
   "type": "stage direction",
   "text": "Mace gives him a look like, jeez Lenny, are you dumb\nsometimes."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Yeah.  Lenny.  I have."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "It didn't stop you from loving them.\nRight?  Or understanding them, or\nbeing able to forgive them..."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "I guess."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "And it didn't stop you from wanting\nto protect them.  Did it?"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "No.  It didn't."
  },
  {
   "type": "stage direction",
   "text": "Lenny's eyes are brimming with tears.  He makes no attempt\nto hide it... doesn't brush them away."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I worked Vice, Narcotics... Violent\nCrimes... and I saw every known\ndepravity.  I was lost, Mace.  In\nouter darkness.  Then I busted this\nstrung-out little teeny-hooker.\nWhen I met Faith she was just\nanother runaway giving twenty dollar\nblowjobs to buy crank.  Another lost\nsoul."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "You never told me."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "But she was different.  There was a\nlight in her eyes... and she had\nthis voice.  It was scary, all that\npain coming out of that little body.\nLike she could take all the hurt and\nrage of the entire world and lift it\nup to heaven in one voice.  I helped\nher.  And I promised her that I'd\nalways be there... to protect her."
  },
  {
   "type": "stage direction",
   "text": "(long pause)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "See?  It's not about what's in her\nhead.  It's what's in mine.  I can't\nlet go of the promise.  It's...\nlike... it's all I have left."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "No, it's not."
  },
  {
   "type": "stage direction",
   "text": "Mace takes his face in her hands.  She kisses him lightly\non the cheek, where the tear-track is."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Come on, Lenny.  Let's go to a\nparty."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  STREET AND BONAVENTURE HOTEL - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "11:07  P.M.\nIT IS THE MOTHER OF ALL PARTIES.  IN AN AERIAL SHOT we see\nthere must be 100,000 people jamming the closed streets of\ndowntown L.A.  Arc lights sweep the sky.  There are two\noutdoor bandstands, with live music pounding.  There are\nlasers, strobe-lights.  People are literally dancing in\nthe streets... if they can move at all.  Huge projection\nvideo screens are set up all over the place.\nLA is connected to other cities all over the world by\nsatellite, sharing in the celebration in different time\nzones.  The excitement has been building all evening as\nmidnight sweeps across the country toward the West Coast.\nIt looks like a U2 concert 10 blocks long: a multimedia\nblow-out.\nMadness in the streets.  And Lenny and Mace are stuck in\nit.  The Civic can't move in the middle of this millennial\nMardi Gras.  People swarm around, pounding on the Civic as\nthey go by, or press their faces against the glass.  It\nmay be the party of the century, but it looks like the\nmiddle of a third world revolution."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "That's it.  Let's bail."
  },
  {
   "type": "stage direction",
   "text": "And she's out of the car, leaving the keys, ignoring the\nprotesting horns behind her.  And we see that she's\nwearing a short black cocktail dress.  Lenny comes around\nthe car, through the wild crowd.  He's in his other suit.\nSnappy.\nMace unselfconsciously hikes up her dress and slips her\n.380 auto into a holster velcroed to her leg.  She pulls\nthe dress down and you can't see the gun, hidden between\nher upper thighs.\nIn fact, it looks like she couldn't be concealing a\nquarter anywhere on her body.  The dress is cut low at the\ntop and high at the bottom, showing plenty of muscular\nlegs.  High heels doing great things for her calves.  Her\nbraids now loose and full, like a mane.\nLenny glances at Mace and does a double take.  He is\ncaught by a sudden realization:"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Mace... you're a girl."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Good, Lenny.  I can see why the\ndetective gig didn't work out.  Come\non."
  },
  {
   "type": "stage direction",
   "text": "They push their way through the swirling mass of humanity.\nMace moving like a wedge, security training coming to the\nfore.  The whole street is vacuum-packed with people.\nFilled with cars deserted in the general euphoria, an\nunparted Red Sea of man and machine.\nThey will move through the various strata of society as\nthey work their way in to the party's inner sanctum.  It\nis like all of LA, from poorest to richest, compressed\ninto a few square blocks.  There are cops everywhere.\nCops on motorcycles, cops in cars, cops in riot gear.\nLenny scopes out the security at the front entrance...\nmetal detectors, cops... plus you have to have a 500\ndollar-a-plate ticket."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Got your ticket?"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "No.  They must have sent it to my\nbeach house by mistake."
  },
  {
   "type": "stage direction",
   "text": "Lenny motions toward the back of the hotel and Mace\nfollows.  They pass a uniformed cop who is standing thirty\nfeet away, his back to them.\nREVERSE ANGLE: It is SPREG.  His black eyes scan the\ncrowd.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  HOTEL KITCHEN"
  },
  {
   "type": "stage direction",
   "text": "ON LENNY AND MACE moving with purpose through the vast\nsteaming factory of the kitchen where a thousand dinners\nare being prepared.  They are ignored by the bustling\nstaff.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  HOTEL BALLROOM"
  },
  {
   "type": "stage direction",
   "text": "Lenny and Mace emerge from a service door into the\nglitterati crowd, heading into the ballroom.\nThey scan the room."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "You see Tran?"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Uh unh."
  },
  {
   "type": "stage direction",
   "text": "Lenny whips out his cellular and recalls Max's number.  He\nhears the phone connect.  It starts to ring.\nLENNY'S POV... as the crowd parts for a moment.  He sees\nPALMER STRICKLAND talking to a city-hall type.  Lenny\nturns away before Strickland sees him."
  },
  {
   "type": "stage direction",
   "text": "(to the ringing\nphone)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Come on, Max.  Come on, buddy..."
  },
  {
   "type": "stage direction",
   "text": "(two more rings)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Damnit."
  },
  {
   "type": "stage direction",
   "text": "He looks around now.  Starting to feel the creeping edge\nof panic.  No Tran.  No Max."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Alright.  We're going up."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "And do what?  Take on his whole\nposse?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I still got one ace to play.  Tran's\ngot what I want... and I've got what\nhe wants..."
  },
  {
   "type": "stage direction",
   "text": "Lenny pulls the Jeriko tape out of his breast-pocket and\nholds it up.  Mace just stares at him completely outraged."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "That's the original.  There are no\ncopies."
  },
  {
   "type": "stage direction",
   "text": "(not getting it)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Exactly.  That's why it's a make-\nable deal."
  },
  {
   "type": "stage direction",
   "text": "Mace gets very, very close to Lenny, and her voice drops\nto an odd, cold... lethal-sounding... growl."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Look.  That tape is a lightning bolt\nfrom God.  It's worth more than you,\nmore than me, more than Faith.  You\nunderstand?  It can change things.\nThings that need changing before we\nall go off the end of the road.  And\nyou do not have the right to use it\nfor currency."
  },
  {
   "type": "stage direction",
   "text": "(Lenny's eyes are\nwide)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "You go... you go alone.  This is\nwhere I draw the line.  I care about\nyou Lenny... a lot more than you\nknow... which makes us both pretty\nstupid.  But you pawn that tape, you\nmean nothing to me."
  },
  {
   "type": "stage direction",
   "text": "Lenny doesn't know what to say.  Tough choice.  He\nclenches his jaw...\nAnd turns away.  He strides into the crowd, heading for\nthe lobby and the elevators.\nON MACE, watching him go.  Wanting to run and stop him.\nBut she's said what there is to say.  She turns away,\ndesolate and churning with emotion.  The moment lengthens\nas she wrestles with it.  You see her fury, her sadness...\nand her protective instincts.  Her resolve fails her.\nUltimately, she must protect him if she can."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Ah, hell.  Lenny--"
  },
  {
   "type": "stage direction",
   "text": "She turns, running toward the lobby.  And...\nBOOM.  Slams into him.  He came back.\nLenny takes her hand and puts the tape in her palm.\nCloses her fingers on it."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "See that guy?"
  },
  {
   "type": "stage direction",
   "text": "(pointing)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "The one with the ramrod up his ass.\nThat's Strickland."
  },
  {
   "type": "stage direction",
   "text": "Mace follows his look to Strickland, across the room."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Take it to him."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "A cop?  You want me to trust a cop?!"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "No.  Trust me."
  },
  {
   "type": "stage direction",
   "text": "He unclips his playback deck from his belt and hands it to\nher."
  },
  {
   "type": "stage direction",
   "text": "(nodding slowly)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Oh boy."
  },
  {
   "type": "stage direction",
   "text": "(she takes a deep\nbreath)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "What if you're wrong?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Then we'll be right where we are\nnow."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Yeah, right.  Fucked."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  BONAVENTURE ELEVATOR"
  },
  {
   "type": "stage direction",
   "text": "It is a glass-cage scenic elevator, running up the outside\nof the building.  10th floor.  The last passengers step\nout.  When the doors whoosh closed and Lenny's left alone\nthere's only the sound of Muzak Christmas carols.  The\nelevator rises, the lights of LA spread out below.  He is\nhyperventilating.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  HOTEL BALLROOM"
  },
  {
   "type": "stage direction",
   "text": "Mace threads her way past tables circling a dance floor\nfull of dancers and makes her way through celebs air-\nkissing each other.\nBut as she gets near Strickland's table, he stands up and\nexcuses himself.  He starts toward the men's room.  And\nMace follows him.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  MEN'S ROOM/HOTEL"
  },
  {
   "type": "stage direction",
   "text": "A few guys in tuxes tending to themselves.  Strickland\nenters, crossing to a urinal.  He unzips.\nMace steps up beside him.  Guys behind her looking on,\nslack-jawed.  Mace pays no attention to them.  Strickland,\nstern and flinty-eyed, raises one eyebrow."
  },
  {
   "type": "speech",
   "character": "STRICKLAND",
   "text": "Yes?"
  },
  {
   "type": "stage direction",
   "text": "She puts the playback deck on top of Strickland's urinal.\nHe scowls."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "There's a tape in there you need to\nsee.  I mean right now."
  },
  {
   "type": "stage direction",
   "text": "While see is looking at Strickland, a young LAPD OFFICER\ncomes out of a stall, and goes to the sink.  He glances in\nthe mirror at Mace."
  },
  {
   "type": "speech",
   "character": "STRICKLAND",
   "text": "If it wasn't New Year's Eve, I'd\narrest you for possession of illegal\nequipment--"
  },
  {
   "type": "stage direction",
   "text": "(interrupting)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Just look at the tape!  You want to\nknow who killed Jeriko One?  Go in\nthe stall right now and hit Play."
  },
  {
   "type": "stage direction",
   "text": "The young cop steps up behind her."
  },
  {
   "type": "speech",
   "character": "YOUNG COP",
   "text": "Sir, is there a problem here?"
  },
  {
   "type": "stage direction",
   "text": "Mace turns.  Oh shit.  She backs away from them."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Damn!  I knew it--"
  },
  {
   "type": "stage direction",
   "text": "Strickland motions with his eyes and the cop grabs for\nher.  Mace twists viciously out of his grip, knocks him\ndown and vanishes out the door.\nSTRICKLAND hefts the recorder, pondering it.  His\nexpression is opaque.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  HALLWAY/BONAVENTURE HOTEL"
  },
  {
   "type": "stage direction",
   "text": "Lenny comes out of the elevator.  Standing at the corner,\nwhere he can watch the elevators and the corridor, is Wade\nBeemer.  Lenny doesn't break stride.  Just walks toward\nBeemer.  He's not afraid anymore.  He's pissed off.\nBeemer moves toward him."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Now, Wade, can we talk here, like\ntwo human beings--"
  },
  {
   "type": "stage direction",
   "text": "We think he's starting the usual negotiation.  But when he\ngets in range he lets fly with a line-drive right,\nstraight into Beemer's face.  We're talking a John Wayne\nhaymaker punch.  He staggers back, surprised and dazed,\nand Lenny knees him right in the gut as hard as he can.\nHe drops to his knees, sucking wind.  Lenny draws his\nGlock and puts it behind Beemer's ear, pulling a pair of\nhandcuffs off his belt.  Okay, we're starting to believe\nhe might have been a cop once."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "It's not personal."
  },
  {
   "type": "stage direction",
   "text": "CUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  BALLROOM"
  },
  {
   "type": "stage direction",
   "text": "Mace, moving fast as she can through the crowd and past\nthe tables when...\n... she's grabbed by DUNCAN.  He gets her in a good tight\ncome-along.  Like any good security person, the hold is\nnot so obvious that the party around them is disrupted.\nVITA MINH steps up next to her, closing ranks.\nMACE IS WALKED around behind the bandstand.  Joey Corto\nwalks up to her, looking mean and smug.\nMace twists one hand free and snaps it out in a blur.  Her\nopen palm breaks Corto's nose with an audible crunch.\nCorto screams and grabs his face."
  },
  {
   "type": "speech",
   "character": "CORTO",
   "text": "Aw, not the fucking nose!!"
  },
  {
   "type": "stage direction",
   "text": "She slams her foot down on Duncan's instep and snaps her\nhead back simultaneously in a reverse head-butt.  He keeps\nthe hold.  Mace drives her free hand back into the\napproximate position of his nuts.  Even though Duncan\nlooks like he bench-presses Buicks, this has the desired\neffect.\nMace jerks away from him, shoving him back through a\nbuffet table.  Vita draws a knife in a lightning move\nbut...\nSuddenly Mace is standing there with her dress hiked up\nand her pistol straight-armed, with the muzzle right in\nher face.  Vita says the smartest line of the night."
  },
  {
   "type": "speech",
   "character": "VITA",
   "text": "Hey, enjoy the party."
  },
  {
   "type": "stage direction",
   "text": "Mace spins and sprints through dumbfounded glitterati, her\ngun innocuously tight to her side.  She spots a red \"Exit\"\nsign above a fire door and goes through.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  STAIRWELL AND PENTHOUSE/BONAVENTURE"
  },
  {
   "type": "stage direction",
   "text": "Lenny closes the stairwell door, giving us a quick glimpse\nof Beemer handcuffed to the steel railing.  Lenny moves\ndown the empty corridor.\nHe approaches suite 2203.  The door is ajar.  Always a bad\nsign.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  STREET - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Mace finds herself back in the millennium madness, among\nthe street crowd who don't even notice her.  She holsters\nthe gun and moves away from possible pursuit.  The sky\nexplodes with purple light as huge fireworks go off\noverhead.  A crack like thunder follows.  Then more\nflashes.\nThe countdown to midnight has begun.  The party is\nbuilding to a crescendo.  It seems to have a surreal,\nnightmarish quality.  She passes a MIME in a clock suit,\nwho keeps adjusting the hands closer to midnight.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  SUITE 2203"
  },
  {
   "type": "stage direction",
   "text": "As Lenny enters the suite.  It is very quiet.  Dark.\nLenny's heart is pounding.  He moves through the luxurious\nsuite, gun in the low-ready position.\nLenny can barely breathe from the tension.  He notices\nthat one balcony door is open.  The roar of the crowd\ncomes in like the sound of surf from far below.  Fireworks\nexplode across the sky, and the cheers sound like distant\nscreams of slaughter.\nHis feet crunch on broken glass... a shattered champagne\nbottle.  A lamp is knocked over.  He reaches the door to\nthe bedroom and looks in.  The room is empty.  The bed is\nunmade, the bedspread and sheet pulled off.  This isn't\nright.  None of this is right.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  STREET PARTY/HOTEL"
  },
  {
   "type": "stage direction",
   "text": "Mace is scanning warily as she circles the hotel, looking\nfor a way back in.  She turns and sees ENGELMAN in the\ncrowd, not twenty feet from her.  He is looking right at\nher.  Not recognizing her for a moment.  Then... he\nrealizes who she is.\nHe starts toward her and Mace pushes people out of the\nway, breaking into a run.  Engelman charges after her,\npulling out his rover to call Spreg.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  PENTHOUSE/BONAVENTURE"
  },
  {
   "type": "stage direction",
   "text": "Lenny looks back at the living room.  Suddenly he notices\nsomething on the coffee table.  It is an envelope, with\nNERO hand-printed on it.  He is drawn to it, hypnotically.\nHe opens it...\n... and with a nightmarish sense of destiny a SQUID TAPE\nfalls out into his hand.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  STREET - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "Now both Spreg and Engelman are stalking Mace through the\ncrowd.  Spreg catches a glimpse of her running and he\ncharges after her, like a bull, with his gun drawn.  He\nhammers through anybody that gets in his way.\nMace kicks off her high heels and goes flat out, an Indian\nrunner.\nSprinting through the crowd, she sees an apparition ahead\nof her... a guy wearing Death's Head make-up and a black\nshroud, carrying a huge cardboard scythe in one hand and a\ndoll (New Year's Baby) in the other.  Death watches her\npass.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "INT.  PENTHOUSE/BONAVENTURE"
  },
  {
   "type": "stage direction",
   "text": "LENNY, moving as if he's in a trance, puts the trodes on\nhis head.  TIGHT ON THE PLAY BUTTON as his finger punches\ndown.\nIN POV we approach room 2203.  It is the familiar\nmonochromatic vision of the killer.  Our hands open the\ndoor quietly with a keycard.  We enter the suite.\nSome of the lights are on.  We see Faith out on the\nbalcony.  Watching the sea of madness below.  She comes\nback in, carrying an empty champagne glass.  She grabs a\nbottle off an end-table and up-ends it.  Empty.  She hurls\nit across the room, and it shatters against the wall.\nWe approach her, standing with her back to us.  Closer.\nOnly a few feet now.  She whips around, startled.  Gasping\nloudly.  But then... she recognizes the wearer."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Oh.  I didn't hear you come in."
  },
  {
   "type": "stage direction",
   "text": "THE RECORDING STOPS, in a blast of static.  Lenny jerks at\nthe discontinuity in the input, he is so keyed up.\nTHE RECORDING RESTARTS: A new image resolves out of\nstatic.  Faith is pushed roughly down on the bed.  We\nclimb onto the bed, straddling her, and she gasps.  We\nturn her onto her back.\nShe has been blindfolded.  The Wearer goes SSSHHH.  A\nwarning.  Like the hiss of a snake.  Our hands seize her\nwrists and handcuff them one by one to the iron frame at\nthe head of the bed.\nThe hands go out of sight and then reappear holding a set\nof trodes.  They are placed on her head... the spidery\ngecko-hand device almost disappearing in her black hair.\nLENNY'S guts have turned to water.  He is shaking his head\nin horror..."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "No, no, no..."
  },
  {
   "type": "stage direction",
   "text": "IN POV we see one of our hands come up holding the yellow\nplastic razor knife.  The blade clicks out to its full\nlength.\nOur hands reach down and slowly slit her dress open,\nstarting between her breasts and going down out of sight.\nShe groans, squirming away from the cold knife.  The\nkiller's hands open the material, exposing her white body,\nwhich in his peculiar vision is pure ivory.  The knife\ndeftly cuts off her panties.\nWe unbuckle our pants and reach for her, grasping her\nhips, pulling her to us.\nON LENNY, gagging.  Overcome by revulsion and horror,\nmixing obscenely with the pleasure flooding into him from\nthe tape.\nBACK TO POV as we pull our belt out of the belt loops of\nour pants and wrap it around Faith's neck.  Faith begins\nto pant in tiny rapid breaths.  We tighten the belt\nslowly.\nLENNY tears the trodes from his head.  He clutches his\nstomach, gasping for breath.  Carrying the playback deck,\nhe staggers into the bedroom... to the bed.  He stares\nwildly around the room.\nOne whole wall of the bedroom is mirrored.  In the mirror\nhe spots a shape, on the floor beyond the bed.  It is\ncovered in the bed sheet, but it is clearly a human form,\npropped up against the wall on the far side of the night\nstand.  He missed it in his earlier look from the bedroom\ndoor.\nLenny moves around the bed and reaches down to the foot of\nthe figure, grasping the edge of the sheet with a\ntrembling hand.  With horrified apprehension he pulls on\nthe sheet.\nIt reveals the head and upper body of... Tran Vo.\nThe last thing he expected.  Lenny leans close and sees\nthat Tran is breathing shallowly, but his eyes are vacant.\nHe looks like Tick did.\nLenny sits on the bed and puts the trodes back on.  The\nfireworks and screaming outside sound like some\nnightmarish war, like the sound of the world coming to an\nend.  But all Lenny cares about is what's on the tape.  He\nhits PLAY.\nTHE POV CONTINUES where it left off.  Faith's body lurches\nwith the Wearer's thrusts.  His hand tightens the belt.\nLenny feels the climax building.\nFaith's body shakes as the killer comes... she cries out\nherself, in pain... or is it?  The killers hand releases\nthe belt.  We see Faith gasping for breath and moaning.\nSuddenly the POV whips sideways to the mirrored closet\ndoors along one wall.  In the mirror is a reflection of\nthe bed and on it Faith.  And on her...\n... MAX.\nPants down, her legs pulled up around him.  They are both\ngasping for breath, spent, following their shattering\norgasms.  He runs his hands over her sweat-slick belly.\nLENNY is stunned beyond his power to imagine.  He does not\nhave the strength or the will to stop the tape.\nIN POV Max's hands remove her blindfold.  She looks right\nat us, still gasping with the aftershocks of her pleasure.\nMax's hands undo the handcuffs, freeing her.  She reaches\nfor us, her eyes glittering with sated lust.  We slump\nforward onto her, and her face fills the POV."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "I love you."
  },
  {
   "type": "stage direction",
   "text": "Lenny is reeling with these revelations.  His best friend\nis the killer.  And the woman he loved loves him.  But the\ntape is not over...\nTHE POV CONTINUES as Max's eyes whip around in response to\na sound behind them.  The bedroom door is opening.  Tran\nis standing there, stunned.  Maybe the first time he's\never been surprised in his life.  What a way to start.\nLike lightning we are off the bed snatching our .45 from\nthe night stand and whipping around... putting the muzzle\nright in Tran's face.  We pull him roughly across the\nroom, too stunned to resist."
  },
  {
   "type": "speech",
   "character": "TRAN",
   "text": "You're going to die, you're both\ngoing to fucking die."
  },
  {
   "type": "stage direction",
   "text": "We slam him back against the mirror wall and jam the\nmuzzle of the gun right in his mouth: a deadly gag.  Using\nthe gun we push him down until he is sitting on the floor\nwith his back to the mirror.\nOur eyes whip to Faith.  She is freaking out.  We see\nMax's reflection in the mirror as he talks to her, talking\nfast."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "This piece of puke hired me to kill\nyou, baby.  Do you believe that?\nIsn't that right, Tran?  You\npinhead."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Oh my God.  I don't believe this is\nhappening."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Believe it.  Now bring me the\ntrodes, baby.  Come on, quick."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "What're you going to do?"
  },
  {
   "type": "stage direction",
   "text": "Still in a kind of stupor, she hands him the trodes.  Max\nputs the trodes on Tran's head, then pulls something out\nof his pocket.  It is a booster box.  He plugs it into the\ndeck.  He takes the gain control and cranks it all the way\nup.  He's setting up a cook-off.  Tran's eyes go wide when\nhe figures that out, starts to splutter."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "You can't just... kill him."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "I'm not.  Just a little poach job."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Jesus."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Hey, he was going to kill you.  And\nthis ratfuck paid to have Iris\nkilled, to save his own sorry ass."
  },
  {
   "type": "stage direction",
   "text": "Tran freaks at that point but Max jams the gun deep into\nhis throat, up to the trigger guard, choking off his\nwords."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "You shut the fuck up, right now,\nI'm gonna pull this fuckin' trigger!"
  },
  {
   "type": "stage direction",
   "text": "K-BANG!  Faith shrieks, thinking Max shot him.  But it's\njust the start of the fireworks outside (remember all this\nhas already happened relative to Lenny entering the\nsuite)."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Look, baby, it's now of never... the\nguy is a known input junkie, so a\nlittle OD won't surprise anybody.\nIt's the only way we can be\ntogether.  You know it's true."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "My God."
  },
  {
   "type": "stage direction",
   "text": "We don't know if her reaction is to the horror of what is\nabout to happen, or to the realization that she has the\ncapacity to let it happen."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Here's how much I love you, baby."
  },
  {
   "type": "stage direction",
   "text": "She stares, transfixed, as Max reaches for the deck.  He\npunches PLAY.  Max puts his hand over Tran's mouth to\nmuffle his screams as the input hits his brain like a\nscreaming chainsaw of static from Hell.  The screaming\noutside, the pandemonium, give the moment a special\nmadness.\nThe POV turns, looking out the window... staring fixedly\nat burst after burst of brilliant fireworks.  Like the\nfireworks inside Tran's head.\nTHE TAPE ENDS.\nLenny takes off the trodes.  He is wrung out, drenched\nwith sweat.  We see that there is a figure standing in the\ndoorway behind him.  Lenny turns, not surprised to see Max\nthere with his .45 aimed at Lenny's chest.  Max's surgical\ngloves look incongruous with his tux."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Don't make any assumptions about our\nfriendship, Lenny."
  },
  {
   "type": "stage direction",
   "text": "Lenny stands up, slowly."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "No.  I suppose not.  I didn't know\nyou were colorblind, Max."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Only way I could stand your ties."
  },
  {
   "type": "stage direction",
   "text": "Max moves up to him cautiously, and takes the Glock out of\nLenny's waistband."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "I'll have that.  Glock 22.  Nice."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Where's Faith?"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "I sent her to the party.  I figured\nI'd wait up here until you killed\nTran."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "What makes you think I'm gonna kill\nTran?"
  },
  {
   "type": "stage direction",
   "text": "Max looks out the window at the fireworks.  Waits for a\nflash, knowing that the bang will follow.  Keeping his own\n.45 on Lenny, he aims Lenny's Glock at the catatonic Tran.\nBLAM!  One right into Tran's forehead.  The crack of\nthunder from the fireworks masks the sound."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "You just did."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Jesus!"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "You know, statistically that's the\nsecond most common word people say\nright before they die.  Shit being\nnumber one."
  },
  {
   "type": "stage direction",
   "text": "Max sticks Lenny's Glock in his waistband, keeping his own\n.45 trained on Lenny.  Lenny knows the next bullet is for\nhim.  He does what he does best... talk."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "So... I killed Tran.  Then you ran\nin, being on his payroll, and shot\nme."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "That's pretty much the way it\nhappened."
  },
  {
   "type": "stage direction",
   "text": "CUT TO FAITH in the living room, moving silently up to the\nedge of the door frame.  She looks through the crack\nbetween the door and the jam.  Her POV: Max with the gun\non Lenny."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Wait a minute.  Now I'm remembering.\nI killed Iris too, didn't I?"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "That's right.  They'll find the\noriginal of her snuff clip in your\napartment.  The one I left for you\nat the club was a copy."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Was I a really busy guy?  Did I do\nTick too?"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "You bet.  Did you like it?"
  },
  {
   "type": "stage direction",
   "text": "Lenny drops the cutesy role."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "So why Max... why d'ya have to do\nIris?  She never hurt anybody."
  },
  {
   "type": "stage direction",
   "text": "CU FAITH, reacting to this."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Picture it... I feel like I gotta\nshare this with somebody.  It's too\nperfect."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "I won't say anything."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "I know.  So, I'm working for this\npuke, right?  And he says he'll pay\nme quite large to do the hooker.\nBut also I gotta do his bitch\ngirlfriend cause she knows the whole\nscore and she's totally out of\ncontrol."
  },
  {
   "type": "stage direction",
   "text": "Lenny nods.  Starting to see it."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Only he doesn't know about me and\nFaith.  So I say to myself, if I\nturn the job down, he just gets\nsomebody else.  And I lose Faith...\nto coin a phrase.  So to buy time, I\ndo the skank.  I still gotta do\nsomething about Tran... I figure\nit's him or me... but I can't cap\nhim without a chump to take the\nfall.  And who better than his\ngirlfriend's loser ex-boyfriend... a\nknown criminal... who has been seen\nhassling them in public numerous\ntimes."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "And who was, regrettably, also your\nbest fucking friend."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "No plan is perfect, Lenny.  Hey,\ncheer up.  World's gonna end in ten\nminutes anyway."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "You must be so pleased, I followed\nyour jellybean trail right here,\nlike a good little chump."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "You got froggy on me a couple times."
  },
  {
   "type": "stage direction",
   "text": "CUT TO: The Underground Garage, where Tick has been\ncooked-off.  We see Max running his number on Mace and\nLenny.  Lenny buying it."
  },
  {
   "type": "speech",
   "character": "MAX (V.O.)",
   "text": "I thought that riff about the Death\nSquad was pretty good.  I hadda keep\nyou from bringing the cops into it."
  },
  {
   "type": "stage direction",
   "text": "AND BACK again to REAL TIME."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "So there never was a death squad."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Naawww."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Just those two loose-cannon cops\nrunning around covering their butts."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Yeah.  Pretty zany, huh?  All this\nshit caused by a random traffic\nstop.  Hey... nothing means nothing.\nYou know that.  Look around... the\nwhole planet's in total chaos.  You\ngotta take what you can, while you\ncan.  Cause some shitbird can come\nup and put a fuckin' .22 in the back\na your head any second."
  },
  {
   "type": "stage direction",
   "text": "CUT TO: A brief, violent flash from the Jeriko tape: Spreg\nshoots Jeriko."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "How did you hook up with Faith?"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "This dink hires me a month ago to\neyeball her, right?  But Faith knows\nme from you, right, so she comes up\nto me and says, 'Hey Max why you\nfollowing me?' I say, 'I'll buy you\na drink and explain.' And she says..."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "'So, do you enjoy watching me?'"
  },
  {
   "type": "stage direction",
   "text": "Max turns and sees her in the doorway."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "You were supposed to go downstairs,\nbaby."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "I know.  I don't always do exactly\nwhat I'm told."
  },
  {
   "type": "stage direction",
   "text": "(she walks slowly\ntoward them)"
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "So I said, 'Do you enjoy watching\nme?'  And you said -- come on Max."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "I said, 'Yeah.  I'd even do it for\nfree.'"
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Uh huh.  And I said, 'That's good,\nbecause I like the feeling of\nsomeone watching me.  I acquired\nthe taste from Lenny.'"
  },
  {
   "type": "stage direction",
   "text": "Lenny looks between Faith and Max, feeling like the\nasshole of the western world.  Faith moves up close to\nMax.  She puts her hands lightly on his shoulders,\ncaressing them.  Max grins, realizing she is 100% with\nhim."
  },
  {
   "type": "stage direction",
   "text": "(to Lenny)"
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "And then she said, 'Since we're\ngoing to be spending so much time\ntogether--'"
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "'We might as well make the best of\nit.'"
  },
  {
   "type": "stage direction",
   "text": "(crushed)"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Jesus, Faith."
  },
  {
   "type": "stage direction",
   "text": "Faith runs her hands appreciatively over Max's shoulders\nand arms.  Then, in an eyeblink, she grabs his forearm in\nboth hands and deflects the gun."
  },
  {
   "type": "speech",
   "character": "FAITH",
   "text": "Lenny!!"
  },
  {
   "type": "stage direction",
   "text": "Lenny jumps in, wrestling Max for the gun.  Faith pulls\nthe Glock out of Max's waistband and throws it across the\nroom."
  },
  {
   "type": "speech",
   "character": "MAX",
   "text": "Fucking bitch!!"
  },
  {
   "type": "stage direction",
   "text": "BLAM!  BLAM!  Max fires wildly, trying to hit Lenny, who\nis just barely keeping the muzzle out of his face.  Faith\ngrabs Max's hair, trying to pull him away...\nHis \"hair\" comes off in her hands.  A prosthetic wig,\ncontaining the squid-net array.  Max's head is shaved to a\nSinead O'Connor stubble.  He looks demonic, grimacing with\neffort as he struggles with Lenny.\nHe continues firing.  The shots hit the mirrors.  ANGLES\nof the reflected images of them shattering.  Faith,\nscreaming, reflected, her face fragmenting into shards.\nThe crystal chandelier shatters, reigning glassy snow on\nthem from above.\nMax is stronger and heavier than Lenny, but Lenny has one\nadvantage: Max has managed to make him really angry.\nLenny gives a guttural cry and drives Max backward into\nthe doorframe.  They tumble together into the living room,\nfalling together over the couch.  Lenny pounds Max's hand\nagainst the glass coffee table, shattering it.  He forces\nMax's hand along a glass edge, cutting it, and Max drops\nthe gun.  Lenny reaches for it, but Max kicks it away a\nsplit-second before his hand touches it.  It skitters\nunder the couch, out of play.\nMax punches Lenny brutally in the face, then in the gut,\nand grabs him with both hands.  He hurls him against the\nwall.  Lenny staggers off the wall into several vicious\npunches from Max.  We feel the tide turning.  Lenny goes\ndown to one knee.\nMax pulls out his knife and flicks it open.  Lenny throws\na lamp.  Max ducks and charges through.  Lenny spins away\nfrom the downthrust.\nThe knife embeds itself in his shoulder blade, sunk into\nthe bone.  Lenny punches Max in the throat and jerks away,\npulling the knife handle out of Max's hand.  Max tackles\nhim and they crash together through a sliding glass door\nonto the balcony.  Explosion of flying glass.\nMax pulls a dazed Lenny to his feet and rushes him\nbackward toward the railing.  At the last instant, Lenny\ntwists with all his strength and spins Max into the\nrailing, using his weight against him.  He pushes hard and\nMax topples.\nAs he is going over, Max grabs Lenny's tie, pulling him\nover.  Max is dangling 12 stories above the oblivious\ncrowd, his entire weight hanging from Lenny's tie.  Lenny\nhas one arm and one foot hooked around the railing, and he\nis being strangled by the tie.\nLenny is starting to black out.  In agony he gropes with\nhis free hand to his own shoulder blade, finding the\nhandle of the knife.  He jerks it out of himself.  Max\nsees it coming a split second before it happens.\nLenny slashes the knife across the tie, just above Max's\nhands.\nMax takes the express elevator to Hell.  He hits 12\nstories down, on top of a video truck.\nLenny stands there panting, bleeding down the back of his\njacket.  Faith runs to the railing and looks down.  All\nthe strength goes out of her legs.  She sags to the floor.\nFireworks continue to boom across the sky.\nLenny looks down at her, gazing at the object of his\nquest.  She looks up at him, her wet eyes seemingly at the\nbottom of a deep well from which he cannot save her.\nHe turns and walks away.  It's hard.  But he keeps\nwalking.\nCUT TO:"
  },
  {
   "type": "location",
   "text": "EXT.  STREET - NIGHT"
  },
  {
   "type": "stage direction",
   "text": "DOWN BELOW, in the madness of the crowd, we move with\nSpreg as he searches for Mace.  He sees her from behind,\nwalking near one of the stages.  He moves up behind her,\naiming his pistol at the back of her head.  She turns\nand...\n... it isn't Mace.  Another girl in a similar dress.\nSpreg curses and looks around.\nEngelman catches a glimpse of Mace running.  He points to\nher position and Spreg charges after her.  He has his\nbaton laid back along his forearm and is clubbing people\nout of the way as he runs.\nMace sprints barefoot through the crowd, pushing people\nout of her way.  Strobe-lights from the stage and flashes\nfrom the fireworks give the crowd a nightmarish look.\nSpreg fires at her.  People drop, their screams drowned\nout by the pandemonium.  The gunshots don't register above\nthe concussions from the fireworks.  No one notices the\nshootings.  Spreg continues to fire, missing her as people\nblock his shots.  Mace won't fire back in the crowd.\nON SPREG, coming to a stop at the base of a lighting\ntower.  He has lost sight of her.  He starts to reload his\npistol.  Mace comes up to him silently from behind the\ntower and hammer punches him behind the ear with the butt\nof her pistol.\nSpreg comes around with a roar, slamming the baton across\nher forearm.  Her .380 clatters to the ground.  Mace\nbodyslams him back against the steel tower, smashing her\npalm up under his chin.  His head raps off the metal.\nMace is like a she-panther.  She rips the baton out of his\nhands and cracks him once across the windpipe.  He drops\nto his knees, gagging and unable to breathe.\nA shot hits the metal space-frame next to her head.  She\nspins to see Engelman, charging toward her.  Before he can\nfire again she drops behind the kneeling, gasping Spreg,\nusing him as a human wall.  She clamps an arm around his\nneck, controlling him, and pulls his tazer from his belt.\nShe shoots Engelman in the chest from 8 feet.  He\nconvulses and drops instantly to the pavement, flopping\nlike a fish.  She holds the current on him while she goes\nover and kicks his gun away.\nShe takes Engelman's cuffs from his belt.  Spreg glares at\nher through the blood running into his eyes.  She raises\nthe baton."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "All the way down!  RIGHT NOW!!"
  },
  {
   "type": "stage direction",
   "text": "He slowly drops to the pavement, face down.  Now that\nshe's got them both proned out, she quickly handcuffs one\nof Spreg's hands to one of Engelman's.\nThe crowd of partiers stares.  Can't believe what they're\nseeing.  Mace takes Spreg's cuffs and attaches his other\nwrist to the base of the tower.  That's when THREE LAPD\nCOPS in riot gear burst through the surrounding crowd and\nsee a black girl crouching over two of LA's finest with a\npolice baton.  The cops advance toward her."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Wait.  Let me tell you what's going\non here--"
  },
  {
   "type": "stage direction",
   "text": "The nearest shoots her with a tazer.  She spasms and goes\nto her hands and knees.  One of the cops kicks her down.\nShe cries out, trying to explain, but she can't get the\nbreath as the batons start to fall.  The crowd around them\nwatches fascinated, gasping.\nMace sees another cop arrive and start to uncuff Spreg."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "NO!!  NO!!!"
  },
  {
   "type": "stage direction",
   "text": "They crack her with their batons, telling her to stay\ndown.  Another one kicks her in the stomach.\nA BLACK KID in the crowd leaps onto one of the kicking\ncops.\nAnd then they come out of the crowd... one, then three,\nthen half a dozen.  Just normal people... black, white,\nLatino people... that can't watch this happen any more.\nThey jump the cops, swarming them, wrestling them down.\nIt becomes a brawl.\nThen cops are running in from everywhere.  We see the\ntrigger point of a full-scale riot.  Cops in full riot-\ngear, with Lexan shields, push the crowd back, clearing a\nspace.  A helicopter XENON comes straight down from above,\nlike the divine light of God.\nMace hugs herself, at the center of it, unable to get up.\nWithin seconds there are twenty cops there, and more on\nthe way, forming a human wall.  They get the crowd settled\ndown.\nThrough the phalanx of riot cops comes Palmer Strickland\nand several ranking officers.  He surveys the scene.\nStrickland looks down at Mace and then at Spreg and\nEngelman, who are getting to their knees, though still\nhandcuffed to each other and the steel tower.  The beat\nextends... Strickland unreadable, face stern as Moses.\nThen...\nHe points at the two prone cops."
  },
  {
   "type": "stage direction",
   "text": "(to the nearest\nofficers)"
  },
  {
   "type": "speech",
   "character": "STRICKLAND",
   "text": "These two are under arrest for\nmurder."
  },
  {
   "type": "stage direction",
   "text": "Strickland looks Spreg in the eye and holds up Lenny's\nsquid tape.  Spreg and Engelman react, knowing they are\nover.  The helicopter Xenon gives the whole moment an\notherworldly quality.  Like they are in some celestial\ncourt of judgment."
  },
  {
   "type": "speech",
   "character": "STRICKLAND",
   "text": "Get some medical attention for this\nwoman."
  },
  {
   "type": "stage direction",
   "text": "Lenny pushes through from behind Strickland.  He runs to\nMace and kneels next to her."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Are you okay?"
  },
  {
   "type": "stage direction",
   "text": "A trickle of blood runs down her face.  She nods weakly\nand reaches for him.  They hug, then they both wince in\npain.  Mace sees the cops running in to arrest Spreg and\nEngelman.  One of them unhooks Spreg from the tower."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "I got 'em, Lenny."
  },
  {
   "type": "stage direction",
   "text": "ENGELMAN LUNGES, grabbing a gun from the holster of the\nclosest cop.  He waves them back with it.  Then puts it in\nhis mouth and fires.\nHe topples against Spreg, spraying him with his spurting\nblood.  Spreg clutches him, lowering him to the ground,\nbathing in his blood.  You see him going insane, right at\nthat moment.  His face is suddenly demonic.\nSPREG, the street-monster cop, RISES IN SLOW MOTION.  His\nglare is fixed on Lenny and Mace.  He has Engelman's gun\nin one blood-drenched hand.\nLifting the dead weight of Engelman by the handcuff, he\nbegins to drag the body, lurching toward Mace.  He keeps\nthe pistol down along his side.  Spreg exists at the\ncenter of a circle of cops who don't know what to do.  He\nhas a gun so they can't rush him.  But he's a cop, so they\ncan't shoot him.  Several officers shout at him to drop\nthe weapon.  You barely hear them over the pandemonium of\nthe crowd, the helicopter, the fireworks."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "SHOOT!"
  },
  {
   "type": "stage direction",
   "text": "Like a scene from a nightmare the blood-drenched Spreg,\ncompletely unhinged, lurches toward them.  Engelman's body\nslides over the ground, leaving a snail-track of blood a\nfoot wide."
  },
  {
   "type": "speech",
   "character": "SPREG",
   "text": "YOU FUCKING NIGGER BITCH!!"
  },
  {
   "type": "stage direction",
   "text": "He raises Engelman's pistol, points it at her and...\nLenny throws himself across her, turning his back to take\nthe fire, and...\nPOW POW POW!  The LAPD executes Spreg in a hail of fire.\nHe drops like a sack of cement.\nThe smoke clears.  Lenny blinks... realizing he is alive.\nHe faints.  Mace shakes him, thinking he is shot.  He\nopens his eyes."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Yeah, what?"
  },
  {
   "type": "stage direction",
   "text": "CUT TO SEVERAL MINUTES LATER.  Mace and Lenny are being\nescorted through the crowd by Strickland and a number of\ncops who part the rowdy mob before them.\nLenny and Mace are both limping, bruised, cut up.  Lenny's\narm is drenched with blood from his shoulder wound.  They\nsupport each other like two soldiers after a battle.\nMace sees Faith... FAITH, escorted by a couple of cops,\npassing near them.  She is in handcuffs and her eyes are\ndull.  Mace turns back to Lenny..."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Are we under arrest?"
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Naw.  They just have to ask us a\nfew questions... for about six\nhours."
  },
  {
   "type": "stage direction",
   "text": "They pass DEATH, with the (plastic) BABY still in his\narms.  Life out of Death in the endless continuum.  Lenny\npushes the scythe out of the way so they can get past.\nThey reach a row of police cars and an ambulance.  The EMT\nguys run to Lenny, helping him painfully out of his suit\njacket.  Strickland motions Mace toward a waiting squad\ncar.  Lenny sees...\nThe CLOCK MIME, who smiles at him and puts his hands at\nmidnight.  We hear a roar passing through the crowd.  A\nhuge chanting and cheering, that becomes thunderous as\neveryone begins to shout the countdown to midnight."
  },
  {
   "type": "speech",
   "character": "CROWD",
   "text": "TEN!  NINE!  EIGHT!..."
  },
  {
   "type": "stage direction",
   "text": "Lenny and Mace look around... the wonder of it sinking in."
  },
  {
   "type": "speech",
   "character": "CROWD",
   "text": "SEVEN!  SIX!  FIVE!..."
  },
  {
   "type": "stage direction",
   "text": "Mace and Lenny let it wash over them... the deliverance\nfrom darkness."
  },
  {
   "type": "speech",
   "character": "CROWD",
   "text": "FOUR!  THREE!  TWO!  ONE!  HAPPY NEW\nYEAR!"
  },
  {
   "type": "stage direction",
   "text": "The exultation of the moment flows through them as the\npeople lift their voices in a great cheer.  Balloons are\nreleased, confetti and streamers fly in a blizzard.\nCouples grab each other and kiss passionately."
  },
  {
   "type": "stage direction",
   "text": "(grinning)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Hey, Lenny.  We made it."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "Yeah.  We did."
  },
  {
   "type": "stage direction",
   "text": "She hugs him.  Then pulls back.  Friends... yes.  And\nalways.  But there's that line that she can't cross.  Only\nhe can do that."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Well..."
  },
  {
   "type": "stage direction",
   "text": "(she shrugs)"
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Get going.  You're still bleeding."
  },
  {
   "type": "speech",
   "character": "LENNY",
   "text": "See you downtown."
  },
  {
   "type": "speech",
   "character": "MACE",
   "text": "Yeah.  See you there."
  },
  {
   "type": "stage direction",
   "text": "TRACKING WITH LENNY as he walks toward the ambulance.\nThey open the back door for him.  The walk is\nhallucinatory... with confetti falling like snow, and the\nhysteria of the crowd.  He looks back at Mace as the\nparamedics help him up into the ambulance.  The back doors\nclose.\nON MACE, watching him go.  A cop gently takes her arm,\nopening the squad car door for her.  She turns away, her\nface sad amid the exultation of the crowd.  She gets into\nthe back seat.  The door slams.  Strickland gets in next\nto her.  The driver starts the car.  They start to move,\nand...\nThere is pounding on the glass, startling her, and...\nThe door is wrenched open...\nA hand comes in, grabbing her arm, pulling her out...\nLenny.  His eyes are full of emotion.\nHe grabs her in his arms, fiercely, and kisses her... like\nthere's no tomorrow.  She grabs his head and won't let him\nbreak, even if he wanted to, which he doesn't.\nStrickland, in the car, rolls his eyes and looks at his\nwatch.  Reflex.  Because if there's one time you don't\nneed a watch, it's...\n12:01  A.M.  JANUARY 1, 2000\nPULL BACK AND UP as Lenny and Mace stay locked together,\nwhile the cops wait for them, and the world begins again."
  },
  {
   "type": "character",
   "text": "THE END"
  }
 ]
}